{"task": "rw_72.jsonl", "id": 62117, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62118, "text": "When you use CCTV mobile products and services, we may collect and use your relevant information.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62119, "text": "We hope to explain to you through this \"Privacy Policy\" that when we use our services, how do we collect, use, store, and share this information, and the way we provide for you to access, update, control and protect these information.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62120, "text": "This \"Privacy Policy\" is closely related to the services you use. We also hope that you can read it carefully and make a choice you think in accordance with the guidance of this \"Privacy Policy\" when needed.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62121, "text": "The related technical vocabulary involved in this \"Privacy Policy\", we try to explain to you with concise expressions as much as possible, and provide further explanation links for your understanding.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62122, "text": "If you use or continue to use our services, you say that you agree that we can collect, use, store and share your information according to this \"Privacy Policy\".", "label": ["Policy Change", "Important", "Risk"], "rewrite": "You use or continue to use our services to indicate that you agree with this policy."}
{"task": "rw_72.jsonl", "id": 62123, "text": "If you have any questions about this \"Privacy Policy\" or related matters related to this \"Privacy Policy\", please contact us through the \"user feedback and help\" in the personal center.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62124, "text": "The information we may collect", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62125, "text": "When we provide services, we may collect, store and use the following information related to you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62126, "text": "If you do not provide relevant information, you may not be able to register as our users, enjoy some services we provide, or even if we can continue to provide you with some services, we cannot achieve the effect that the service intends to achieve.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62127, "text": "The information you provide", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62128, "text": "• When you register our account or use our services, you provide relevant personal information provided by us, such as phone numbers, emails, etc.;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect personal information provided by your registered account or use services."}
{"task": "rw_72.jsonl", "id": 62129, "text": "•, shared information provided by other parties through our services, and information stored when you use our services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you stored to other parties through the service and the information stored when using the service."}
{"task": "rw_72.jsonl", "id": 62130, "text": "Your information shared by other parties", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your information shared by other parties."}
{"task": "rw_72.jsonl", "id": 62131, "text": "• Other parties provide shared information on your service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting other parties when using our services to provide shared information."}
{"task": "rw_72.jsonl", "id": 62132, "text": "The information we get", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62133, "text": "When you use our service, we may collect the following information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62134, "text": "• Log information means that when you use our service, the system may pass, cookies, or other methods to automatically collect technical information, including:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use your service, the system will automatically collect technical information through cookies or other methods."}
{"task": "rw_72.jsonl", "id": 62135, "text": "• Device or software information, such as your mobile device, web browser, or the configuration information provided by other programs you use to access our services, your IP address and the version and device recognition code used by your mobile deviceItems", "label": ["Important", "First Party Collection Information"], "rewrite": "When you connect to the service, collect your device or software configuration information, IP address, and the version and device identification code used in your mobile device."}
{"task": "rw_72.jsonl", "id": 62136, "text": "•, you search and browse information when using our service, such as the web search words you use, the social media page URL address of the access, and other information and content details you are provided when you use our service;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your search and browsing information when using your service."}
{"task": "rw_72.jsonl", "id": 62137, "text": "• The information (metadata) contained in the content you shared through our service, such as the date, time, or place of the shared photo or video of shooting or uploading.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information contained in the content you shared through our service."}
{"task": "rw_72.jsonl", "id": 62138, "text": "• Location information means that when you open the device positioning function and use the relevant services provided by our location, the information we collect about your location, including:", "label": ["Important", "First Party Collection Information"], "rewrite": "When you turn on the device positioning function and use the relevant services provided by the location, collect your location information."}
{"task": "rw_72.jsonl", "id": 62139, "text": "• When you use our services through mobile devices with positioning functions, we pass, GPS, or, WiFi, and other methods to collect your geographical location information;", "label": ["Important", "First Party Collection Information"], "rewrite": "When using a device with a positioning function, we collect your geographical location information through GPS or WiFi."}
{"task": "rw_72.jsonl", "id": 62140, "text": "•, the real -time information provided by your or other users contains your geographical location, such as the information contained in the account information you provided, you or others uploaded to show the shared information you currently or once you are in your geographical location.For example, the geographical mark information contained in the photos shared by you or others;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real -time information provided by you or other users."}
{"task": "rw_72.jsonl", "id": 62141, "text": "•, you can stop the collection of your geographical location information at any time by closing the positioning function.", "label": ["Edit/Control", "Important"], "rewrite": "Stop the collection of geographical information at any time through closing the positioning function."}
{"task": "rw_72.jsonl", "id": 62142, "text": "How can we use information", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62143, "text": "We may be used as the following uses in the process of providing you in the process of providing you:", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62144, "text": "• Provide you with services;", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62145, "text": "• When we provide services, we are used for authentication, customer service, security precautions, fraud monitoring, archiving and backup purposes to ensure the safety of the products and services we provide to you;", "label": ["Important", "Usage"], "rewrite": "When we provide services, your personal information will be used for identity verification, customer service, security defense, fraud monitoring, archiving and backup purposes."}
{"task": "rw_72.jsonl", "id": 62146, "text": "• Help us design new services and improve our existing services;", "label": ["Important", "Usage"], "rewrite": "Your personal information will be used to help us design new services and improve our existing services."}
{"task": "rw_72.jsonl", "id": 62147, "text": "• Let us know how to access and use our services, so as to respond to your personalized needs, such as language settings, location settings, personalized help services and instructionThe users we serve make other responses;", "label": ["Important", "Usage"], "rewrite": "In your personal information, we know how to access and use our services, so as to respond to your personalized needs targeted."}
{"task": "rw_72.jsonl", "id": 62148, "text": "• Provide you with more related advertisements with you to replace the advertisements that are universal;", "label": ["Important", "Usage"], "rewrite": "Your personal information will be used to provide you with more related advertisements."}
{"task": "rw_72.jsonl", "id": 62149, "text": "• Evaluate the effects of advertising and other promotions and promotion activities in our services, and improve;", "label": ["Important", "Usage"], "rewrite": "Your personal information will be used to evaluate the effects of advertising and other promotion and promotion activities in our services and improve it."}
{"task": "rw_72.jsonl", "id": 62150, "text": "•, software authentication or management software upgrade;", "label": ["Important", "Usage"], "rewrite": "Your personal information will be used for software authentication or management software upgrades."}
{"task": "rw_72.jsonl", "id": 62151, "text": "• Let you participate in investigations about our products and services.", "label": ["Important", "Usage"], "rewrite": "Your personal information will be used to allow you to participate in surveys of products and services."}
{"task": "rw_72.jsonl", "id": 62152, "text": "In order to allow you to have a better experience, improve our service or other uses you agree, on the premise of compliance with relevant laws and regulations, we may collect information or personalized information collected by our service to gather information or personalized information or personalizationThe method is used for other services.", "label": ["Important", "Usage"], "rewrite": "We may bring together a service collected information or use it for other services in a personalized manner."}
{"task": "rw_72.jsonl", "id": 62153, "text": "For example, the information collected when you use one of our services may be used to provide you with specific content in another service, or to show you the information related to you and universal push.", "label": ["Important", "Usage"], "rewrite": "Collect information you use a service to provide services in another service center."}
{"task": "rw_72.jsonl", "id": 62154, "text": "If we provide the corresponding options in related services, you can also authorize us to use the information provided and stored by the service for our other services.", "label": ["Important", "Edit/Control"], "rewrite": "If we provide the corresponding options, you can also authorize us to use the information provided and stored by the service for our other services."}
{"task": "rw_72.jsonl", "id": 62155, "text": "How do you access and control your personal information", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62156, "text": "We will do everything possible to adopt appropriate technical means to ensure that you can access, update and correct your registration information or use other personal information provided by our services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62157, "text": "When visiting, updating, correcting, and deleting your personal information, we may ask you to verify your authentication to ensure your account security.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "When visiting, updating, correcting, and deleting your personal information, we will verify your identity."}
{"task": "rw_72.jsonl", "id": 62158, "text": "The information we may share", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62159, "text": "Except for the following circumstances, without your consent, we and our affiliated companies will not share your personal information with any third party:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the following circumstances, without your consent, we and our affiliated companies will not share your personal information with any third party:"}
{"task": "rw_72.jsonl", "id": 62160, "text": "• We and our affiliates may bring your personal information with our affiliated companies, partners and third -party service providers, contractors and agents (such as the communication service provider that sends out an email or push notification, andProvide us with a map service provider for location data) to share (they may not be located in your land) and are used as the following use:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Our and our affiliated companies may share your personal information with our affiliated companies, partners and third -party service providers, contractors and agents."}
{"task": "rw_72.jsonl", "id": 62161, "text": "• Provide you our services;", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62162, "text": "• Realize the purpose of the \"How can we use information\" part;", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62163, "text": "• Perform our obligations and exercise our rights in this \"Privacy Policy\";", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62164, "text": "• Understand, maintain and improve our services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62165, "text": "If we or our affiliates share your personal information with any of the above -mentioned third parties, we will strive to ensure that these third parties comply with this \"Privacy Policy\" and other appropriate confidentiality and other appropriate confidentiality and other appropriate confidentiality andSafety measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If you share your personal information, we will ensure that third parties abide by the privacy policies and other appropriate confidentiality and security measures we require."}
{"task": "rw_72.jsonl", "id": 62166, "text": "• Our or our affiliates may also be retained, preserved or disclosed that your personal information is required below:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk", "Usage"], "rewrite": "Our or our affiliated companies may also be retained, preserved or disclosed for your personal information:"}
{"task": "rw_72.jsonl", "id": 62167, "text": "• Comply with relevant regulations such as applicable laws and regulations;", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62168, "text": "• Comply with the court's judgment, ruling or other legal procedures;", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62169, "text": "• Comply with the requirements of relevant government agencies or other legal authorization organizations;", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62170, "text": "• In order to comply with applicable laws and regulations, safeguard social public interests, or protect the personal and property security or legitimate rights of the personal and property of our group companies, our customers, other users, or employees.", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62171, "text": "information security", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62172, "text": "We only retain your personal information during the time limit for the purpose of the \"Privacy Policy\" and the time limit required by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_72.jsonl", "id": 62173, "text": "We use various security technologies and procedures to prevent information loss, improper use, unauthorized reading or disclosure.", "label": ["Important", "Data Security"], "rewrite": "Use various security technologies and procedures to prevent information from being lost, improperly used, unauthorized reading or disclosure."}
{"task": "rw_72.jsonl", "id": 62174, "text": "But please understand that due to the technical restrictions and the various malicious means that there may be, in the Internet industry, even if you can do your best to strengthen security measures, it is impossible to ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_72.jsonl", "id": 62175, "text": "You need to understand that the systems and communication networks you use to access our services may occur due to situations outside of our controlled range. In this case, you agree that we will adopt the way of remedy afterwards to minimize the impact as much as possibleEssence", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to uncontrolled factors. You will agree to remedy afterwards to reduce the impact."}
{"task": "rw_72.jsonl", "id": 62176, "text": "The information you share", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62177, "text": "Our multiple services allow you to share your relevant information publicly with your social network but also all users who use the service. For example, the information you uploaded or published in our service (including what you publicPersonal information, etc.), your response to other people uploaded or published, and location data and log information including information related to this information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You can share the information uploaded or published, respond to the information uploaded or published by others, and related location data and log information."}
{"task": "rw_72.jsonl", "id": 62178, "text": "Other users using our service may also share information related to you.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Other users using our service may also share information related to you."}
{"task": "rw_72.jsonl", "id": 62179, "text": "As long as you do not delete the shared information, the relevant information will always remain in the public field;", "label": ["Important", "Risk"], "rewrite": "As long as you do not delete sharing information, the relevant information will always leave the public field."}
{"task": "rw_72.jsonl", "id": 62180, "text": "At the same time, please note that even if you delete sharing information, the relevant information may still be cached, replicated or stored by other users or non -associated third parties that are not controlled by us or are not controlled by us, or is preserved by other users or such third parties in the public.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After deleting the information you share, it may still be independently preserved by other users or the third parties that are not controlled by us."}
{"task": "rw_72.jsonl", "id": 62181, "text": "Therefore, please consider the information content that uploads, publish and communicate through our services.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62182, "text": "Sensitive personal information you share", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62183, "text": "Some personal information may be considered as sensitive personal information because of its particularity, such as your race, religion, personal health and medical information.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62184, "text": "Compared with other personal information, sensitive personal information is more stricter.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62185, "text": "Please note that the content and information that you provide, uploaded or published in our services (such as photos and other information about your social activities) may leak your sensitive personal information.", "label": ["Important", "Risk"], "rewrite": "The content and information you provided, uploaded or published in the service may leak your sensitive personal information."}
{"task": "rw_72.jsonl", "id": 62186, "text": "You need to consider carefully whether to disclose relevant sensitive personal information when using our services.", "label": ["Important", "Risk"], "rewrite": "Care carefully!Whether to share or even share relevant information."}
{"task": "rw_72.jsonl", "id": 62187, "text": "You agree that your sensitive personal information is processed according to the purpose and method described in the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62188, "text": "How can we collect information", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62189, "text": "We or our third -party partners may collect and use your information through technology such as Cookies and other technologies, and store these information as log information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We or our third -party partners may collect and use your information through technologies such as COOKIES and store it as a log message."}
{"task": "rw_72.jsonl", "id": 62190, "text": "We use our own, cookies, to provide you with a more personalized user experience and services, and for the following uses:", "label": ["Important", "First Party Collection Information"], "rewrite": "Use Cookies to provide more personalized user experience and services."}
{"task": "rw_72.jsonl", "id": 62191, "text": "• Remember your identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62192, "text": "For example: Cookies helps us identify your identity as our registered user, or save you to provide us with your preferences or other information;", "label": ["Important", "Usage"], "rewrite": "Remember your identity with cookies and save your favorite or other information."}
{"task": "rw_72.jsonl", "id": 62193, "text": "• Analyze the situation where you use our service.", "label": ["Important", "Usage"], "rewrite": "Use cookies to analyze the situation of your service."}
{"task": "rw_72.jsonl", "id": 62194, "text": "For example, we can use, cookies and other technologies to understand what activities you use for our services, or which web pages or services are the most popular;", "label": ["Important", "Usage"], "rewrite": "Use Cookies and other technologies to understand your behavior information, or which webpage or services are the most popular."}
{"task": "rw_72.jsonl", "id": 62195, "text": "• Advertising optimization.", "label": ["Usage"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62196, "text": "Technology and other technologies help us provide you with advertisements related to you instead of universal advertising according to your information.", "label": ["Important", "Usage"], "rewrite": "Use Cookies technology to provide you with personalized advertisements."}
{"task": "rw_72.jsonl", "id": 62197, "text": "At the same time we use technologies such as the above goals, while cookies and other technologies, they may pass the non -personal identity information collected by technology such as Cookies and other technologies.In advertising service.", "label": ["Important", "Usage"], "rewrite": "Provide non -personal identity information statistics to advertisers or other partners to analyze how users use services and use advertising services."}
{"task": "rw_72.jsonl", "id": 62198, "text": "Our products and services may be placed by advertisers or other partners, cookies, and, web, beacon.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Advertisers or other partners may be placed in the cookies and web beacon placed in products or services."}
{"task": "rw_72.jsonl", "id": 62199, "text": "These, cookies, and, web, beacon, may collect non -personal identity information related to you to analyze how users use such services, send ads you may be interested in, or use to evaluate advertising servicesEffect.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Cookies and Web Beacon may collect non -personal identity information to analyze users' use behaviors, send advertisements, and evaluate advertising effects."}
{"task": "rw_72.jsonl", "id": 62200, "text": "These third -party, cookies, and, web, beacon, collect and use these information, are not subject to the \"Privacy Policy\", but are constrained by the privacy policy of related users.Beacon, bear responsibility.", "label": ["Important", "Risk"], "rewrite": "We are not responsible for third -party Cookies or Web Beacon."}
{"task": "rw_72.jsonl", "id": 62201, "text": "You can reject or manage through the browser, cookies, or, web, beacon.", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse or manage Cookies or Web Beacon through the browser."}
{"task": "rw_72.jsonl", "id": 62202, "text": "But please note that if you stop, cookies, or, web, beacon, you may not be able to enjoy the best service experience, and certain services may not be used normally.", "label": ["Important", "Edit/Control"], "rewrite": "If Cookies or Web Beacon is discontinued, certain services may not be used normally."}
{"task": "rw_72.jsonl", "id": 62203, "text": "At the same time, you will receive the same number of advertisements, but these advertisements are reduced with your correlation.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62204, "text": "Advertising Services", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62205, "text": "We may use your information to provide you with more related advertisements with you.", "label": ["Important", "Usage"], "rewrite": "Use your information to provide you with more related advertisements."}
{"task": "rw_72.jsonl", "id": 62206, "text": "We may send you mail and information to you", "label": ["Important", "Usage"], "rewrite": "Use your information to send you mail and information to you."}
{"task": "rw_72.jsonl", "id": 62207, "text": "Mail and information push", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62208, "text": "When you use our service, we may use your information to send email, news or push notification to your device.", "label": ["Important", "Usage"], "rewrite": "When you use your service, we may use your information to send you mail, news or push notification to you."}
{"task": "rw_72.jsonl", "id": 62209, "text": "If you don't want to receive this information, you can choose to cancel the subscription on the device according to our relevant prompts.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to receive emails, news or push messages, you can choose to cancel the subscription."}
{"task": "rw_72.jsonl", "id": 62210, "text": "Announcement related to service", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62211, "text": "We may issue an announcement related to the service -related announcement when the necessary time (such as suspending a certain service due to system maintenance).", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62212, "text": "You may not be able to cancel these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62213, "text": "The exception of privacy policy", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62214, "text": "Our services may include or link to social media or other services (including websites) provided by third parties.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62215, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62216, "text": "• You use the \"Share\" key to share some content to our service, or you use a third -party connection service to log in to our service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62217, "text": "These functions may collect your relevant information (including your log information) and may run the above functions normally on your computer device, cookies;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you share the content to our service or use the third -party connection service to log in to our service, these functions may collect your relevant information and install cookies."}
{"task": "rw_72.jsonl", "id": 62218, "text": "• We provide you with a link through advertising or other ways of service, so that you can access third -party services or websites.", "label": ["Important", "Risk"], "rewrite": "You can access third -party services or websites through the links we provide."}
{"task": "rw_72.jsonl", "id": 62219, "text": "These third -party social media or other services may be operated by related third parties or we.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62220, "text": "You use these third -party social media services or other services (including any personal information you provided to these third parties), which must be subject to the third -party service terms and privacy policies (rather than the \"General Service Terms\" or this \"Privacy Policy \") restraint, you need to read its clause carefully.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62221, "text": "This \"Privacy Policy\" is only applicable to the information we collected, and it does not apply to the service provided by any third party or the information usage rules provided by third parties. We do not have any responsibility for any third party's information.", "label": ["Important", "Risk"], "rewrite": "We do not have any responsibility for any third party's information."}
{"task": "rw_72.jsonl", "id": 62222, "text": "Minors use our service", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62223, "text": "We encourage our parents or guardians to guide minors under the age of 18 to use our services.", "label": ["Specific Audiences", "Important"], "rewrite": "Encourage parents or guardians to guide minors under the age of 18 to use our services."}
{"task": "rw_72.jsonl", "id": 62224, "text": "We recommend minors to encourage their parents or guardians to read the \"Privacy Policy\" and recommend that minors seek the consent and guidance of their parents or guardians before submitting personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "Proposed minors' guardians read the \"Privacy Policy\" and suggested that minors seek the consent and guidance of parents or guardians before submitting personal information."}
{"task": "rw_72.jsonl", "id": 62225, "text": "Scope of application of privacy policy", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62226, "text": "Except for some specific services, all our services are applicable to this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62227, "text": "These specific services will apply specific privacy policies.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62228, "text": "For specific privacy policies for certain services, we will more specifically explain how we use your information in these services.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62229, "text": "The privacy policy of this specific service constitutes part of the \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62230, "text": "If any specific service privacy policy is inconsistent with this \"Privacy Policy\", the privacy policy of specific services is applied.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62231, "text": "Please note that this \"Privacy Policy\" is not applicable to the following situations:", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62232, "text": "• Information collected by a third -party service (including any third -party website) accessed through our services;", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62233, "text": "• The information collected by other companies and institutions that serves advertising services in our services.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62234, "text": "change", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62235, "text": "We may amend the terms of this \"Privacy Policy\" in a timely manner, and these amendments constitute a part of the \"Privacy Policy\".", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62236, "text": "If these revisions have reduced the essence of rights under this \"Privacy Policy\", we will prompt a prominent position on the homepage before revising or send an email to you or notify you in other ways. In this case, in this case, in this case If you continue to use our services, it is the constraint of the \"Privacy Policy\" that agree with the revised \"Privacy Policy\".", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If the amendment to the privacy policy has reduced the essence of rights, we will notify you before revising the effect. In this case, if you continue to use our services, you will agree to accept this \"Privacy Policy\"."}
{"task": "rw_72.jsonl", "id": 62237, "text": "CCTV International Network Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_72.jsonl", "id": 62238, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
