{"task": "rw_7.jsonl", "id": 38732, "text": "(Latest update date: November 05, 2020)", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38733, "text": "• Foreword", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38734, "text": "We know the importance of personal information and privacy to you. We are committed to ensuring that your personal information and privacy are reasonably protected, not illegally collected, used and shared, and ensure that you have the right to know and control in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38735, "text": "In this privacy policy, when we mentioned \"Yum!\", \"Us\", \"Our\" or \"Our\", we all intend to provide you with website, mobile application, ordering terminal, online shops, social mediaOr other network services (hereinafter referred to as the \"network platform\") Huansheng E -commerce (Shanghai) Co., Ltd. (registered address: Room 907, No. 9 Floor, Tower No. 9 of Keelung Road, Shanghai Free Trade Zone), and its related companies and franchisees, Collectively called \"Yum!\".", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38736, "text": "This privacy policy is suitable for our personal information to collect, use, store, and share your personal information through all network platforms.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38737, "text": "This privacy policy is formulated according to the effective laws and regulations applied as of the revision date, and also refers to the applicable national and industry standards, international agreements and practices.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38738, "text": "In addition, when we provide you with specific products or services, we will obtain your consent in accordance with laws and regulations and the requirements of national compulsory standards to confirm the agreement, copywriting confirmation in specific scenarios, pop -up window prompts and other forms.", "label": ["Policy Change", "Important"], "rewrite": "When we provide you with specific products or services, we will confirm the agreement, copywriting confirmation in specific scenarios, pop -up window prompts, etc. to obtain your consent."}
{"task": "rw_7.jsonl", "id": 38739, "text": "There may be other specific agreements signed with you. If this Privacy Policy conflicts with other specific agreements, the other specific agreements shall prevail.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38740, "text": "When you use our services, we will collect, store, use and provide your information in accordance with the Privacy Policy (hereinafter referred to as \"this Policy\").", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38741, "text": "At the same time, we will explain to you how we provide you with services to access, update, manage and protect your information.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38742, "text": "This policy is closely related to your use of our services. We recommend that you carefully read and understand the entire content of this policy, and make the choice you think is appropriate.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38743, "text": "For the terms and personal sensitive information of major relationships with your rights and your rights in this policy, you can mark it with rough characters to prompt you to pay attention.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38744, "text": "If you have any questions, opinions, or suggestions for your personal information about your privacy policy, or to deal with your personal information, please contact us in the following way:", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38745, "text": "KFC customer service hotline: 4009200715", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38746, "text": "Pizza High Customer Hotline: 4009701890", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38747, "text": "Contact address: No. 20, Tianxiangqiao Road, Shanghai, Yum!", "label": ["Important", "Contact Information"], "rewrite": "Contact address: No. 20, Tianxiangqiao Road, Shanghai, Yum!"}
{"task": "rw_7.jsonl", "id": 38748, "text": "• How do we collect your personal information?", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38749, "text": "In order to provide services to you, we will collect your information in accordance with the principles of legality, justification and necessity.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will collect your information in accordance with the principles of legal, correctness, and necessary principles."}
{"task": "rw_7.jsonl", "id": 38750, "text": "In order to ensure that your personal information is reasonable, we define personal information as a variety of information that can identify the personal identity of natural people alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38751, "text": "In various business functions, the personal information we may collect and use includes:", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38752, "text": "(1) Circumstances in which you must authorize us to collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38753, "text": "We may collect, save and use the following information related to you to achieve the above functions.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38754, "text": "If you do not provide relevant information, you will not be able to enjoy the products and/or services we provide.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38755, "text": "These functions include:", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38756, "text": "1. Realize the functions necessary for network platform services", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38757, "text": "(1) User registration", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38758, "text": "To log in to our network platform, you will need to register as our user.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38759, "text": "When you register, you need to provide us at least the account name, password, and your mobile phone number you are preparing to use. We may verify that your identity is valid by sending a SMS verification code.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you register, you need to provide your account name, password, your mobile phone number."}
{"task": "rw_7.jsonl", "id": 38760, "text": "Your account is called your default nickname. You can modify your replenishment information (hereinafter referred to as \"supplementary information\") to supplement your nickname, gender, birthday, hobbies (hereinafter referred to as \"supplementary information\").", "label": ["Important", "First Party Collection Information"], "rewrite": "You can modify information supplementing your nickname, gender, birthday, hobbies and other information."}
{"task": "rw_7.jsonl", "id": 38761, "text": "Your supplementary account information will help us provide you with personalized product recommendations and better service experiences, but if you do not provide these supplementary information, it will not affect your basic service functions on the network platform.", "label": ["Important", "First Party Collection Information"], "rewrite": "Your supplementary account information will help us provide you with personalized product recommendations and better service experiences."}
{"task": "rw_7.jsonl", "id": 38762, "text": "(2) Confirm order information such as delivery, pick-up, and purchase", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38763, "text": "When you are going to use our buffet ordering, delivery service or purchase physical products, you need to fill in your consignee's name, receiving address and mobile phone number at least in the order. At the same timeThe meals you order or the product or service information you buy, the amount and payment method you pay for;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you are preparing to use a buffet order, delivery service or purchase physical products, you need to fill in your consignee's name, receiving address and mobile phone number."}
{"task": "rw_7.jsonl", "id": 38764, "text": "You can also fill in the consignee's fixed telephone and mailbox address information to increase more contact information to ensure that the product can be delivered accurately, but not filling in this information does not affect the generation of your order.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also fill in the consignee's fixed telephone and mailbox address information."}
{"task": "rw_7.jsonl", "id": 38765, "text": "When you buy a single -purpose commercial prepaid card issued by Yum! Issued on our online platform, you may also need to provide your real -name information according to the requirements of national laws and regulations. These real -name information includes your identity information (such as your ID card, officer officer, officer officer, officer, officer, officer, officer, officer, officer, officer, officer, officer, officer, officer, officer, officer, and officers.Certificate, passport, driver's license, etc. have a copy or number that states your identity), your own name, phone number, etc., please remind you in the specific scenario to remind you of the \"Yuman China Prepaid Card Articles of Association\".", "label": ["Important", "First Party Collection Information"], "rewrite": "When you buy a single -purpose business prepaid card, you may need to provide your real -name information."}
{"task": "rw_7.jsonl", "id": 38766, "text": "All the above information constitutes your \"order information\". We will use your order information to perform your identity verification, determine transactions, payment settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service;", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38767, "text": "We will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": ["Important", "Data Security"], "rewrite": "We will use your order information to determine whether your transaction is abnormal to protect your transaction security."}
{"task": "rw_7.jsonl", "id": 38768, "text": "If you provide us with food delivery/receiving address and personal information, make sure you have obtained legal authorization of others, and others know and agree with our privacy policy.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you provide the delivery/receiving address and personal information of others, make sure you have obtained the legal authorization of others."}
{"task": "rw_7.jsonl", "id": 38769, "text": "(3) Payment function", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38770, "text": "After you place an order, you can choose the payment services provided by the third -party payment institutions (including Alipay, WeChat Pay, UnionPay and other payment channels such as Alipay, WeChat Pay, UnionPay, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you place an order, you can choose the payment services provided by the third -party payment institutions we cooperate with."}
{"task": "rw_7.jsonl", "id": 38771, "text": "Third -party payment institutions may need to collect information, bank card types and card numbers, validity periods, and mobile phone numbers to achieve the need for payment functions. Refusing to provide normal use that will cause you to unable to use this function, but does not affect other functions.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment institutions may need to collect information necessary for your name, bank card type and card number, validity period, and mobile phone number to achieve the need for payment functions."}
{"task": "rw_7.jsonl", "id": 38772, "text": "We will not collect and store your complete bank card information, but we need to share your order number and transaction amount information with these payment institutions to achieve your payment instructions and complete the payment.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We need to share your order number and transaction amount information with these payment institutions to realize its confirmation of your payment instructions and complete the payment."}
{"task": "rw_7.jsonl", "id": 38773, "text": "(4) Delivery products or service functions", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38774, "text": "After you place an order, the third -party delivery platform (including Meituan, hungry, etc., etc., hereinafter referred to as \"third -party platform\") and third -party distribution companies (including SF, Yuantong, etc.\") The delivery of the order will be completed.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After you place an order, the third -party delivery platform and third -party distribution company that cooperate with us will complete the delivery of orders for you."}
{"task": "rw_7.jsonl", "id": 38775, "text": "You know and agree that such a third -party platform and/or third -party distribution company that cooperates with us will use your order information within the above link to ensure that your order or product can be delivered safely.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You know and agree that third -party platforms and/or third -party distribution companies will use your order information to ensure that the meal or product you order can be delivered safely."}
{"task": "rw_7.jsonl", "id": 38776, "text": "(5) Customer service and after -sales service functions", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38777, "text": "Our telephone customer service and after -sales function will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "Our telephone customer service and after -sales function will use your account information and order information."}
{"task": "rw_7.jsonl", "id": 38778, "text": "To ensure your account security, our phone customer service center and online customer service will use your account information to verify your identity with you.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38779, "text": "When you need us to provide customer service and after -sales service related to your order information, we will check your order information.", "label": ["Important", "Usage"], "rewrite": "When you need customer service and after -sales service related to your order information, we will check your order information."}
{"task": "rw_7.jsonl", "id": 38780, "text": "You may provide other information outside of the above information when communicating with our customer service staff. If you ask us to change the delivery address, contact or contact phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may provide other information outside of the above information when communicating with our customer service staff."}
{"task": "rw_7.jsonl", "id": 38781, "text": "(6) Information display and search", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38782, "text": "You can accurately find the goods or services you need by searching.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38783, "text": "We will retain your search content to facilitate you to enter or show you the products related to your search content.", "label": ["Important", "Usage"], "rewrite": "We will keep your search content to facilitate you to enter or display for you."}
{"task": "rw_7.jsonl", "id": 38784, "text": "(7) Message notification function", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38785, "text": "You can notify the service through the message provided by us, including but not limited to in the form of push and short messages to get your order status update, sacred face payment verification information, brand promotional activity information, consumer satisfaction evaluation and other information push servicesEssence", "label": ["Important", "Usage"], "rewrite": "You can get information push services through the message notification service provided by us."}
{"task": "rw_7.jsonl", "id": 38786, "text": "In order to provide you with this service, we need to share your equipment information with our designated third -party suppliers. We will evaluate the legality, legitimacy, and necessity of collecting information for the supplier;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To provide information push services, we need to share your equipment information with our designated third -party suppliers."}
{"task": "rw_7.jsonl", "id": 38787, "text": "It also requires suppliers to take protection measures for your information and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Important", "Data Security"], "rewrite": "It is required to take protection measures for your information and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_7.jsonl", "id": 38788, "text": "2. Improve the functions necessary for our products and/or services", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38789, "text": "We may collect your equipment advertising logo, order information, browsing information, your hobbies (you can choose in the account settings) for data analysis to display the product or service information you are interested in;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect your equipment advertising identification, order information, browsing information, and your hobbies for data analysis to display personalized content."}
{"task": "rw_7.jsonl", "id": 38790, "text": "Or show you the products or services you may want to find when you search.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38791, "text": "We may also obtain your other information to provide the reasonable needs of services and improve the quality of service, including the relevant information you provided when you contact the customer service, the questionnaire answering information sent to us during the questionnaire survey, and you and usThe relevant information we get when the related parties and our partners are interacted.", "label": ["Important", "Usage"], "rewrite": "We may also obtain information provided by your contact with customer service in order to provide the reasonable needs of services and improve service quality."}
{"task": "rw_7.jsonl", "id": 38792, "text": "For information collected from your various devices, we may associate them so that we can provide you with consistent services on these devices.", "label": ["Important", "Usage"], "rewrite": "We may connect the information collected from your various devices to provide consistent services."}
{"task": "rw_7.jsonl", "id": 38793, "text": "We may combine the information from a certain service with the information from other services, and use it for comprehensive statistical analysis to recommend, display or push you information that you may be interested in, or push it more suitable for your specific functions and services that are more suitable for you and services.Or suggest.", "label": ["Important", "Usage"], "rewrite": "We may combine information from a certain service with information from other services for comprehensive statistical analysis."}
{"task": "rw_7.jsonl", "id": 38794, "text": "3. Safety management", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38795, "text": "Model, IP address, MAC address, operating system version, software version, browser type, device settings, equipment advertising identifiers, mobile device recognition codes, equipment network information, equipment location, etc. (hereinafter referred to as \"equipment information\")And other service log information related to us.", "label": ["Important", "First Party Collection Information", "Data Security"], "rewrite": "In order to ensure your account security, identify account abnormal status, understand product adaptability, and ensure the safe and stable operation of services to you, we may automatically collect and record your equipment information and other service log information related to us."}
{"task": "rw_7.jsonl", "id": 38796, "text": "If you do not agree with us to record the aforementioned information, risk control verification may not be completed.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38797, "text": "(2) You can choose whether to authorize us to collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38798, "text": "1. In order to make the service more convenient and improve your service experience on our platform, our following additional functions may collect and use your personal information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Our additional features may collect and use your personal information."}
{"task": "rw_7.jsonl", "id": 38799, "text": "If you do not agree with us to collect these personal information, you may not be able to use these additional functions or need to fill in some information, but it does not affect your basic service functions. These additional functions include:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38800, "text": "(1) Personalized recommendation function based on location information: We will collect your location information (we only collect your geographical location at the time, but will not be used to judge your whereaboutsTo automatically recommend the service you can enjoy for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your location information judgment where you are, to automatically recommend the service you can enjoy for you."}
{"task": "rw_7.jsonl", "id": 38801, "text": "If you recommend you to the most optional restaurant from you, show you the menu corresponding to the restaurant, participate in the sign -in interactive activity based on your location", "label": ["Usage"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38802, "text": "(2), additional features of cameras and albums: This function can provide you with services such as sweeping, scanning code and ordering.", "label": ["Permission Acquisition", "Important"], "rewrite": "The additional functions of cameras and albums can provide you with services such as sweeping, scanning and ordering."}
{"task": "rw_7.jsonl", "id": 38803, "text": "(3) Additional functions based on voice technology: You can use microphone to input voice and interact with intelligent robots (Colonel Ki).", "label": ["Permission Acquisition", "Important"], "rewrite": "You can use a microphone for voice input to interact with smart robots."}
{"task": "rw_7.jsonl", "id": 38804, "text": "In these features, we may collect your recording content to identify your needs and think you provide the corresponding services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your recording content to identify your needs, thinking that you provide corresponding services."}
{"task": "rw_7.jsonl", "id": 38805, "text": "2. The above permissions will not be opened by default. Only by your explicit authorization, open the corresponding permissions to us in your device (please see the \"APP permissions instructions\")You can also withdraw authorization at any time.", "label": ["Edit/Control", "Important"], "rewrite": "Only after your explicit authorization, you can use the corresponding permissions in your device to use and collect the information involved in the function or collect the information when you realize specific functions or services. You can also withdraw authorization at any time."}
{"task": "rw_7.jsonl", "id": 38806, "text": "2. It should be explained that even after your authorization, we have obtained these permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will not collect your information when related functions or services are not needed."}
{"task": "rw_7.jsonl", "id": 38807, "text": "(3) According to the current laws and regulations and national standards, in the following situations, we may collect or use your personal information in accordance with the law without obtaining your consent:", "label": ["Important", "First Party Collection Information"], "rewrite": "According to the current laws and regulations and national standards, in the following circumstances, we may collect or use your personal information in accordance with the law without obtaining your consent:"}
{"task": "rw_7.jsonl", "id": 38808, "text": "1., related to national security and national defense security;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38809, "text": "2., related to public safety, public health, major public interests", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection and use information related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38810, "text": "3. It is related to crime investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection and use information related to criminal investigation, prosecution, trial and judgment implementation does not need to solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38811, "text": "4. For major legitimate rights and interests such as the main body of personal information or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection of information is due to major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, but it is difficult to obtain my consent, and there is no need to solicit authorization."}
{"task": "rw_7.jsonl", "id": 38812, "text": "5. The collected personal information is made to the public by the public;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collected personal information is made public to the public by the public, and there is no need to solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38813, "text": "6. Your personal information collected from the information disclosed by legal publicity, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information"], "rewrite": "Your personal information collected from the legal disclosure information does not need to solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38814, "text": "7., sign and perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for signing and fulfilling the contract according to your requirements does not need to solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38815, "text": "8. The safe and stable operation of the products and/or services provided by maintenance, such as discovering, disposing of products and/./Or service failures, cracking down on black and gray products, investigating or disposing of illegal transactions;", "label": ["Important", "First Party Collection Information"], "rewrite": "The collection and use information necessary for the safe and stable operation of the products provided with/or service provided is not required to solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38816, "text": "9. Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_7.jsonl", "id": 38817, "text": "(4) Other information", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38818, "text": "If you choose to use other services we provide, based on the service we need to collect your information, we will explain to you the scope and purpose of information collection and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose to use other services we provide, we will explain and obtain your consent based on the needs of the service collection information."}
{"task": "rw_7.jsonl", "id": 38819, "text": "We will use this policy and the corresponding user agreement to use, store, provide, and protect your information;", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38820, "text": "If you choose not to provide the aforementioned information, you may not be able to use a certain or part of the service, but it does not affect the other services you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38821, "text": "• APP permissions acquisition instructions", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38822, "text": "1. In order to ensure that you can use the service functions we provide normally, we will apply for your following equipment permissions to the system. Before applying, we will consult your consent. You can choose \"allow\" or \"prohibit\" permissions application.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for your device permissions to the system, and you can choose \"allowed\" or \"prohibited\" permissions to apply."}
{"task": "rw_7.jsonl", "id": 38823, "text": "After your authorization, we will turn on the relevant authority. You can cancel the authorization at any time in the system. In different devices, the authority display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "After your authorization, we will turn on the relevant authority, and you can cancel the authorization at any time in the system."}
{"task": "rw_7.jsonl", "id": 38824, "text": "2. Please note that when you turn on these permissions, it means that you authorize us to collect and use these personal information to achieve specific functions. If you turn off the authority, it means that you cancel these authorizations, and we will no longer continue to collect and use your use of youThese personal information cannot provide you with the above functions corresponding to these authorization.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_7.jsonl", "id": 38825, "text": "The decision to close permissions will not affect the processing of personal information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to close permissions will not affect the processing of personal information based on your authorization."}
{"task": "rw_7.jsonl", "id": 38826, "text": "3. The acquisition of various business functions on system privacy permissions is as follows:", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38827, "text": "Storage: When you install the app, the app will apply for you to obtain this permissions, the purpose is to save the picture, file or cache information to your device.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "The APP will apply for you to obtain the storage permissions in order to save pictures, files or cache information to your device."}
{"task": "rw_7.jsonl", "id": 38828, "text": "Equipment information: When you install the app, the APP will apply for you to obtain this permissions. The purpose is for security risk control, and you need to read your device information. If you choose not to open this permissions, you can use other services provided by the APP., But may not be able to complete security risk verification.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "The APP will apply for you to obtain equipment information rights, with the purpose of safety risk control, and you need to read your device information."}
{"task": "rw_7.jsonl", "id": 38829, "text": "Telephone status: When you install the APP, the app will apply for you to obtain this permissions. The purpose is for security risk control. You need to read your equipment recognition information, equipment status information, and equipment environmental information. If you choose not to open this authority, you will not open this authorityYou can use other services provided by the APP, but you may not be able to complete security risk verification.", "label": ["Permission Acquisition", "Important", "Data Security"], "rewrite": "The APP will apply for you to obtain phone status permissions. The purpose is for security risk control, and you need to read your device recognition information, equipment status information, and equipment environmental information."}
{"task": "rw_7.jsonl", "id": 38830, "text": "Location: Search restaurant, service recommendation, sign -in, and interactive activities based on the location of the location. If you choose not to open this permissions, you will not receive the recommendation service based on the location of the location, nor can it participate in activities based on the location of the location.But it does not affect other services provided by your app.", "label": ["Permission Acquisition", "Edit/Control", "Usage", "Important"], "rewrite": "Get location permissions in order to search for restaurants and provide service recommendations, sign -in, and interactive activities based on location location."}
{"task": "rw_7.jsonl", "id": 38831, "text": "Camera and album: Scan, scan the code, and order meal. If you do not open the corresponding permissions, you will not use this specific function, but it does not affect other services provided by your app.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Open the camera and album permissions to use the scanning and code ordering function."}
{"task": "rw_7.jsonl", "id": 38832, "text": "Microphone: Voice input and voice interaction with smart robots (Colonel Ki). If you do not turn on the corresponding permissions, you will not use this specific function, but it will not affect other services provided by your app.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "Get the microphone permission for voice input and voice interaction with intelligent robots."}
{"task": "rw_7.jsonl", "id": 38833, "text": "Note: Due to some equipment manufacturers settings and some Android version restrictions, the system defaults to allocate apps to read user application list permissions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38834, "text": "But it needs to be specifically explained that we did not collect or use the information.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38835, "text": "You can close the authorization on your device selection.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the authorization on your device selection."}
{"task": "rw_7.jsonl", "id": 38836, "text": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38837, "text": "• Third -party SDK description", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38838, "text": "In order to ensure the implementation of related functions and the secure and stable operation of the application, we may access the software development package (SDK) provided by a third party to implement the relevant functions or services, and share the information necessary for the implementation of the function or service with the third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access the software development package provided by a third party to implement related functions or services, and share the information necessary for the implementation of the function or service with the third party."}
{"task": "rw_7.jsonl", "id": 38839, "text": "We will strictly monitor the SDK obtained by the partner to protect information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly monitor the SDK obtained by the partner to protect information security."}
{"task": "rw_7.jsonl", "id": 38840, "text": "Please click on the link below to learn about the related third -party SDKs we access:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Please click on the link below to learn about the related third -party SDKs we access."}
{"task": "rw_7.jsonl", "id": 38841, "text": "App access to third -party SDK directory", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "App access to third -party SDK directory"}
{"task": "rw_7.jsonl", "id": 38842, "text": "• How do we use cookie and other technologies", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38843, "text": "1. In order to make you more relaxed access experience, when you visit the services provided by our online platform, we may identify your identity through small data files. This can help you save the steps to repeat the registration information, or help help you help you enter the registration information, or help help you help you enter the registration information, or help help you help you, or help you help you, or help you help you, or help you help you, or help you help you, or help you help you, or help you help you, or help you help you, or help you help you, or help you help you, or help you help you, or help you help you.Determine your account security status.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38844, "text": "These data files may be Cookie, Flash Cookie, other local storage provided by your browser or associated application (hereinafter referred to as \"Cookie\").", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38845, "text": "Please understand that some of our services can only be realized by using cookies.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38846, "text": "We will not use Cookies for any purpose except the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38847, "text": "If your browser or browser additional service allows, you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can modify the degree of acceptance of cookies or reject our cookies."}
{"task": "rw_7.jsonl", "id": 38848, "text": "1. The \"help\" part in most browser toolbars will tell you how to prevent your browser from accepting new cookies, or completely close cookies.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38849, "text": "In addition, you can turn off or delete similar data used by the browser additional program, or to close or delete the browser additional program.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off or delete the cookie used by the browser additional program, or to delete the Cookie used by the browser additional program through the webpage of the provider."}
{"task": "rw_7.jsonl", "id": 38850, "text": "2., our platform may also include some electronic images (hereinafter referred to as \"Network Beacon\"). Using the Internet Beacon can help the website to calculate the webpage users or access some cookies.For example: the page address you visited, the location of the pages you previously visited, your browsing environment, and display settings.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your information about your browsing web activities through the Internet Beacon."}
{"task": "rw_7.jsonl", "id": 38851, "text": "• How do we use your personal information", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38852, "text": "1., we will use the personal information collected for our products and/or service functions in accordance with the agreement of this privacy policy, so that you can provide you with more accurate, personality, smooth and convenient services, or help us evaluate the evaluation, Improve or design services and operation activities;", "label": ["Important", "Usage"], "rewrite": "We will use the personal information collected for our products and/or service functions in accordance with the agreement of this privacy policy."}
{"task": "rw_7.jsonl", "id": 38853, "text": "2., 2. In order to improve your service experience, it is recommended for you with better or suitable services for you. We may form feature labels based on your information to provide you with marketing activities notifications and business nature that you may be interested inElectronic information or advertisements, if you don't want to receive such information, you can choose to unsubscribe according to the method we prompts.", "label": ["Important", "Usage"], "rewrite": "We may form a feature label based on your information and use it to personalized content to you. If you do not want to receive such information, you can choose to unsubsess the book according to the prompt method."}
{"task": "rw_7.jsonl", "id": 38854, "text": "3. After collecting your personal information, we will use technical means to use desensitization and derived processing of data to process your information.", "label": ["Important", "Data Security"], "rewrite": "After collecting your personal information, we will use technical means to use desensitization and dehumidification processing of data to process your information."}
{"task": "rw_7.jsonl", "id": 38855, "text": "3. Please understand and agree. In this case, we can use the information that has been identified;", "label": ["Important", "Data Security"], "rewrite": "We can use information that has been identified."}
{"task": "rw_7.jsonl", "id": 38856, "text": "Under the premise that your personal information is not disclosed, the user database is analyzed and used to use it.", "label": ["Important", "Usage"], "rewrite": "Under the premise that your personal information is not disclosed, the user database is analyzed and commercialized."}
{"task": "rw_7.jsonl", "id": 38857, "text": "4. We will count our products and/or service usage, and we may share these statistics with third parties to show the overall use trend of our products and/or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will statistics on our products and/or service usage and may share these statistics with third parties."}
{"task": "rw_7.jsonl", "id": 38858, "text": "But these statistical information does not include any identity information.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38859, "text": "5. When we show your personal information, we will use content replacement and anonymous processing to desensitify your information to protect your information security.", "label": ["Important", "Data Security"], "rewrite": "We will use content replacement and anonymous processing methods to desensitize your information before displaying."}
{"task": "rw_7.jsonl", "id": 38860, "text": "6. Please note that all personal information you provided when using our products and/or services, unless you delete or reject us through the system settings, you will continue to authorizeWe use.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "All personal information you provided when using products and/or services will continue to authorize us to use it during your use, unless you delete or reject us to collect through system settings."}
{"task": "rw_7.jsonl", "id": 38861, "text": "When you cancel your account, we will stop using your personal information and delete or processes your personal information.", "label": ["Important", "Data Security"], "rewrite": "When you cancel your account, we will stop using your personal information and delete or do it anonymously."}
{"task": "rw_7.jsonl", "id": 38862, "text": "7. When we want to use your personal information for other purposes that are not stated in this policy, or for information collected based on specific purposes, we will confirmAgreement, document confirmation action in specific scenarios, etc., obtain your consent.", "label": ["Policy Change", "Important"], "rewrite": "When we use your personal information for other purposes that are not stated in this policy, or information collected based on specific purposes, we will obtain your consent."}
{"task": "rw_7.jsonl", "id": 38863, "text": "• How do we store your personal information?", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38864, "text": "1. The main purpose of our personal information is to meet the purpose of collecting, useing, and sharing of personal information listed in privacy policies, and also for the realization of your control and the realization of the right to know.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38865, "text": "2. If our applicable law clearly stipulates the deadline for our personal information, we will comply with these regulations.", "label": ["Data Retention", "Important"], "rewrite": "If the law clearly stipulates the deadline for our personal information, we will comply with these regulations."}
{"task": "rw_7.jsonl", "id": 38866, "text": "If the law does not clearly stipulate, we will save your personal information until: (1) the purpose of collecting, using, and sharing your personal information;", "label": ["Data Retention", "Important"], "rewrite": "If the law does not clearly stipulate, keep your personal information within the time limit required for service purposes."}
{"task": "rw_7.jsonl", "id": 38867, "text": "(2) You terminate our products or services;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38868, "text": "(3) You clearly ask us to delete your personal information.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38869, "text": "After the preservation of personal information expires, we will adopt deletion, anonymous processing or other methods stipulated in the law.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous."}
{"task": "rw_7.jsonl", "id": 38870, "text": "3. We only store your personal information in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "We only store your personal information in the territory of the People's Republic of China."}
{"task": "rw_7.jsonl", "id": 38871, "text": "Under some special cases (such as disaster recovery backup and improving user connection experience), we may store your personal information outside the aforementioned area under the premise of obeying the law.", "label": ["Data Retention", "Important"], "rewrite": "In some special cases, under the premise of obeying the laws used, we may store your personal information outside the aforementioned area."}
{"task": "rw_7.jsonl", "id": 38872, "text": "When we ensure that when your personal information is transmitted to other areas, these personal information is still controlled by Yum: and local laws will not reduce your personal information protection. We will also take all necessary measures to ensure that such personal information will be guaranteedSafety.", "label": ["Data Retention", "Important"], "rewrite": "When transmitting your personal information to other areas, these personal information is still controlled by Yum!"}
{"task": "rw_7.jsonl", "id": 38873, "text": "If there are clear requirements based on applicable laws, we will take regular security assessments on cross -border transmission of personal information and decide whether to continue to transmit your personal information according to the evaluation results.", "label": ["Important", "Data Security"], "rewrite": "If the law has clear requirements, we will adopt regular security assessment of cross -border transmission of personal information and decide whether to continue cross -border transmission based on the evaluation results."}
{"task": "rw_7.jsonl", "id": 38874, "text": "• How do we protect your personal information?", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38875, "text": "1. To ensure your information security, after collecting your information, we will take various reasonable and necessary measures to protect your information.", "label": ["Important", "Data Security"], "rewrite": "After collecting your information, we will take various reasonable and necessary measures to protect your information."}
{"task": "rw_7.jsonl", "id": 38876, "text": "2. We are committed to using various security technologies and supporting management systems to minimize the risk of leak, damage, misuse, non -authorized visits, non -authorized disclosure and changes.", "label": ["Important", "Data Security"], "rewrite": "We are committed to using various security technologies and supporting management systems to protect your personal information."}
{"task": "rw_7.jsonl", "id": 38877, "text": "For example: encrypted transmission, information encryption storage, strict restrictions on data centers through network security layer software (SSL).", "label": ["Data Security"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38878, "text": "When transmitting and storing personal sensitive information (including personal biometric information), we will adopt security measures such as encryption, permissions control, and de -identification.", "label": ["Important", "Data Security"], "rewrite": "When transmitting and storing personal sensitive information, we will adopt security measures such as encryption, permissions control, and de -identification."}
{"task": "rw_7.jsonl", "id": 38879, "text": "3. We have set up information security responsibility departments to conduct compliant management of personal information collection, use, sharing, and processing.", "label": ["Important", "Data Security"], "rewrite": "We have set up compliant management of information security responsibility departments to manage compliance with personal information collection, use, sharing, and processing."}
{"task": "rw_7.jsonl", "id": 38880, "text": "At the same time, we have adopted appropriate technical measures and organizational settings, including encryption, grading and authority management to protect your personal information security;", "label": ["Important", "Data Security"], "rewrite": "We have adopted technical measures and organizational settings, including encryption, classification and authority management to protect your personal information security."}
{"task": "rw_7.jsonl", "id": 38881, "text": "And regularly carry out training and audit to ensure that there are special and qualified positions and personnel to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "We regularly carry out training and audit to ensure that there are special and qualified positions and personnel to protect your personal information."}
{"task": "rw_7.jsonl", "id": 38882, "text": "4. We formulated an emergency plan for information security incidents, and regularly organized internal personnel to conduct emergency response training and emergency drills to master their job responsibilities and emergency disposal strategies and procedures.", "label": ["Important", "Data Security"], "rewrite": "We have developed an emergency plan for information security incidents to regularly organize emergency response training and emergency drills."}
{"task": "rw_7.jsonl", "id": 38883, "text": "Once a personal information security incident that may seriously affect your personal information security, we will comply with the provisions of laws and regulations and the requirements of government supervision, and inform you in a timely manner: the basic situation and possible impact of security incidents, we have adopted or we will adopt or we will adopt or we will adopt itThe disposal measures, your advice that can prevent and reduce risk, and remedy your remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_7.jsonl", "id": 38884, "text": "We will inform you that the incident -related situation is promoted by the APP notification, sending email/short message, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_7.jsonl", "id": 38885, "text": "In accordance with the requirements of the regulatory authorities, we will take the initiative to report to the disposal of personal information security incidents under the premise of complying with laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "Report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_7.jsonl", "id": 38886, "text": "5. Please keep your account login and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "Protect your personal information properly."}
{"task": "rw_7.jsonl", "id": 38887, "text": "When you use our network platform service, we will identify your identity through your login name and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "When you use the network platform service, we will identify your identity through your login name and other identity elements."}
{"task": "rw_7.jsonl", "id": 38888, "text": "Once you leak the aforementioned information, you may suffer and have legal consequences that are unfavorable to you.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38889, "text": "If you find that the login name and/or other identity factors may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If your personal information is leaked, please contact our customer service immediately."}
{"task": "rw_7.jsonl", "id": 38890, "text": "6. After you terminate our services, we will stop the collection and use of your information, except for laws and regulations or regulators.", "label": ["Important", "Data Security"], "rewrite": "After you terminate our services, we will stop collecting and using your information, except for laws and regulations or regulators."}
{"task": "rw_7.jsonl", "id": 38891, "text": "If we stop service or operation, we will notify you at least 30 days in advance, and delete or processes your personal information after termination of services or operations.", "label": ["Important", "Data Security"], "rewrite": "When stopping operations, we will notify it in advance and delete or processes your personal information."}
{"task": "rw_7.jsonl", "id": 38892, "text": "7. Important reminder", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38893, "text": "As all companies may face problems, considering the characteristics of information technology and network space itself, in some special circumstances (such as hackers, telecommunications faults, etc.), although we have adopted the necessary requirements of laws, regulations, etc.Measures, but still have the risk of personal information leakage.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_7.jsonl", "id": 38894, "text": "Unless there are other regulations in this privacy policy, in order to protect your personal or property safety, we specifically remind you that you should not provide your property status, health and physiology, health, physiology, health, physiology, and in our name through the public network.Account password or verification code, communication content, etc. involve sensitive information of your personal or property security.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you do not provide sensitive information involving your personal or property security through public networks."}
{"task": "rw_7.jsonl", "id": 38895, "text": "• How do we provide information outside", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38896, "text": "1. Business sharing", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38897, "text": "(1), when you are using our affiliated companies and franchisees, as well as cooperative payment institutions, suppliers, and other partners (such as advertising agency, information services, logistics services, customer service services, system service providers, or our our suppliers, or usWhen a dealer, etc.), when a third party provides you, we will share the information necessary for the business to share with these related parties and third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the service provided by the third party of our partner, we will share the information necessary for the business to share with it."}
{"task": "rw_7.jsonl", "id": 38898, "text": "If you need to share your information to the third party in order to provide you, we will evaluate the legality, legitimacy, and necessity of the third -party collection information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will evaluate the legality, legitimacy, and necessity of third -party collection information."}
{"task": "rw_7.jsonl", "id": 38899, "text": "We will require third parties to take protection measures for your information and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will require third parties to take protection measures for your information and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_7.jsonl", "id": 38900, "text": "(2) If you choose to participate in the lottery and similar promotion activities jointly carried out by us and third -party, we may have the information arising from the event and the necessary information generated by the event in orderIf you provide services, we will clearly inform you what information you need to provide to the third party will be clearly informed on the rules page of the activity page or through other channels, and your consent will be obtained;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose to participate in the marketing activities we jointly carried out, we may have the information necessary for completing the activity during the sharing of the event."}
{"task": "rw_7.jsonl", "id": 38901, "text": "(3) In the case of obtaining your clear consent in advance, we will share your information with third parties within the scope of your authorization without violation of the scope of public order and good customs.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of getting your clear consent in advance, we will share your information with third parties based on your authorization scope."}
{"task": "rw_7.jsonl", "id": 38902, "text": "2. Transfer information", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38903, "text": "In principle, we will not transfer your personal information to any company, organization and individual outside Yuman China, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information to any company, organization and individual outside Yuman China, except the following situations: except:"}
{"task": "rw_7.jsonl", "id": 38904, "text": "(1), get your clear consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent in advance, we may transfer your personal information."}
{"task": "rw_7.jsonl", "id": 38905, "text": "(2), administrative or judicial requirements in accordance with laws and regulations or mandatory administrative or judicial requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to laws and regulations or mandatory administrative or judicial requirements, we may transfer your personal information."}
{"task": "rw_7.jsonl", "id": 38906, "text": "(3) When involving asset transfer, acquisition, mergers, reorganization or bankruptcy liquidation, if personal information transfer, we will tell you the relevant situation and require new companies and organizations that hold your personal information to continue to be subject to this book.Policy constraints.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if personal information transfer is involved, it will be required to continue to be bound by the policy, otherwise it will request that it will re -solicit authorization consent."}
{"task": "rw_7.jsonl", "id": 38907, "text": "If the purpose of changing personal information, we will ask the company and organization to obtain your clear consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38908, "text": "3. Public disclosure", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38909, "text": "(1) Except for the release of the winning event list, the desertens or login name will be displayed, in principle, we will not disclose your information publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for the release of the winning event list, the desertensive display of the winner's mobile phone number or login name, in principle, we will not disclose your information publicly."}
{"task": "rw_7.jsonl", "id": 38910, "text": "If you really need to disclose it publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information that may be involved, and obtain your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It really needs to disclose your information publicly. We will inform you that the purpose of the public disclosure, the type of disclosure information, and the sensitive information that may be involved, and obtain your clear consent."}
{"task": "rw_7.jsonl", "id": 38911, "text": "(2) Disclosure based on legal disclosure: In the case of compulsory requirements of legal, legal procedures, litigation or government authorities, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may disclose your personal information publicly."}
{"task": "rw_7.jsonl", "id": 38912, "text": "4. Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38913, "text": "In order to improve the efficiency of information processing, reduce information processing costs, or improve the accuracy of information processing, we may entrust our affiliated companies or other professional institutions to handle information.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38914, "text": "We will require the trustee to obey the strict confidentiality obligations and take effective confidentiality measures through written agreements and other methods to prohibit it from using this information to the purpose of not being authorized.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will require the trustee to obey the strict confidentiality obligations and take effective confidentiality measures through written agreements and other methods to prohibit it from using this information to the purpose of not being authorized."}
{"task": "rw_7.jsonl", "id": 38915, "text": "• How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38916, "text": "We attach great importance to your attention to personal information and do our best to protect your rights to your personal information access, correction, delete, and withdrawal, so that you have full ability to ensure your privacy and security.", "label": ["Edit/Control", "Important"], "rewrite": "We will do our best to protect your rights to your personal information access, correction, delete, and withdrawal."}
{"task": "rw_7.jsonl", "id": 38917, "text": "Your rights include:", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38918, "text": "1. Visit and correct your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38919, "text": "You have the right to access and correct your personal information, including your nickname, avatar, birthday, gender, mailbox, delivery address, etc., except for the exception stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to access and correct your personal information."}
{"task": "rw_7.jsonl", "id": 38920, "text": "You can access and correct it by yourself by logging in to our network platform account. You can also contact customer service at any time through the \"Foreword\" publication contact information. We will reply to your access and correct requests within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "You can access and correct it by yourself by logging in to the network platform account, or contact customer service to correct the customer service through the \"preface\" contact information at any time."}
{"task": "rw_7.jsonl", "id": 38921, "text": "You cannot access and correct personal information: Except for the information listed above, some of your personal information can not provide you with access and correction services. This information is mainly to improve your user experience and ensure the collection of transaction security collected.Your device information, personal information generated when you use additional functions.", "label": ["Edit/Control", "Important"], "rewrite": "In order to improve your user experience and ensure your equipment information collected by transaction security, and personal information generated when you use additional functions, you may not be able to access and correct."}
{"task": "rw_7.jsonl", "id": 38922, "text": "We will use the above information within your authorization range. You cannot access and correct, but you can contact us to delete or do anonymous processing.", "label": ["Important", "Edit/Control"], "rewrite": "You cannot access and correct information to contact us to delete or do anonymous processing."}
{"task": "rw_7.jsonl", "id": 38923, "text": "2. Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38924, "text": "You can directly access the setting function of the network platform to delete your information, including your nickname, avatar, birthday, gender, mailbox, receiving address, etc.;", "label": ["Edit/Control", "Important"], "rewrite": "You can directly access the setting function of the network platform and delete your information."}
{"task": "rw_7.jsonl", "id": 38925, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) If our behavior of handling personal information violates laws and regulations; (2) If we collect and use your personal information, it has not obtained your consent.; (3) If our behavior of handling personal information violates your agreement; (4) If we terminate our services and operations."}
{"task": "rw_7.jsonl", "id": 38926, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38927, "text": "(2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38928, "text": "(3) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38929, "text": "(4) If we terminate our services and operations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38930, "text": "3. Change the scope of your authorization consent or withdraw your authorization", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38931, "text": "You can change your authorization of the scope of personal information or withdrawing your authorization by deleting information, closing the device function, and privacy settings on our network platform, etc.", "label": ["Important", "Edit/Control"], "rewrite": "You can change authorization or withdrawing authorization by deleting information, closing the device function, and privacy settings on the network platform."}
{"task": "rw_7.jsonl", "id": 38932, "text": "You can also withdraw all the authorization of our personal information by canceling the account of the account.", "label": ["Edit/Control", "Important"], "rewrite": "You can withdraw all the authorization of our personal information by canceling the account of the account."}
{"task": "rw_7.jsonl", "id": 38933, "text": "Please understand that each business function requires some basic personal information to be completed. When you withdraw consent or authorization, we cannot continue to provide you with the service corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal informationEssence", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw or authorize, we cannot continue to provide you with the corresponding services corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal information."}
{"task": "rw_7.jsonl", "id": 38934, "text": "But your decision to withdraw consent or authorization will not affect personal information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision you withdraws or authorized will not affect personal information processing that was previously authorized."}
{"task": "rw_7.jsonl", "id": 38935, "text": "4. Logging out account", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38936, "text": "You can call our customer service phone to apply for a cancellation account. When you meet the agreed account cancellation conditions (see the terms of account cancellation in the \"Member Service Agreement\" for details), we will complete your account within 48 hours you apply for your account.Log canceling the audit. After the review is approved, we will delete or processes your personal information.", "label": ["Edit/Control", "Data Security", "Important"], "rewrite": "You can contact the customer service to apply for a cancellation account. After the application for the application is approved, we will delete or processes your personal information."}
{"task": "rw_7.jsonl", "id": 38937, "text": "We will not collect, use, or provide personal information related to the account, but the information you provide or generated during our service period still need to be processed in accordance with the legal regulations and the time of government supervision requirements, and at this time, this should beDuring this period", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "After the account is canceled, we will not collect, use or provide personal information related to the account."}
{"task": "rw_7.jsonl", "id": 38938, "text": "5. If you don't want to accept the promotional information we send to you, you can cancel through the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to accept the promotional information we send you, you can cancel it at any time:"}
{"task": "rw_7.jsonl", "id": 38939, "text": "(1) You can reply to \"TD\" at any time to cancel the mobile phone promotion text message we sent to you.", "label": ["Edit/Control", "Important"], "rewrite": "(1) You can reply to \"TD\" at any time to cancel the mobile phone promotion text message we sent to you."}
{"task": "rw_7.jsonl", "id": 38940, "text": "(2) You can set whether to accept the products and promotional information to your products and promotional information through the mobile APP \"account settings-setting-push message settings-notification\" settings.", "label": ["Important", "Edit/Control"], "rewrite": "(2) You can set whether to accept the products and promotional information to your products and promotional information through the mobile APP \"account settings-setting-push message settings-notification\" settings."}
{"task": "rw_7.jsonl", "id": 38941, "text": "6. When you use a third -party product or service, you may permit or authorize the third direction. We transfer your personal information: for example, when you use social media, third -party online shops, or participating in third -party activities, you mayIn the third direction of licenses, we provide but not limited to other personal information (including but not limited to user IDs, nicknames, personal preferences, transaction records, and even tweets released).", "label": ["Edit/Control", "Important"], "rewrite": "When you use third -party products or services, you may permit or authorize our personal information in the third direction."}
{"task": "rw_7.jsonl", "id": 38942, "text": "These third -party networks may have their own privacy policies to explain how they use and share your personal information.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38943, "text": "Before using these third -party networks, you should read its privacy policies carefully to ensure that you agree and share your personal information.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38944, "text": "7. respond to your request", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38945, "text": "(1) If you cannot access, correct or delete your personal information through the above way, or you need to access, correct or delete other personal information generated when using our products and/or servicesIn violation of laws and regulations or the collection or use of your personal information, you can contact us through the contact information of this agreement.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38946, "text": "To ensure safety, we may need to provide a written request or prove your identity in other ways. We will reply to your request within 15 working days after receiving your feedback and verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38947, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_7.jsonl", "id": 38948, "text": "(2) In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, in accordance with the requirements of laws and regulations, we will not be able to respond to your request:"}
{"task": "rw_7.jsonl", "id": 38949, "text": "a., related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_7.jsonl", "id": 38950, "text": "b., related to public safety, public health, major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_7.jsonl", "id": 38951, "text": "c., related to criminal investigation, prosecution, and trial;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is related to criminal investigation, prosecution, and trial, and may not be responded."}
{"task": "rw_7.jsonl", "id": 38952, "text": "d. There are sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, you may not be able to respond to the request."}
{"task": "rw_7.jsonl", "id": 38953, "text": "e., responding to your request will cause serious damage to the legitimate rights and interests of you or other individuals and organizations.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to the request that the legitimate rights and interests of personal information subjects or other individuals and organizations are seriously damaged."}
{"task": "rw_7.jsonl", "id": 38954, "text": "(3), we will handle your requests in accordance with this privacy policy and laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "We will handle your requests in accordance with this privacy policy and laws and regulations."}
{"task": "rw_7.jsonl", "id": 38955, "text": "After communicating with us, if you are not satisfied with our response, you can filed a lawsuit to courts with jurisdiction based on applicable laws.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38956, "text": "• How do we protect the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38957, "text": "1. We expect parents or guardians to guide minors to use our services.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38958, "text": "We will protect the confidentiality and security of the information of minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38959, "text": "2. If you are a minor under the age of 18, it is recommended that your parents or guardian read this policy and use our service or provide us information to us under the consent of your parents or guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, use our service or provide us information to us under the premise of obtaining the consent of the guardian."}
{"task": "rw_7.jsonl", "id": 38960, "text": "For the situation of collecting your information with the consent of the parent or guardian, we will only use or disclose this information if they are allowed to be allowed, parents or guardians to clearly consent or protect your rights and interests.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only use or disclose the information of minors when they are allowed to be allowed, parents or guardians to clearly agree or protect your rights."}
{"task": "rw_7.jsonl", "id": 38961, "text": "If your guardian does not agree that you use our services or provide information to us in accordance with this policy, please immediately terminate our services and inform us in time so that we can take corresponding measures.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree to process information in accordance with this policy, please immediately terminate our services and inform us in time."}
{"task": "rw_7.jsonl", "id": 38962, "text": "3. If you are a parent or a guardian of the minor, when you have questions about the information processing of the minors you monitor, please contact us through the contact information above to take corresponding measures in real time.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38963, "text": "• Application and update of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38964, "text": "1. All services of Yum! China Network Platform applies this policy, unless there is an independent privacy policy or corresponding user service agreement with the relevant services.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38965, "text": "2. We will update the privacy policy according to law, and will also mark the recent update date at the beginning of the article.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38966, "text": "Due to the more users, if the main content of this policy is updated, we will notify you with the APP push notification, pop -up notification, short message, or publishing announcement on the official website.", "label": ["Policy Change", "Important"], "rewrite": "If the main content of this policy is updated, we will notify you by app notifications, pop -up notifications, short messages, or announcement on the official website."}
{"task": "rw_7.jsonl", "id": 38967, "text": "If you continue to use our services after the policy update is effective, it means that you have fully read, understand and accept the updated policy and are willing to be constrained by the updated policy.", "label": ["Policy Change", "Important"], "rewrite": "If you continue to use our services after the policy update is effective, it means that you accept the updated policy and be willing to be constrained by the updated policy."}
{"task": "rw_7.jsonl", "id": 38968, "text": "3. You can check this policy on the homepage of Yumsheng China, or check this policy through the \"My → Help\".", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38969, "text": "We encourage you to check our privacy policy every time you use our services.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38970, "text": "• How do you contact us", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38971, "text": "If you have any questions, opinions, or suggestions for how you do your personal information, or to deal with your personal information, please contact us or app online customer service as follows:", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38972, "text": "KFC customer service hotline: 4009200715", "label": ["Important", "Contact Information"], "rewrite": "KFC customer service hotline: 4009200715"}
{"task": "rw_7.jsonl", "id": 38973, "text": "Pizza High Customer Hotline: 4009701890", "label": ["Important", "Contact Information"], "rewrite": "Pizza High Customer Hotline: 4009701890"}
{"task": "rw_7.jsonl", "id": 38974, "text": "Contact address: No. 20, Tianxiangqiao Road, Shanghai, Yum!", "label": ["Important", "Contact Information"], "rewrite": "Contact address: No. 20, Tianxiangqiao Road, Shanghai, Yum!"}
{"task": "rw_7.jsonl", "id": 38975, "text": "Under normal circumstances, we will reply within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38976, "text": "If you are not satisfied with our reply, or if you cannot negotiate with the understanding of the understanding and performance of this privacy policy, you can file a lawsuit with the courts with jurisdictions.", "label": [], "rewrite": []}
{"task": "rw_7.jsonl", "id": 38977, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
