{"task": "rw_71.jsonl", "id": 61715, "text": "NetEase Game Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61716, "text": "Updated in this version: November 01, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61717, "text": "[Foreword] Netease Games (hereinafter referred to as \"We\") has always promised to protect the personal information and privacy of users (hereinafter collectively referred to as \"user\" or \"you\") users who use NetEase games (hereinafter collectively referred to as \"user\" or \"you\").", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61718, "text": "When you use Netease game services, we will collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61719, "text": "We hope to explain to you through the \"NetEase Game Privacy Policy\" (hereinafter referred to as \"this policy\") to explain related matters such as collecting and using your relevant personal information to better protect your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61720, "text": "【Special Note】", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61721, "text": "1. This policy is applicable to the NetEase game service we provided.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61722, "text": "This policy has also played for you at the same time as \"NetEase Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61723, "text": "If the terms of this policy are inconsistent with the \"NetEase Privacy Policy\" clauses, the terms of this policy are preferred. If it is not mentioned in the terms of this policy, it shall be subject to the \"NetEase Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61724, "text": "Users under the age of 14, at the same time, apply \"NetEase Privacy Policy\", \"NetEase Children's Personal Information Protection Rules and Guardian Notes\", this policy, and \"NetEase Game Children's Personal Information Protection Rules and Guardian Notes\" (see attachment).", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61725, "text": "2. This policy stipulates the way we handle your information in different scenarios, but only when you start related functions or use related services, we will process your information to achieve related functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Only when you start related functions or use related services, we will process your information to achieve related functions and services."}
{"task": "rw_71.jsonl", "id": 61726, "text": "If you do not turn on related functions or use related services, we will not handle your corresponding personal information.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61727, "text": "In addition to this policy, in specific products, we will also explain to you through pop -ups and page prompts to explain the purpose, scope, and usage method of specific information collection.And have the same effect as this policy, please pay special attention.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61728, "text": "3. Before using the services provided by NetEase games, please be sure to read and thoroughly understand this policy, especially the terms of the line identification under the thick body/thick body. You should focus on reading.Essence", "label": ["Policy Change", "Important"], "rewrite": "Please read carefully and understand this policy carefully, and start using it after confirming and agreeing."}
{"task": "rw_71.jsonl", "id": 61729, "text": "If you do not agree with the content of this policy, it may cause NetEase game services to be unable to run normally or to achieve the service effect we are going to achieve, you should immediately stop visiting/use Netease game services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the content of this policy, you should stop visiting/use Netease game services immediately."}
{"task": "rw_71.jsonl", "id": 61730, "text": "After reading this policy, if you have any problems with this policy or related matters related to this policy, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" chapters in this policy, and we will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61731, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61732, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61733, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61734, "text": "3. How can we share, transfer or disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61735, "text": "4. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61736, "text": "5. How to exercise your personal information related rights", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61737, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61738, "text": "Seven, revised and notice", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61739, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61740, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61741, "text": "(1) We will collect and obtain your personal information through the following channels:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61742, "text": "1. The information you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61743, "text": "(1) When you register the account of the NetEase game or use the information of the NetEase game, you provide the information to us;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61744, "text": "(2) The information you store when you use Netease games.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61745, "text": "Please note that if you disclose your information in the open area of other users in NetEase games, these information may be collected and used by others.", "label": ["Risk"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61746, "text": "When you find that others collect or use your information, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61747, "text": "2. Your information that is legally shared by a third party.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61748, "text": "3. The information that we legally obtained in the process of providing you in the process of providing you, such as the information we collect, summarize and record when using Netease games.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61749, "text": "(2) We will collect and use your personal information for the following goals:", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61750, "text": "1. Help you complete the registration and login", "label": ["Usage"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61751, "text": "In order to facilitate us to provide you with continuous and stable services and ensure the security of your use of NetEase games, we need to provide you, basic registration or login information, including mobile phone numbers, e -mail, and creating you, game accounts, user names and passwords.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "You provide basic registration or login information, and create game accounts, usernames and passwords in order to provide us with services and ensure game security."}
{"task": "rw_71.jsonl", "id": 61752, "text": "In accordance with relevant laws and regulations and regulatory requirements, after your registered game account, we need to provide you with real identity information, including name, valid identity documents (such as ID cards, passports, driving licenses, hukou books), and photos.", "label": ["Important", "First Party Collection Information"], "rewrite": "After your registered game account, collect the real identity information you provided, including name, valid identity documents, and photos."}
{"task": "rw_71.jsonl", "id": 61753, "text": "If you do not provide the above true identity information or provide false information, you will not be able to log in to NetEase Games, enjoy related services or be restricted during the use of NetEase games, we will not be able to provide you with game services or on your game behavior.Corresponding restrictions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide real identity information or provide false information, you will not be able to log in to the game or use it."}
{"task": "rw_71.jsonl", "id": 61754, "text": "In order to achieve the purpose of real -name authentication, you agree and authorize us to provide, inquire, and check your aforementioned identity information to relevant real -name authentication agencies (national online game authorities, public security departments or other agencies entrusted/cooperated).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to achieve the purpose of real -name certification, you agree and authorize us to provide, inquire, and check your identity information to relevant real -name authentication agencies."}
{"task": "rw_71.jsonl", "id": 61755, "text": "You can also use the account of the third -party platform recognized by Netease to log in to the NetEase Game. When you use the NetEase mailbox account, NetEase mobile phone account, or NetEase's account to log in to the NetEase game, we will obtain these accounts under your authorizationRelated information (including: username, nickname, avatar, unique logo, and other authorized information by you), is used to help you complete registration, log in and realize a better gaming entertainment experience.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you log in to the NetEase Game with an account on a third -party platform, we will get the relevant information under the account authorized by you to help you complete the registration, log in and realize the game experience."}
{"task": "rw_71.jsonl", "id": 61756, "text": "2. Provide basic functions of the game, maintain network and operation security", "label": ["Usage"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61757, "text": "In the process of using our online game service, you provide you with basic functions of the game, and identify the abnormal state of the account, understand and improve the product adaptability, and ensure the network and operation of the NetEase game service to maintain the normal operation of the aforementioned function.Protect your personal property of you or other users or the public, and better prevent the various security risks of fishing websites, fraud, network vulnerabilities, computer viruses, network attacks, and network invasion, and more accurately identify violations of laws and regulationsWe will collect and store services and use methods you use. Equipment information, log information, account information, trading information, and information on our related companies and partners to obtain information that you authorize or shared according to law, and make this information forRelated to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures according to law:", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect and store device information, log information, account information, trading information, transaction information, and our related companies and partners to obtain your authorization or sharing information shared in accordance with legal sharing, in order to make risk judgment, authentication, prevention preventionSafety events, and take necessary records, audits, analysis, and disposal measures in accordance with the law."}
{"task": "rw_71.jsonl", "id": 61758, "text": "(1) When you use our game service, we will collect your game log information: log in to logs, items logs, operating information, game -to -game information, game friends information and interactive records, login account, game ID, search query content, IP address, the type of browser, the telecommunications operator, the network environment, the language of use, the date and time of visit and time, and the push open record, stay time, refresh records, release records, follow, subscribing, collection, collectionAnd share.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the game service, collect your game log information."}
{"task": "rw_71.jsonl", "id": 61759, "text": "(2) In order to ensure your normal use of our game services, maintain the normal operation of the basic functions of the game, and improve the game experience and guarantee account security We will receive and record the equipment information you use: equipment name, equipment model, operating system and version version, Client version, device resolution, package name, device settings, equipment identifier (MAC/IMEI/Android, ID/IDFA/Openudid/Guid/SIM, card IMSI, information), software and hardware feature information, IP, address.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect and record the equipment information you use so that you can use services normally, maintain basic functions of the game, and ensure account security."}
{"task": "rw_71.jsonl", "id": 61760, "text": "In order to collect the above -mentioned basic personal equipment information, we will apply for the authority of access to your equipment information in the necessary scenario.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will apply for the authority of your device information in the necessary scenario to collect equipment information."}
{"task": "rw_71.jsonl", "id": 61761, "text": "In the case of your device configuration support, in some of the products of NetEase Games, in order to achieve the animation display effect of the scene screen in the game, we will collect your equipment gyroscope (angle speed sensor) information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your device gyroscope (angle speed sensor) information to achieve animation display effects."}
{"task": "rw_71.jsonl", "id": 61762, "text": "(3) In order to ensure account security, create a fair, healthy and safe game environment, we will collect your game recognition information, hardware and operating system information, installed application lists, process and game crash record information to combat damageThe fair environment or interference of the game or destroying the normal behavior of game services (for detecting piracy, scanning plug -in, and preventing cheating).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect your game recognition information, hardware and operating system information, installation application lists, process and game crash record information to ensure account security and fair game fairness."}
{"task": "rw_71.jsonl", "id": 61763, "text": "(4) In some of the products of NetEase Games, you can choose to use a photo pinching function to provide you with this function. I need you to provide and use photos containing your facial recognition features.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use photos you provide containing your facial recognition characteristics to provide you with a photo pinch function."}
{"task": "rw_71.jsonl", "id": 61764, "text": "You can also choose to refuse to provide photo information. If you refuse to provide photos, you will not be able to use this function, but refuses to not affect other functions of your use of NetEase games normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide photo information, you will not be able to pinch your face function, but refuse not affecting other functions for normal use."}
{"task": "rw_71.jsonl", "id": 61765, "text": "Without separate instructions and obtaining your consent, we will not retain or use your above photos for other purposes.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We will not leave or use your photos for other purposes without your consent."}
{"task": "rw_71.jsonl", "id": 61766, "text": "Please note that separate equipment information and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61767, "text": "If we use this type of information with other information to identify a specific natural person or use it with personal information, during the combination of use, this type of information will be regarded as personal information.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61768, "text": "We will anonymous and de -identifying this type of personal information, except that you authorize or laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "We will anonymity and logo processing of equipment information and log information, except that you have authorized or laws and regulations."}
{"task": "rw_71.jsonl", "id": 61769, "text": "During the use of this type of information, it will be handled and protected as your personal information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61770, "text": "3. Provide you with interaction and release service", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61771, "text": "When you use Netease game services, upload and/or publish information, and do related interactive behaviors (speaking, following stickers, sharing, collection, rewarding), we will collect information you upload, publish or form formed, and use your use of your, Nickname, avatar, game ID, virtual character image and publishing content for display.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information you uploaded, published or formed, and use your nickname, avatar, game ID, virtual character image and publishing content for display."}
{"task": "rw_71.jsonl", "id": 61772, "text": "Please note that if the information you posted publicly contains your personal information or personal sensitive information, as these information may be collected and used by others, please consider it carefully before the release.", "label": ["Important", "Edit/Control"], "rewrite": "Care carefully!Whether to publicly release personal information or personal sensitive information."}
{"task": "rw_71.jsonl", "id": 61773, "text": "If the information you posted involves the personal information of others, you should obtain the consent of others before the release.", "label": ["Important", "Edit/Control"], "rewrite": "If the information you posted involves the personal information of others, you should obtain the consent of others before the release."}
{"task": "rw_71.jsonl", "id": 61774, "text": "When you find that others collect or use your information, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61775, "text": "In some products of Netease Games, if you copy information sharing in the product or receive information shared in the product, and participate in related activities, we need to visit your shear board to read the sharing code, password, link, exchange, exchange, exchange, exchangeCode and other related information to realize the functions or services of sharing information, obtaining benefits and participating activities.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get your scissors permissions and read the information such as sharing code, passwords, etc. to realize the functions or services of sharing information, obtain benefits and participate in activities."}
{"task": "rw_71.jsonl", "id": 61776, "text": "Your shear information will only be processed on your device. We will only read the information related to our services to complete the relevant instructions, and we will not store your shear information.", "label": ["Data Retention", "Important"], "rewrite": "We only read the information related to us in the shear panel without storage."}
{"task": "rw_71.jsonl", "id": 61777, "text": "Without separate instructions and obtaining your consent, we will not collect other unrelated information in your shear board.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not collect other unrelated information in your shear plate without your consent."}
{"task": "rw_71.jsonl", "id": 61778, "text": "4. Help you complete the order, pay, recharge, and deliver the goods or services to you", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61779, "text": "(1) When you order specific products and/or services, and recharge in NetEase Game services, to show you the transaction information of the account and ensure the security of the transaction, we will generate the order for you to buy the product and/or service order for you through the system, Collect your specific order number, order creation time, and transaction amount information for you to display and facilitate your transaction management of orders.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you order the goods and/or services, and recharge, collect your specific order number, order creation time, and transaction amount information for you to display and facilitate your transaction management of orders."}
{"task": "rw_71.jsonl", "id": 61780, "text": "In the process of placement, if it is a physical product, we also need to provide you with the name of the consignee, the receipt address, and the contact telephone call information, so that we can deliver the goods to you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "As follows, we need to provide you with the name of the consignee, the receiving address, and the contact phone information."}
{"task": "rw_71.jsonl", "id": 61781, "text": "(2) In order to complete the order payment, delivery of goods or services, confirm the transaction status, and provide you with after -sales and dispute solutions, we will use the transaction objects, payment institutions, and logistics companies that you choose based on the exchange.Your account, orders, transactions, logistics information, or share your transaction information with the above -mentioned service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your account, orders, transactions, logistics information, or share the information to payment institutions, logistics companies, etc."}
{"task": "rw_71.jsonl", "id": 61782, "text": "The recharge record and consumption record are sensitive personal information. Collecting such information is necessary to achieve consumption functions, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting recharge records and consumption records is necessary for the realization of consumption functions."}
{"task": "rw_71.jsonl", "id": 61783, "text": "5. Provide you with customer service or other user response functions", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61784, "text": "When you contact our customer service or use other users to respond to functions (personal information protection complaints or suggestions, related complaints or suggestions or other customer complaints and needs), we need you to provide the necessary personal information to match and verify youUser identity to ensure your account and system security.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When you use the user's response function, we need you to provide the necessary personal information for your identity to ensure accounts and system security."}
{"task": "rw_71.jsonl", "id": 61785, "text": "In order to deal with your demands, artificial customer service needs to query or verify your relevant information within the scope of your authorization and use it only within the necessary range. If you refuse to provide or provide mistakes, we will not be able to provide you with corresponding support.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Artificial customer service checks and verify your information within your authorization range and use it to handle your demands."}
{"task": "rw_71.jsonl", "id": 61786, "text": "After confirming your user identity, we will also save you, contact information (you use other contact information when you contact us or you actively provide us), you and us, communication/call records and content, with youOther necessary information associated with demand to contact you or help you solve the problem, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your contact information, your communication records and content, and other necessary information for customer service."}
{"task": "rw_71.jsonl", "id": 61787, "text": "6. Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61788, "text": "Based on your personal information (your browsing and search records, equipment information, order information, advertising data), some NetEase game products will be based on the combination of the above or several information, you need to extract your browsing and search preferences, Behavioral habits and location information related to the page display and recommendation of personalized content and advertisements that provide you with pages that meet your needs.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Some NetEase Ranger products extract your browsing, search preferences, behavioral habits, and location information based on the personal information obtained in order to provide you with personalized content or advertising."}
{"task": "rw_71.jsonl", "id": 61789, "text": "If you do not want to accept personalized recommendation services, you can check the management method and close the corresponding functions on the NetEase game product. If you have any problems, you can log in to the \"NetEase User Personal Information Service Platform\" and contact us.", "label": ["Edit/Control", "Important"], "rewrite": "You can view management methods in the NetEase game product and close personalized recommendation services, or contact us."}
{"task": "rw_71.jsonl", "id": 61790, "text": "7. You understand and agree that in the process of using NetEase games, we will apply for access to your system permissions when necessary (there are differences in the device models and system versions you use) to realize the information involved in these permissionsCollection and use.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the process of using the game, we will apply for access to your system permissions when necessary to collect and use information."}
{"task": "rw_71.jsonl", "id": 61791, "text": "We will inform you of the purpose of opening permissions and asking your consent before opening the permissions. If you disagree, we will not open the relevant permissions, and we cannot provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will inform you of the purpose of opening permissions and asking your consent before opening permissions."}
{"task": "rw_71.jsonl", "id": 61792, "text": "The corresponding services and functions of the report/complaint;", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "After you agree to obtain the storage permission so that you can download, upload, and save the content, or through the cache, realize the corresponding services and functions of publishing/sharing information content, editing/modifying avatars, customer service communication, reporting/complaints."}
{"task": "rw_71.jsonl", "id": 61793, "text": "(2) After you agree to access the phone information permissions, you allow us to obtain your device information as a unique identifier for your device so that you can provide you with pages that meet your needs and recommend personalized content, understand and enhance products to improve products, understand and improve products.Adaptability, identification of abnormal status, and the security of the network and operation of NetEase game services;", "label": ["Usage", "Cessation of Operations", "First Party Collection Information", "Permission Acquisition"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61794, "text": "(3) After you agree to access the camera permissions, you can upload, take photos/pictures/videos, use \"scanning\", \"scan code\", and \"expression of emoticons\" to realize the release of information and reviews, live video, add addition, addFriends, watch videos/competitions, shared resources on face, or provide proof of providing proof of communication with customer service;", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "You agree to obtain the camera permissions so that you can upload, take photos/pictures/videos, use \"scanning\", \"scan code\", and \"expression\" functions."}
{"task": "rw_71.jsonl", "id": 61795, "text": "(4) After you agree to access the album permissions, you allow us to access your album content/add content to your album so that you can realize the release/share information content, upload/edit/modify avatar, picture/video information preservation, store, video information preservation, and video information preservation.Customer service communication, report/complaint;", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "You agree to obtain the album permissions so that you can publish/share information content, upload/edit/modify avatars, pictures/video information preservation, customer service communication, report/complaint."}
{"task": "rw_71.jsonl", "id": 61796, "text": "(5) After you agree to access the communication records, we can obtain your communication information information in order to provide you with a friend status query, invite your friends to use NetEase games, and share the content/product of the person you know;", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "After you agree to obtain communication records, collect communication records of friends, so that you can inquire about the status of your friends and invite friends to use or share content/products."}
{"task": "rw_71.jsonl", "id": 61797, "text": "(6) After you agree to access the microphone rights, you can use voice functions to interact with our products and others, or contact customer service to realize screen recording functions;", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "You agree to obtain microphone permission so that you can use the voice function to interact."}
{"task": "rw_71.jsonl", "id": 61798, "text": "(7) After you agree to access the location permissions, we can get your location information so that you can make information interaction with nearby friends, guide your location to move, or push you personalized content;", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "After you agree to obtain location permissions, collect location information so that you can perform information interaction, guide your location movement, or push you personalized content."}
{"task": "rw_71.jsonl", "id": 61799, "text": "Location information is sensitive personal information. If you disagree, it will only make you unable to interact with nearby players, move or accept corresponding personalized content, but it will not affect other functions that you have nothing to do with NetEase games. YouYou can also cancel your location information at any time.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "Refusing to provide location information only makes you unable to interact with nearby players, move or accept corresponding personalized content, but do not affect other functions, you can cancel location information authorization."}
{"task": "rw_71.jsonl", "id": 61800, "text": "(8) After you agree to access the calendar authority, we can get your schedule to provide you with the function of records and reminders.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "After you agree to obtain the calendar authority to provide you with the function of record and reminder."}
{"task": "rw_71.jsonl", "id": 61801, "text": "Tips on specific function permissions: If you need to close the function permissions that you open to use the above specific functions, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service provider or manufacturer.You can also log in, \"NetEase User Personal Information Service Platform\", contact us.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to close the function permissions that you open to use specific functions, refer to or contact your mobile device service provider or manufacturer or contact us."}
{"task": "rw_71.jsonl", "id": 61802, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_71.jsonl", "id": 61803, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_71.jsonl", "id": 61804, "text": "If we want to use your personal information for other unprepared uses or other personal information that are not mentioned in this policy, we will obtain your consent separately through page prompts, pop -ups or other methods according to law.", "label": ["Important", "Usage"], "rewrite": "If your information is used in the unpreparedness of this policy or collecting your personal information, we will obtain your explicit consent in a clear way."}
{"task": "rw_71.jsonl", "id": 61805, "text": "8. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61806, "text": "According to the relevant laws and regulations, the processing of your information in the following situation does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to the relevant laws and regulations, the processing of your information in the following situation does not need to obtain your authorization consent:"}
{"task": "rw_71.jsonl", "id": 61807, "text": "(1) It is necessary for the contract to establish and fulfill your contract as one party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_71.jsonl", "id": 61808, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_71.jsonl", "id": 61809, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property security of you or others;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_71.jsonl", "id": 61810, "text": "(4) Implement news reports and public opinion supervision for public interests, and deal with your personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_71.jsonl", "id": 61811, "text": "(5) Treatment your own personal information that you disclose or have legal disclosure within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "To handle individuals and other personal information that have been disclosed by themselves within a reasonable scope, no need to solicit authorization consent."}
{"task": "rw_71.jsonl", "id": 61812, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_71.jsonl", "id": 61813, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61814, "text": "We or our third -party partners may obtain and use your information through Cookies or similar technologies, and store these information as log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We or our third -party partners obtain and use your information through cookies or similar technologies, and store it as a log message."}
{"task": "rw_71.jsonl", "id": 61815, "text": "By using Cookies, we provide users with a simple and easy -going and personalized network experience.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61816, "text": "A cookies are a small amount of data, which are sent from a network server to your browser and there are computer hard disks.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61817, "text": "We use cookies to benefit its users.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61818, "text": "For example, in order to make the login process of NetEase virtual community faster, you can choose to exist in a cookies.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61819, "text": "In this way, when you log in to NetEase's service, you can be more convenient and fast.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61820, "text": "Cookies can help us determine the pages and content you are connected. You spend time on Netease's specific services and the NetEase game service you choose.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61821, "text": "Cookies enables us to serve you better and faster, and make your experience in NetEase game service more personalized.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61822, "text": "However, you should be able to control whether cookies and how your browser is accepted.", "label": ["Important", "Edit/Control"], "rewrite": "You can control whether cookies and how to be accepted by your browser."}
{"task": "rw_71.jsonl", "id": 61823, "text": "Please check the files attached to your browser to get more information in this area.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61824, "text": "We and third -party partners may collect and use your information through cookies or similar technologies and store such information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61825, "text": "We use our own cookies or similar technologies for the following uses (specifically based on the services and functions set by specific games):", "label": ["Usage"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61826, "text": "1. Remember your identity.", "label": ["Usage"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61827, "text": "Cookies or similar technologies help us identify your identity as our registered user, or save you to provide us with your preferences or other information;", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies help remember your identity, or save your preferences or other information."}
{"task": "rw_71.jsonl", "id": 61828, "text": "2. Analyze the situation of your service.", "label": ["Usage"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61829, "text": "We can use Cookies or similar technologies to understand what activities you use for NetEase game services, or which services are the most popular;", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies to understand your behavior information, or which services are the most popular."}
{"task": "rw_71.jsonl", "id": 61830, "text": "3. Advertising optimization.", "label": ["Usage"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61831, "text": "Cookies or similar technologies help us provide you with advertisements that you may be more interested in according to your information instead of universal advertising.", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies help us provide more accurate advertising."}
{"task": "rw_71.jsonl", "id": 61832, "text": "When we use Cookies or similar technologies for the above purposes, we may provide non -personal identity information collected through cookies or similar technologies to advertisers and other partners to analyze how you and other users use Netease game services and use advertising services for advertising servicesEssence", "label": ["Important", "Usage"], "rewrite": "We may provide partners with non -personal identity information collected by cookies or similar technologies to analyze your service use and advertising services."}
{"task": "rw_71.jsonl", "id": 61833, "text": "There may be Cookies or similar technologies placed by advertisers and other partners in NetEase games.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "There may be Cookies or similar technologies placed by advertisers and other partners in NetEase games."}
{"task": "rw_71.jsonl", "id": 61834, "text": "These cookies, or similar technologies, may collect non -personal identity information related to you to analyze how users use such services, send ads you may be interested in, or use the effects of advertising services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Third -party cookies and similar technologies may collect your non -personal identity information to analyze how users use services, evaluate advertising effects, and send advertisements."}
{"task": "rw_71.jsonl", "id": 61835, "text": "These third -party cookies or similar technologies are collected and used by such information that are not bound by this policy, but are subject to their own information protection statements. We are not responsible for third -party Cookies or similar technologies.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We are not responsible for third -party Cookies or similar technologies."}
{"task": "rw_71.jsonl", "id": 61836, "text": "You can refuse or manage cookies or similar technologies through a browser or user selection mechanism.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse or manage cookies or similar technologies through browser or user selection mechanism."}
{"task": "rw_71.jsonl", "id": 61837, "text": "But please note that if you stop using cookies or similar technologies, we may not be able to provide you with a better service experience, and certain services may not be used normally.", "label": ["Important", "Edit/Control"], "rewrite": "If you stop cookies or similar technologies, some services may not be used normally."}
{"task": "rw_71.jsonl", "id": 61838, "text": "At the same time, you will still receive advertisements, but these advertisements will be reduced with you.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61839, "text": "3. How can we share, transfer or disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61840, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61841, "text": "We attach great importance to protecting your personal information.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61842, "text": "We will only provide your personal information to third parties for the legal, correct, necessary, specific, and clear goals.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only provide your personal information to third parties for the legal, correct, necessary, specific, and clear goals."}
{"task": "rw_71.jsonl", "id": 61843, "text": "When we receive our personal information, we will sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a confidentiality agreement with personal information receivers to ask them to handle information in accordance with our instructions, this policy, and other confidentiality and security measures."}
{"task": "rw_71.jsonl", "id": 61844, "text": "1. In order to achieve the purpose of the statement in this policy, we will access the SDK or other similar applications provided by the third -party service provider (including the form of embedded code, plug -in, H5) to cooperate with third -partyGood customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will access SDK or other similar applications provided by third -party service providers to cooperate with third -party."}
{"task": "rw_71.jsonl", "id": 61845, "text": "The situation of commissioning or sharing personal information to achieve our service is as follows (specifically based on the service and functions set by specific games):", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61846, "text": "(1) For advertising -related services, including advertising display, advertising data monitoring/statistics;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information for advertising -related services, including advertising display, advertising data monitoring/statistics."}
{"task": "rw_71.jsonl", "id": 61847, "text": "(2) For message push functions, including mobile phone manufacturer PUSH push, specific event reminder, personalized content recommendation;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information for message push functions, including mobile phone manufacturer Push push, specific events reminders, and personalized content recommendation."}
{"task": "rw_71.jsonl", "id": 61848, "text": "(3) Used to pay related services, including order payment, transaction behavior verification, income settlement, payment information remittance president;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information for payment related services, including order payment, transaction behavior verification, income settlement, and payment information."}
{"task": "rw_71.jsonl", "id": 61849, "text": "(4) Use the location permissions, collect equipment information and log information for your consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information to obtain equipment location permissions, collect equipment information and log information."}
{"task": "rw_71.jsonl", "id": 61850, "text": "(5) For third -party authorization services, including the third -party account login recognized by NetEase Games;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information for third -party authorization services, including third -party accounts recognized by NetEase Games."}
{"task": "rw_71.jsonl", "id": 61851, "text": "(6) Used to support product function modules, including online live broadcast, video playback, voice recognition, AR, smart customer service, barrage playback, content storage;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information to support product function modules, including online live broadcast, video playback, voice recognition, AR, smart customer service, barrage playback, content storage."}
{"task": "rw_71.jsonl", "id": 61852, "text": "(7) Used to optimize product performance and service quality, including improving hardware distribution capacity, reducing server costs, functional heat repair, security analysis, optimizing game services, and improving user experience;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrust or share personal information to optimize product performance and service quality."}
{"task": "rw_71.jsonl", "id": 61853, "text": "(8) Used for account security and product reinforcement related services, including network monitoring, domain name analysis, anti -hijacking, anti -junk anti -cheating services, plus decryption services;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information for account security and product reinforcement services."}
{"task": "rw_71.jsonl", "id": 61854, "text": "(9) It is used for logistics services, including packeting, transportation, and express delivery, including physical goods.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Entrusted or shared personal information for logistics services."}
{"task": "rw_71.jsonl", "id": 61855, "text": "2. Netease game service access or link to other products or services provided by other products or services or services provided by non -Netease games, including:", "label": ["Important", "Risk"], "rewrite": "Netease Game access or link to other products or services or services provided by third parties provided by Non -NetEase games."}
{"task": "rw_71.jsonl", "id": 61856, "text": "(1) You can use the \"Share\" function to share certain NetEase games service content on other products or services or third -party products or services of non -NetEase games, or you will use other products or services or third -party products or third -party products of non -NetEase games orThe content of the service is shared to NetEase game service;", "label": ["Important", "Edit/Control"], "rewrite": "You can use the \"Share\" function to share service content between the products or services of NetEase games and third -party products or services."}
{"task": "rw_71.jsonl", "id": 61857, "text": "(2) Provide you through advertising or other ways, so that you can link to other products or services, third -party products or services or websites of non -NetEase games;", "label": ["Important", "Risk"], "rewrite": "You can connect to third -party products or services through advertising or other ways."}
{"task": "rw_71.jsonl", "id": 61858, "text": "(3) Other conditions to access third -party services.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61859, "text": "Some third -party SDKs or applications we access will collect your personal information. If you use such services provided by third parties in our services, you agree that you will directly collect and process your information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Risk"], "rewrite": "If you use the services provided by a third party in our services, you agree to collect and process your information directly."}
{"task": "rw_71.jsonl", "id": 61860, "text": "We will evaluate the legality, legitimacy, and necessity of such third -party services to collect personal information, and require these third parties to take protection measures for your personal information, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Important", "Data Security"], "rewrite": "We will evaluate the legality, legitimacy, and necessity of third -party services to collect personal information, require them to take protection measures, and strictly abide by relevant laws and regulations and regulatory requirements."}
{"task": "rw_71.jsonl", "id": 61861, "text": "The above third -party services are operated by related third parties.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61862, "text": "If you use these third -party services (including any information you provided to these third parties), you must be subject to the third -party service terms and personal information protection related rules (not this policy). You need to read its clause carefully.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61863, "text": "This policy is only applicable to the personal information we collected, and it does not apply to the service provided by any third party or the rules of information use of third -party information.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61864, "text": "If you find that these third -party services are risky, it is recommended that you terminate related operations to protect your legitimate rights and interests and contact us in time.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61865, "text": "You can click \"Third -Party Service Sharing List\" to learn about the specific situation of the third -party service we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click \"Third -Party Service Sharing List\" to learn about the specific situation of third -party services."}
{"task": "rw_71.jsonl", "id": 61866, "text": "You can also choose to contact us through the feedback channels listed in the chapter of \"How to contact us\" through this policy, and we will answer it as soon as possible.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61867, "text": "3. In order to better protect the physical and mental health of minors, guide minors to go online, and prevent minors from using and borrowing the relevant information of adults, we will be based on the request of the minor guardian or we actively protect the minors.If you need it, you will try to contact his guardian to inform the guardian of the relevant game account, game duration, consumer transaction records, and game behavior information to remind, confirm and handle it.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Based on the requests of minors 'guardians or protecting the needs of minors, we will inform their guardians' gaming accounts, game duration, consumer transaction records, and game behavior information."}
{"task": "rw_71.jsonl", "id": 61868, "text": "4. In order to improve the product research and development capabilities and service levels of NetEase games so that you can provide you with better products and services, we will share the scriptures with research institutions, scientific research institutes, and university institutions within a legal, reasonable and necessary scope.Data after identification or anonymous processing.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Within a legal, reasonable, and necessary scope, data with research institutions, research institutes, and universities institutions are shared by logo or anonymous data."}
{"task": "rw_71.jsonl", "id": 61869, "text": "Without your clear authorization, we will not share with the above agencies that can be used to identify your personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share information that can be used to identify your personal identity with research institutions, research institutes, and university institutions."}
{"task": "rw_71.jsonl", "id": 61870, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61871, "text": "When we have a merger, acquisition, asset transfer, separation, dissolution, declaration of bankruptcy or similar situation, if your personal information needs to be transferred, we will inform you the relevant situation and inform you that the name and contact information of the receiver willAnd will require the new receiver to continue to protect your personal information in accordance with laws and regulations and not lower than the requirements of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_71.jsonl", "id": 61872, "text": "(3) Public public", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61873, "text": "We will only disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information in the following circumstances:"}
{"task": "rw_71.jsonl", "id": 61874, "text": "1. According to your needs, disclose the information you specified when you clearly agree;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your needs, disclose the information you specified without your clear consent."}
{"task": "rw_71.jsonl", "id": 61875, "text": "2. Discover your personal information according to the requirements of laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Public your personal information according to the requirements of laws and administrative regulations."}
{"task": "rw_71.jsonl", "id": 61876, "text": "4. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61877, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61878, "text": "In addition to laws and regulations or regulatory authorities, we only store your personal information in the purpose of this policy's purpose and shortest time limit.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_71.jsonl", "id": 61879, "text": "If we terminate our services or operations, we will stop collecting your personal information in time. At the same time, we will comply with relevant laws and regulations to inform you in advance, and delete or processes your personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the operation is stopped, the announcement will be announced in accordance with relevant laws and regulations, and the personal information will be deleted or anonymous after termination of the service or operation."}
{"task": "rw_71.jsonl", "id": 61880, "text": "If you apply for cancellation account, actively delete personal information, or exceed the necessary period, we will delete or processes your personal information, except for the laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel your account, take the initiative to delete personal information, or go beyond the necessary storage period, we will delete or anonymous processing of personal information, except for other provisions of laws and regulations."}
{"task": "rw_71.jsonl", "id": 61881, "text": "The personal information we collected in the People's Republic of China is stored in China. If we need to transmit cross -border transmission, we will request it separately to obtain your authorization consent and ensure that it is implemented in accordance with national laws and regulations and relevant regulatory departments.Personal information provides sufficient protection.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China. If you need to transmit cross -border transmission, you will obtain your authorization consent and provide personal information protection."}
{"task": "rw_71.jsonl", "id": 61882, "text": "(2) Protection of personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61883, "text": "We attach great importance to information security, set up a special security team, and take all reasonable and feasible measures to protect your personal information:", "label": ["Important", "Data Security"], "rewrite": "Establish a special security team and take measures to protect your personal information."}
{"task": "rw_71.jsonl", "id": 61884, "text": "1. Data security technical measures", "label": ["Data Security"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61885, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional norms and security technology to prevent your personal information from being accessed, using, modifying, and avoiding data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Establish institutional standards and security technologies to prevent personal information from being accessed, used, and modified to avoid damage or loss of data."}
{"task": "rw_71.jsonl", "id": 61886, "text": "Our services have adopted de -identification and multiple encryption technologies. We will use the above technology (including SSL) to encrypt your personal information and isolate through isolation technology to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "Personal information is encrypted by de -identification and multiple encryption technologies, and isolation isolates through isolation technology to protect personal information."}
{"task": "rw_71.jsonl", "id": 61887, "text": "In the use of personal information, including information display and information association calculations, we will use multiple data desensitization technology to enhance the security of information in use.", "label": ["Important", "Data Security"], "rewrite": "Use a variety of data desensitization technology to enhance the security of information in use."}
{"task": "rw_71.jsonl", "id": 61888, "text": "We will also use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid data from illegal use.", "label": ["Important", "Data Security"], "rewrite": "Use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid illegal use of data."}
{"task": "rw_71.jsonl", "id": 61889, "text": "2. Other security measures we have taken to protect personal information", "label": ["Data Security"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61890, "text": "We have the industry's advanced data as the core and the data security management system carried out around the data life cycle. From the aspects of organizational construction, system design, personnel management, and product technology, we improve the security of the entire system.", "label": ["Important", "Data Security"], "rewrite": "The data security management system improves the security of the entire system in terms of organizational construction, system design, personnel management, and product technology."}
{"task": "rw_71.jsonl", "id": 61891, "text": "We manages the storage and use of personal information by establishing a data classification classification system, data security management specifications, and data security development specifications.", "label": ["Important", "Data Security"], "rewrite": "Establish a data classification hierarchical system, data security management standards, and data security development standard management standards for storage and use of personal information."}
{"task": "rw_71.jsonl", "id": 61892, "text": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors.", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms, the data is fully securely controlled."}
{"task": "rw_71.jsonl", "id": 61893, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of security and understanding of personal information protection policies and related regulations.", "label": ["Important", "Data Security"], "rewrite": "Organize safety and privacy protection training courses to strengthen employees' awareness of security and understanding of personal information protection policies and related regulations."}
{"task": "rw_71.jsonl", "id": 61894, "text": "We can only allow Netease employees and partners to visit your personal information, and we have set up strict access control and monitoring mechanisms for this reason.", "label": ["Important", "Data Security"], "rewrite": "Strict management has also been adopted to employees or partners who may contact you."}
{"task": "rw_71.jsonl", "id": 61895, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "All personnel who are required to contact personal information to perform their obligations of confidentiality."}
{"task": "rw_71.jsonl", "id": 61896, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended with Netease's cooperative relationship.", "label": ["Important", "Data Security"], "rewrite": "If you fail to fulfill your confidentiality obligations, you may be held legal or suspended."}
{"task": "rw_71.jsonl", "id": 61897, "text": "The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of your personal information you send to our personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61898, "text": "If our physical, technical, or management protection facilities are damaged, and personal information is leaked, tampered with, or lost, and your legitimate rights and interests are damaged. We will notify you as soon as possible in accordance with the provisions of the law and assume the corresponding corresponding.legal liability.", "label": ["Important", "Data Security"], "rewrite": "If our physical, technical, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering or destruction, which will cause your legitimate rights and interests to be damaged, and we will bear the corresponding legal responsibility."}
{"task": "rw_71.jsonl", "id": 61899, "text": "3. Safety event disposal", "label": ["Data Security"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61900, "text": "In order to cope with personal information leakage, tampering and loss of related risks, we have formulated a number of systems to clarify the classification and grading standards of security events, the classification standards of security vulnerabilities, and the corresponding processing process.", "label": ["Important", "Data Security"], "rewrite": "Clarify the classification and grading standards of security events, security vulnerabilities, and corresponding processing processes to cope with the risks related to personal information leakage, tampering and loss."}
{"task": "rw_71.jsonl", "id": 61901, "text": "The emergency response team that we also established for security events, in accordance with the requirements of the safety incident, launch a safety plan for different security incidents, conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and crack down.", "label": ["Important", "Data Security"], "rewrite": "The emergency response team launched a safety plan for different security incidents to conduct stop loss, analysis, positioning, formulating remedial measures, and combined with relevant departments to trace the source and crack down."}
{"task": "rw_71.jsonl", "id": 61902, "text": "We also regularly organize internal training and emergency drills to enable our relevant staff to master the corresponding emergency disposal strategies and regulations.", "label": ["Important", "Data Security"], "rewrite": "Regularly organized internal training and emergency drills allowing staff to master the emergency disposal strategies and procedures for safety incidents."}
{"task": "rw_71.jsonl", "id": 61903, "text": "When an information security incident may occur or unfortunately, we will immediately take remedial measures in accordance with the requirements of laws and regulations, and inform you in a timely manner: the basic situation and possible impact of security incidents, the disposal measures we have taken or we will take, you have taken, you that we will take, you that we are going to take, you that we will take, you that we will take, you that we will take, you that we will take, you have taken or we will take, you have taken or we are going to take, you have taken or we will take, you have adopted or we will take, you have taken or we will take, you have taken or we will take, you have taken or we will take, you have taken or we will take, you have taken or we will take, you have taken or we will take, and you have taken or we will take.Suggestions that can prevent and reduce risks, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_71.jsonl", "id": 61904, "text": "At the same time, we will inform you that the incident -related situation is in the form of mail, letter, telephone, and push notification. When it is difficult to inform the information subject one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_71.jsonl", "id": 61905, "text": "At the same time, we will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_71.jsonl", "id": 61906, "text": "4. Safety reminder", "label": ["Data Security"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61907, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_71.jsonl", "id": 61908, "text": "You need to understand that the system and communication network used in the NetEase game service may be due to the situation outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_71.jsonl", "id": 61909, "text": "Please keep your account, password and other identity elements properly.", "label": ["Important", "Data Security"], "rewrite": "Please protect your personal information properly."}
{"task": "rw_71.jsonl", "id": 61910, "text": "When you use Netease game services, we will identify your identity through your account, password and other identity elements.", "label": ["Important", "Data Security"], "rewrite": "When you use Netease game services, we will identify your identity through account numbers, passwords and other identity elements."}
{"task": "rw_71.jsonl", "id": 61911, "text": "Once you leak the aforementioned information, you may suffer losses and may be unfavorable to you.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61912, "text": "If you find an account, password and/or other identity elements that may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_71.jsonl", "id": 61913, "text": "5. How to exercise your personal information related rights", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61914, "text": "(1) Review, copy, transfer, correct, supplement and delete", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61915, "text": "During your use of NetEase game services, we will provide you with the corresponding operation settings to manage your personal information according to the specific situation of each game product so that you can check, copy, transfer, correct, supplement, delete or withdraw your relevant individualsinformation.", "label": ["Important", "Edit/Control"], "rewrite": "You can check, copy, transfer, correct, replenish, delete or remove your relevant personal information through the corresponding operation settings."}
{"task": "rw_71.jsonl", "id": 61916, "text": "1. You can check your account basic information in the NetEase game product you use (account avatar, nickname, and other personal information you choose to fill in.Achievements, records, and specific game information of each product), more correct and supplement your account basic information according to the specific situation.", "label": ["Edit/Control", "Important"], "rewrite": "Check your account basic information and game historical information in NetEase game products, and more correct and supplement your account basic information according to the specific situation."}
{"task": "rw_71.jsonl", "id": 61917, "text": "2. If you have other doubts or difficulties in checking, replication, transfer, correction, supplementation, or deleting demand, or you can log in to NetEase users \"NetEase User Personal Information Service Platform\" in the process of using the game productProvides related operation guidelines and operation settings. You can operate yourself. If you have doubts or difficulties in the operation process, you can contact customer service. You can also choose to contact us by the feedback channel listed in the chapter listed in the chapter of the \"How to contact us\" through this policy.Will deal with you in time.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to NetEase users' \"Netease User Personal Information Service Platform\" to view personal information inspection, replication, transfer, correction, supplementation, or deletion of operational settings and operation settings, or contact customer service for processing."}
{"task": "rw_71.jsonl", "id": 61918, "text": "Except for other provisions of laws and regulations, when you correct, supplement, delete your personal information or apply for a cancellation account, we may not immediately correct, supplement, or delete the corresponding information from the backup system, but we will no longer apply relevant information about relevant informationIt is processed and will be corrected, supplemented or deleted when the backup is updated.", "label": ["Edit/Control", "Important"], "rewrite": "More corrected, supplemented, and delete the information in the backup system during the backup update."}
{"task": "rw_71.jsonl", "id": 61919, "text": "Once the relevant information is deleted or the account is canceled, it will not be recovered. Please operate carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the relevant information is deleted or the account is canceled, it will not be recovered."}
{"task": "rw_71.jsonl", "id": 61920, "text": "(2) Public and sharing", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61921, "text": "Some functions of Netease Games allow you not only to widen your social network, but also publicly share your relevant information with all users using this feature. You can upload or publish information, you can upload or publish other peopleA response made by information.", "label": ["Edit/Control", "Important"], "rewrite": "You can upload or post information, or respond to the information uploaded or published by others."}
{"task": "rw_71.jsonl", "id": 61922, "text": "As long as you do not delete the information you disclosed or shared, the information may always stay in the public field;", "label": ["Important", "Edit/Control"], "rewrite": "The information you disclosed or shared may always be left in the public field before deleting."}
{"task": "rw_71.jsonl", "id": 61923, "text": "Even if you delete the shared information, the relevant information may be cached, copied or stored independently by other users or the third parties that are not controlled by us, or are preserved by other users or such third parties in the public.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After deleting the information you share, it may still be independently preserved by other users or the third parties that are not controlled by us."}
{"task": "rw_71.jsonl", "id": 61924, "text": "If you disclose or share information through the above channels, we will not bear responsibility for your information leakage.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61925, "text": "Therefore, we remind and ask you to consider whether to disclose or share your information through the above channels.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61926, "text": "(3) Account cancellation", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61927, "text": "We provide you with a way to cancel your account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61928, "text": "In the case that meets our terms of service terms and stipulated in relevant national laws and regulations, you can submit an account cancellation application on the \"NetEase User Personal Information Service Platform\" in accordance with the corresponding requirements.", "label": ["Edit/Control", "Important"], "rewrite": "You can submit an account cancellation application on the \"NetEase User Personal Information Service Platform\" as required."}
{"task": "rw_71.jsonl", "id": 61929, "text": "You can also choose to contact us through the feedback channels listed in the chapter of \"How to contact us\" through this policy, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61930, "text": "After the cancellation of your account, we will stop providing you with all or part of the NetEase game services, and delete your personal information or do anonymous processing according to your requirements, except for other regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, it will stop providing you with it and delete or anonymous personal information. The laws and regulations will be otherwise stipulated."}
{"task": "rw_71.jsonl", "id": 61931, "text": "Once the relevant information is deleted or the account is canceled, it will not be recovered. Please operate carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the cancellation is completed, it will not be restored."}
{"task": "rw_71.jsonl", "id": 61932, "text": "(4) The scope of change of authorization consent", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61933, "text": "You can choose whether to provide us with personal information.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose whether to provide personal information."}
{"task": "rw_71.jsonl", "id": 61934, "text": "You can change the scope of your authorization of information by deleting information, closing the device function, and cancellation of your account.", "label": ["Edit/Control", "Important"], "rewrite": "You can change the scope of authorization or withdraw authorization by deleting information, closing the device function, and cancellation account."}
{"task": "rw_71.jsonl", "id": 61935, "text": "You can also log in to the \"NetEase User Personal Information Service Platform\" to contact us to carry out the withdrawal of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can log in to the \"NetEase User Personal Information Service Platform\" to contact us to withdraw authorization."}
{"task": "rw_71.jsonl", "id": 61936, "text": "After the withdrawal authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization, and we will no longer process your corresponding information.", "label": ["Edit/Control", "Important"], "rewrite": "When the authorization is withdrawn, the corresponding service is no longer provided or the information is no longer processed."}
{"task": "rw_71.jsonl", "id": 61937, "text": "But your decision to withdraw authorization will not affect the information processing based on your authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_71.jsonl", "id": 61938, "text": "(5) Equal information system automation decision -making", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61939, "text": "In certain business functions, we will make a decision based on the non -artificial automatic decision -making mechanism, including the information system and algorithm (specifically based on the services and functions set by specific games).", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61940, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If non -artificial automatic decisions affect your legitimate rights and interests, you have the right to ask us to explain that we will also provide relief."}
{"task": "rw_71.jsonl", "id": 61941, "text": "(6) The right to close relatives of the deceased", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61942, "text": "If NetEase game users died unfortunately, their close relatives can contact us through the contact information in the chapter of the \"How to contact us\" through this policy to exercise their legal rights to the relevant personal information of the deceased.", "label": ["Specific Audiences", "Important"], "rewrite": "If NetEase game users died unfortunately, their close relatives can contact us to exercise their legal rights to the dead of the deceased in accordance with the law."}
{"task": "rw_71.jsonl", "id": 61943, "text": "6. Protection of minors", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61944, "text": "We suggest:, any minor participation in online activities should obtain the consent of the parents or other guardians (hereinafter referred to as the \"guardian\") in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Suggestion: Any minor participating in online activities should obtain the consent of the guardian in advance."}
{"task": "rw_71.jsonl", "id": 61945, "text": "We will protect relevant information about minors in accordance with the provisions of relevant national laws and regulations.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61946, "text": "We encourage guardians to guide minors to use NetEase game services.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61947, "text": "If you are a minor under the age of fourteen, please notify your guardian to read our \"Personal Information Protection Rules and Guardian in NetEase Game Children's Personal Information Protection and Guardian,\" and before you use NetEase game services and submit personal information,Seeking its consent and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please use the service to read the policy carefully and the \"Personal Information Protection Rules of the Children\" and agree to use services or provide information under the guidance of the guardian."}
{"task": "rw_71.jsonl", "id": 61948, "text": "If you are the guardian of minors, before you register and use Netease game services to help minors, you should read this policy carefully and the \"Personal Information Protection Rules and Guardian Instructions for Children's Game Children\" to decide whether to agree with this policy and \"\"NetEase Game Children's Personal Information Protection Rules and Guardian Instructions\" and help minors register and use.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian should help children complete the registration and use of products or services after reading and agreeing to the policy."}
{"task": "rw_71.jsonl", "id": 61949, "text": "According to the requirements of the national defense addiction policy, we will determine whether the real -name information of the relevant account is a minor through real -name identity and related information, and some game products will also initially identify whether you are in the game behavior data that you generate during the game.Minors and decided to incorporate this account into the anti -addiction system.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Determine whether it is a minor by verifying the real -name identity and collecting game behavior data to determine whether it is included in the anti -addiction system."}
{"task": "rw_71.jsonl", "id": 61950, "text": "In addition, we will collect your login time and game duration information. By automatically intervention and restricting minors' game time and enable the mandatory offline function, to guide the rational game of minors and consume it at the suspected minor consumptionLater, try to contact his guardian to remind, confirm and deal with it to help minors to go online.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Collect information such as login time, game duration, etc., automatically intervention and restrict the game time of minors at the system level, enable the forced offline function, and contact their guardian after suspected minors consumption."}
{"task": "rw_71.jsonl", "id": 61951, "text": "In order to better protect the physical and mental health of minors, guide minors to access the Internet, and prevent minors from using and borrowing relevant information about adults, we implement moreIn order to strict anti -addiction measures, it continuously explores, develops, and tests new technologies to protect minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61952, "text": "For example, we will open in specific scenarios in some games or for some users (based on specific game strategies) (when you log in to the game or include related in the game, the game recharge, consumption or transaction)Identification verification (if you use face recognition, we will use the face recognition function provided by the game or the human face recognition function provided by the NetEase Grand God APP or the NetEase Easy Dun.Yi Dun is used for face recognition).", "label": ["Specific Audiences", "First Party Collection Information", "Important", "Usage"], "rewrite": "In some games or for some users in specific scenarios, face recognition verification is enabled."}
{"task": "rw_71.jsonl", "id": 61953, "text": "Your face information is sensitive personal information. We will take strict confidentiality measures and only use it to compare with the public security data platform. We will not store your face information.", "label": ["Specific Audiences", "Important", "Data Retention", "First Party Collection Information", "Usage"], "rewrite": "Take confidentiality measures to your face information and only compare with the public security data platform without storage."}
{"task": "rw_71.jsonl", "id": 61954, "text": "In addition, we have also established the \"NetEase Parenting Platform\".", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61955, "text": "Parents' care platform can help parents or guardians understand their children's game conditions at any time. Set up consumption limit and daily game duration and time periods, assist parents of parents or guardians to manage their children's game behavior, and promote the healthy growth of children.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61956, "text": "You can visit the NetEase Parents Care platform website or public account to learn more about the introduction of NetEase game anti -addiction measures and parental guardians.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61957, "text": "Seven, revised and notice", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61958, "text": "In order to provide you with better services, we will modify the terms of this policy in a timely manner according to the update of NetEase game services and the relevant requirements of laws and regulations. These modifications constitute a part of the policy policy.", "label": ["Policy Change", "Important"], "rewrite": "The amendment of this policy terms constitutes part of the policy policy."}
{"task": "rw_71.jsonl", "id": 61959, "text": "We will announce any changes to this policy on this page.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61960, "text": "For major changes, we will also provide more significant notifications (website announcement, push notification, pop -up window prompts, or other methods). The major changes referred to in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61961, "text": "1. Make a major change in our service model.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61962, "text": "Including the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61963, "text": "2. We have undergone major changes in the structure of ownership.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61964, "text": "Including business adjustments, bankruptcy mergers and acquisitions, the owner's change;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61965, "text": "3. The main objects of personal information sharing, transfer or disclosure have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61966, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61967, "text": "5. We are responsible for dealing with the responsible departments, contact methods and complaint channels for handling personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61968, "text": "6. Other important or may seriously affect your personal rights and interests.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61969, "text": "Any of our modification will put your satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61970, "text": "We encourage you to check our privacy policies every time you use Netease game services.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61971, "text": "We will send you notice related to service when necessary.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61972, "text": "If you don't want to continue the message we push, you can ask us to stop pushing.", "label": ["Important", "Edit/Control"], "rewrite": "You can ask us to stop message push."}
{"task": "rw_71.jsonl", "id": 61973, "text": "For details, we can stop sending promotion SMS according to the SMS withdrawal guidelines, or settings in the mobile terminal device, and no longer receive the message of our push;", "label": ["Important", "Edit/Control"], "rewrite": "It can be set up according to the SMS, or settings in the mobile device, and no more message push can be received."}
{"task": "rw_71.jsonl", "id": 61974, "text": "However, except for the situation of sending messages in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61975, "text": "8. How to contact us", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61976, "text": "We have set up a full -time department for personal information protection and will protect your personal information in accordance with this policy.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61977, "text": "If you have any questions, opinions or suggestions on the complaints and reports of personal information protection, or you have any questions, opinions or suggestions on the privacy measures of this policy, NetEase, and your information, please contact NetEase's personal information protection staff to send emails to send emailsTo NEPRIVACY@service.netease.com or write to the following address: No. 399, NetEase No. 399, NetEase Binjiang District, Hangzhou, Personal Information Protection Specialist (Received);", "label": ["Important", "Contact Information"], "rewrite": "Email: NEPRIVACY@Service.netease.com; Contact address: No. 399 NetEase Phase II Period Personal Information Protection Specialist (received) in Binjiang District, Hangzhou."}
{"task": "rw_71.jsonl", "id": 61978, "text": "Postcode: 310052.", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 310052"}
{"task": "rw_71.jsonl", "id": 61979, "text": "Under normal circumstances, we will reply to your problems, opinions or suggestions, and verify your user identity.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 15 working days after receiving your contact and verifying your identity."}
{"task": "rw_71.jsonl", "id": 61980, "text": "If you are not satisfied with our reply, you can also complain to the consumer rights protection department or filed a lawsuit with the courts with jurisdictions.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61981, "text": "The provider of NetEase Game Services includes Hangzhou NetEase Leihuo Technology Co., Ltd. (Registration Address: Room 702, Building 4, Fang Shang, Changhe Street, Changhe Street, Binjiang District, Hangzhou), and Guangzhou Netease Computer System Co., Ltd. (Registration address: Tianhe District, Tianhe District, GuangzhouRoad No. 5 self-edited A2, Unit 01, 2nd Floor) and Shanghai Net Yifeu World Network Technology Co., Ltd. (Registration Address: No. 315, No. 315, Fenggu Road, Xuhui District, Shanghai)Service providers are subject to the game's explanation.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61982, "text": "appendix:", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61983, "text": "NetEase Game Children's Personal Information Protection Rules and Guardian Instructions", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61984, "text": "Updated in this version: November 01, 2021", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61985, "text": "Netease Games (also known as \"we\") knows children (referring to minors under the age of 14, the same below, also known as: \"child\") personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61986, "text": "We hope that through the \"Personal Information Protection Rules and Instructions of Children in NetEase Games\" (hereinafter referred to as \"this rules\"), it explains that we correspond to related matters such as collecting and using the child's personal information.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61987, "text": "Before using Netease game products and services, please ask children, children or other guardians (hereinafter collectively referred to as \"guardians\") must read and thoroughly understand this rule, especially the terms of bold/below logo.Fully understand and agree to all the terms before starting to use.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Ask children and guardians to start using it after confirming and agreeing with all the terms."}
{"task": "rw_71.jsonl", "id": 61988, "text": "Special description of the guardian:", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61989, "text": "If we learn that your child is less than fourteen years old, we will take special measures according to this rule to protect the personal information of your child obtained.", "label": ["Specific Audiences", "Important"], "rewrite": "This rule is suitable for children under the age of 14."}
{"task": "rw_71.jsonl", "id": 61990, "text": "Please help us protect your children's personal information and privacy security, ask them to read and accept this rule together under your guardianship, and use NetEase game services and submit personal information under your consent and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "Children should read and accept this rule under the guardian's guardianship, and use game services and submit personal information under the consent and guidance of the guardian."}
{"task": "rw_71.jsonl", "id": 61991, "text": "If you do not agree with the content of this rule, please ask your child to stop access/use Netease game services immediately.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "If the guardian does not agree with the content of this rule, the child should be required to stop access/use Netease game services immediately."}
{"task": "rw_71.jsonl", "id": 61992, "text": "You clicked on the line online or agreed with this rule through other methods, indicating that you agree that we agree that we collect, use, store, share, transfer, and disclose your child's personal information in accordance with this rule.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "You clicked on the line online or agreed with this rule through other methods, that is, it means that collecting, using, storing, sharing, transferring, and disclosure of your child's personal information in accordance with this rule."}
{"task": "rw_71.jsonl", "id": 61993, "text": "This rule stipulates the way we handle children's information in different scenarios, but only when your child uses or opens related functions or use services, we will process relevant information in order to achieve related functions and services.", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61994, "text": "If your child does not turn on related functions or uses related services, we will not handle your child's corresponding personal information.", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61995, "text": "In addition to these rules, in specific products, we will also explain to you through pop -up windows and page prompts to explain the purpose, scope and usage method of the specific information collection of the product.And have the same effect as this rule.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61996, "text": "Children's special description:", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61997, "text": "We suggest: Any child should obtain the consent of the guardian in advance.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 61998, "text": "If you are a child, please notify your guardian to read this rule together, and seek the consent and guidance of your guardian before you use Netease game services and submit personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "Children are requested to notify the guardian to read this rule together, and use services under the consent and guidance of the guardian to submit personal information."}
{"task": "rw_71.jsonl", "id": 61999, "text": "This rule is suitable for activities such as collecting, using, storage, sharing, transfer, and disclosure of personal information of children through the Internet in the People's Republic of China.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62000, "text": "In terms of personal information protection rules of children, this rule has also played for you and your children at the same time as the \"NetEase Privacy Policy\", \"NetEase Children's Personal Information Protection Rules and Guardian Notes\", \"NetEase Game Privacy Policy\" at the same time.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62001, "text": "For example, the clauses of these rules are inconsistent with the terms of the \"NetEase Privacy Policy\", \"NetEase Children's Personal Information Protection Rules and Guardian Instructions\", and \"NetEase Game Privacy Policy\".It is subject to the \"Netease Privacy Policy\", \"NetEase Children's Personal Information Protection Rules and Guardian Instructions\", and the terms of the text of the \"NetEase Game Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62002, "text": "After reading this rule, if you have any problems with this rule or related matters related to this rule, you can contact us through the feedback channels listed in the chapter listed in the chapter of the \"How to contact us\" in this rule. We will answer as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62003, "text": "This rule will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62004, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62005, "text": "2. How can we share, transfer or disclose personal information of children", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62006, "text": "3. How do we store and protect personal information of children", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62007, "text": "Fourth, how to exercise the right to children's personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62008, "text": "Five, third -party service", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62009, "text": "6. Revision of this rule", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62010, "text": "Seven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62011, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62012, "text": "(1) We will strictly fulfill the obligations and responsibilities of children's personal information protection stipulated in laws and regulations, and follow the principles of legitimate necessity, knowledge consent, clear purpose, security, and use according to law.The", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We follow the principles of legitimate necessity, consent of knowledge, clear purpose, safety guarantee, and use according to law, and collect and use personal information of children after obtaining the consent of the guardian."}
{"task": "rw_71.jsonl", "id": 62013, "text": "1. According to the requirements and regulatory requirements, we need users to fill in the name and valid ID information information for real -name authentication. If it is certified as a child, we will handle personal information in accordance with the provisions of laws and regulations.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "If the user's name and valid identity document information is certified as a child, the personal information will be processed in accordance with the provisions of the laws and regulations."}
{"task": "rw_71.jsonl", "id": 62014, "text": "2. When we identify the user as a child, we will collect the contact information of the guardian (mobile phone number, e -mailbox), and contact the guardian to verify that it has a guardian relationship with the child to help the guardian manage and understand the children's use of NetEase game services to use NetEase game servicesCondition.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "When the user is a child, collect the contact information of the guardian, contact them to verify the monitoring relationship and help the guardian manage and understand the situation of children's use of NetEase game services."}
{"task": "rw_71.jsonl", "id": 62015, "text": "In order to better protect the rights and interests of children, we can collect this information to the guardian's name, ID card, account book, birth certificate, or other monitoring relationships to the guardian in specific circumstances in order to further verify the guardian relationship between the guardian and children.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Seeing the species, the name, identity card, household registration, birth certificate, or other monitoring relationships are collected to the guardian to further verify the supervision relationship."}
{"task": "rw_71.jsonl", "id": 62016, "text": "3. In the process of using NetEase game services for children, we will also collect and use personal information of other children, including acquiring and using personal information through cookies or similar technologies.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "During the use of NetEase games services, it will collect and use personal information of other children."}
{"task": "rw_71.jsonl", "id": 62017, "text": "For details of the personal information of children collected and used in the process of children's use of NetEase game services, please check the \"Netease Game Privacy Policy\" in detail.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "For details of the personal information of children's personal information, please check the \"NetEase Game Privacy Policy\" for understanding."}
{"task": "rw_71.jsonl", "id": 62018, "text": "If we need to collect and use the personal information of the children, we will once again obtain the consent of the guardian.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If we have collected and used the personal information of children, we will once again obtain the consent of the guardian."}
{"task": "rw_71.jsonl", "id": 62019, "text": "(2) Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62020, "text": "According to relevant laws and regulations, the information of children's information in the following situations does not need to obtain the authorization consent of children and/or guardians:", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "According to relevant laws and regulations, the information of children's information in the following situations does not need to obtain the authorization consent of children and/or guardians:"}
{"task": "rw_71.jsonl", "id": 62021, "text": "(1) It is necessary for the contract to establish and fulfill your contract as one party;", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_71.jsonl", "id": 62022, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_71.jsonl", "id": 62023, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property security of you or others;", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_71.jsonl", "id": 62024, "text": "(4) Implement news reports and public opinion supervision for public interests, and collect your personal information within a reasonable range;", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_71.jsonl", "id": 62025, "text": "(5) Collect your own personal information within a reasonable range or other legal disclosure;", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Collect your own personal information that you openly or other legal disclosure within a reasonable scope without requiring the consent of authorization."}
{"task": "rw_71.jsonl", "id": 62026, "text": "(6) Other circumstances stipulated in laws and administrative regulations.", "label": ["Data Retention", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_71.jsonl", "id": 62027, "text": "(3) Tips on sensitive personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62028, "text": "Children's personal information is sensitive personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "Children's personal information is sensitive personal information."}
{"task": "rw_71.jsonl", "id": 62029, "text": "In addition to the laws that are clearly stipulated that they can not solicit the consent of children and guardians, before collecting personal information of children, we will inform children and guardians' clear purposes and necessity, as well as the impact on personal rights and interests, and obtain the consent of the guardian alone.If the guardian does not agree, we will not collect it.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "Before collecting the personal information of children, the clear purpose and necessity of children and guardians will be informed of children and guardians, as well as the impact on personal rights and interests, and obtain a separate consent of the guardian."}
{"task": "rw_71.jsonl", "id": 62030, "text": "2. How can we share, transfer or disclose personal information of children", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62031, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62032, "text": "Without the consent of the guardian, we will not provide personal information of children with any third party other than Netease Group, but in the following scene, we will ask the guardian's authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Without the consent of the guardian, we will not provide personal information of children with any third party other than Netease Group."}
{"task": "rw_71.jsonl", "id": 62033, "text": "1. Realize the purpose of the first part of this rule, \"How can we collect and use the personal information of children\" and provide our services to children.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62034, "text": "We share the information of children from partners and other third parties to achieve the functions of NetEase game services and allow children to use the services required normally, including: payment institutions that provide payment services, merchants who settle in the NetEase platform, and provide data services.Partners, third -party logistics companies and other service providers of online advertising monitoring, data statistics, data analysis);", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "We share the information of children from third parties to achieve the function of NetEase game services and let children use services normally."}
{"task": "rw_71.jsonl", "id": 62035, "text": "Specifically, the services and functions set by specific games shall prevail.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62036, "text": "2. Need to share with related parties.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62037, "text": "In order to facilitate our unified account system to provide children with consistent services and facilitate its unified management, personalized recommendation, guarantee system and account security, children's personal information will be necessary to share between the related parties of the NetEase Group.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "Children's personal information will conduct necessary sharing between the related parties of the NetEase Group in order to provide consistent services, unified management, personalized recommendation, guarantee system and account security."}
{"task": "rw_71.jsonl", "id": 62038, "text": "We will only share their personal information for children for the purpose of legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62039, "text": "We will conduct security assessments for companies, organizations and individuals who share personal information with us and sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, this rule, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "We will conduct a security assessment of the partners and sign the confidentiality agreement with them to process information in accordance with the instructions, this rule, and other confidentiality and security measures."}
{"task": "rw_71.jsonl", "id": 62040, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62041, "text": "When we have a merger, acquisition, asset transfer, separation, dissolution, declaration of bankruptcy or similar situations, if children's personal information needs to be transferred, we will inform you the relevant situation and inform the receiver's name and contact informationAnd will require the new receiver to continue to protect your personal information in accordance with laws and regulations and not lower than the requirements of this policy.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "When involving mergers, acquisitions, or bankruptcy liquidation, if the transfer of personal information involved in children will be informed of the relevant situation and will continue to protect or request new processors in accordance with the laws and regulations and the standards required by the guidelines.personal information."}
{"task": "rw_71.jsonl", "id": 62042, "text": "(3) Public public", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62043, "text": "We will only disclose their personal information only under the following circumstances and adopt the premise of the industry standards that meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We will only disclose their personal information only under the following circumstances and adopt the premise of the industry standards that meet the industry standards:"}
{"task": "rw_71.jsonl", "id": 62044, "text": "1. According to the needs of children or guardians, disclose the information it specified under the public approval of the guardian;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "According to the needs of children or guardians, the information specified by the guardian's consent is disclosed."}
{"task": "rw_71.jsonl", "id": 62045, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide children's information, we may disclose children's information according to the type and open way.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements that must provide children's information, we may disclose children's information according to the type and public way of information required."}
{"task": "rw_71.jsonl", "id": 62046, "text": "Under the premise of compliance with laws and regulations, when we receive the request of the above -mentioned public information, we will ask the receiver to issue corresponding legal documents, including a subpoena or an investigation letter.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "When we receive a request for public information, we ask the receiver to issue the corresponding legal documents, including the subpoena or the investigation letter."}
{"task": "rw_71.jsonl", "id": 62047, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62048, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": ["Data Security", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62049, "text": "According to the law, the personal information of the child who shared, transferred, and disclosed the anonymous processing, that is, to ensure that the individual information receiver of the child cannot restore and re -identify the information of the information, it does not belong to the child's personal information. The preservation and processing of such information will not requireWalk separately to the guardian and obtain the consent of the guardian.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62050, "text": "3. How do we store and protect personal information of children", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62051, "text": "(1) In addition to the laws and regulations or regulatory authorities, we only store personal information of children in the purpose of the purpose of this rule and within the shortest time limit.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "Generally, children's personal information is preserved within the period required for the service purpose, unless the law has other requirements."}
{"task": "rw_71.jsonl", "id": 62052, "text": "If we terminate our services or operations, we will stop the activities of children's personal information in a timely manner. At the same time, we will comply with relevant laws and regulations to notify the guardian in advance, and delete or processes children's personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Specific Audiences", "Cessation of Operations", "Important"], "rewrite": "After termination of services or operations, stop information collection activities and notify the guardian in advance, and personal information of children will be deleted or anonymous, except for laws and regulations."}
{"task": "rw_71.jsonl", "id": 62053, "text": "If the guardian applies to cancel the child's account, actively deletes the personal information of the child or exceeds the necessary period, we will delete or anonymous processing of the child's personal information, except for laws and regulations.", "label": ["Data Retention", "Specific Audiences", "Edit/Control", "Important"], "rewrite": "After cancellation of children's accounts, delete personal information of children, or exceed the storage period, children's personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_71.jsonl", "id": 62054, "text": "(2) We attach great importance to children's privacy and safety, set up a special security team, and take all reasonable and feasible measures to protect personal information:", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Established a special security team and took measures to protect personal information of children."}
{"task": "rw_71.jsonl", "id": 62055, "text": "We will adopt encryption and related technical measures to store personal information of children to ensure information security.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Use encryption and related technical measures to store personal information."}
{"task": "rw_71.jsonl", "id": 62056, "text": "At the same time, we strictly set information access permissions to the staff with the principle of minimum authorization, and control the scope of the personal information of children;", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Based on the principle of minimum authorization, strictly set information access permissions to control the scope of the knowledge of personal information."}
{"task": "rw_71.jsonl", "id": 62057, "text": "If a staff member visits the personal information of children, the person in charge of the child's personal information protection or the authorized managers must be approved to record the visits, and take technical measures to avoid illegal copying and downloading personal information of children.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "The person in charge of the child's personal information protection or its authorized managers must be approved to access it, and the access situation is recorded, and technical measures are taken to avoid illegal copying and downloading personal information of children."}
{"task": "rw_71.jsonl", "id": 62058, "text": "If we find that children's personal information may occur or may occur, tampered with, or lost, the emergency plan will be initiated immediately, remedial measures, and the relevant situation of the incident shall be informed by the email, letter, telephone, push notification, and announcement.And children.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will start emergency plans to respond to information security incidents, and to inform you of the relevant situation by mail, letter, telephone, push notification, etc."}
{"task": "rw_71.jsonl", "id": 62059, "text": "If you want to learn more, please check the relevant chapters of \"NetEase Privacy Policy\" and \"NetEase Game Privacy Policy\" \"How do we store and protect your personal information\" and learn more about how we store and protect personal information of children.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62060, "text": "Due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that information is 100 % security.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_71.jsonl", "id": 62061, "text": "The guardian needs to understand that the system and communication network used by children's access to NetEase game services may occur due to the situation outside the control scope.", "label": ["Data Security", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62062, "text": "The guardians and children are requested to properly keep the NetEase game service account, password and other identity elements.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Please protect your personal information properly."}
{"task": "rw_71.jsonl", "id": 62063, "text": "When children use Netease game services, we will identify their identities through account numbers, passwords and other identity elements.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "When children use Netease game services, they will identify their identities through account numbers, passwords and other identity elements."}
{"task": "rw_71.jsonl", "id": 62064, "text": "Once the guardian and children leak the aforementioned information, they may suffer losses and may adversely affect themselves.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62065, "text": "If the guardian and children find accounts, passwords and/or other identity elements may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If the personal information discovered, please contact our customer service immediately."}
{"task": "rw_71.jsonl", "id": 62066, "text": "(3) NetEase Games has always attached great importance to and protecting the physical and mental health of minors, especially children, and adopted relevant technical measures to prevent minors from being obsessed with online games, especially children.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62067, "text": "In the process of taking related technical measures, we will collect and use personal information of children. We will take strict protection measures to ensure the security of children's personal information.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62068, "text": "For the relevant content of the protection of minors, please refer to the chapter of the \"Minor Protection\" chapter of \"NetEase Game Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62069, "text": "Fourth, how to exercise the right to children's personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62070, "text": "During the use of Netease game services for children, the guardian and children if they want to inquire, copy, correct, supplement, transfer, delete their personal information, and cancel children's registration accounts.\"User Personal Information Service Platform\" or according to this rule, contact the contact information listed in the \"How to contact us\" chapter, contact us to handle.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "The guardian and children can set up operation query, replication, correction, supplement, transfer, deleting personal information of children, and cancel the child registration account, or contact us to deal with it according to the specific game product, or contact us to deal with it."}
{"task": "rw_71.jsonl", "id": 62071, "text": "When querying, copying, correcting, replenishing, transferring, deleting the aforementioned information or applying for a cancellation account, we require the guardian and/or children to verify the identity to ensure information security according to the specific situation to ensure information security.", "label": ["Specific Audiences", "Edit/Control", "Data Security", "Important"], "rewrite": "When querying, copying, correcting, replenishing, transferring, deleting personal information or applying for canceling accounts, we will ask the guardian and/or children to verify the identity."}
{"task": "rw_71.jsonl", "id": 62072, "text": "Except for other provisions of laws and regulations, when the guardian and children correct, supplement, transfer, delete their personal information, or apply for a cancellation account, we may not immediately correct or delete the corresponding information from the backup system, but we will immediately stop processing related related related related informationThe information will be more correct or deleted or anonymously processing this information when the backup is updated.", "label": ["Specific Audiences", "Edit/Control", "Risk", "Important"], "rewrite": "When corrected, supplemented, transfer, delete the personal information of children or apply for cancellation accounts, immediately stop processing relevant information and will be more correct or deleted or anonymous to process these information when the backup is updated."}
{"task": "rw_71.jsonl", "id": 62073, "text": "(1) Query and copy the personal information of children", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62074, "text": "The guardian and children can view and copy the personal information provided or generated by them provided or generated in the use of NetEase game services, including personal information, partial use records, and publishing content.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "The guardian and children can view and copy the personal information provided or generated in the use of game services."}
{"task": "rw_71.jsonl", "id": 62075, "text": "(2) Correction and replenishment of personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62076, "text": "We encourage guardians and children to update and modify their personal information for children to make them more accurate and effective.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "Encourage guardians and children to update and modify their personal information for children to make them more accurate and effective."}
{"task": "rw_71.jsonl", "id": 62077, "text": "If the guardian and children find that the personal information of the children we collect, use and handle is incorrect or incomplete, we can contact us to correct or supplement.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If the guardian and children find that the collection, use, and processing of personal information of children can contact us to correct or supplement."}
{"task": "rw_71.jsonl", "id": 62078, "text": "We will take timely measures to correct or supplement after completing the problems of identity verification and verification.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "After completing the problem of authentication and verification, personal information will be corrected or supplemented."}
{"task": "rw_71.jsonl", "id": 62079, "text": "(3) Transfer and delete children's personal information", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62080, "text": "In the case of requesting the conditions stipulated by the national network information department, we will provide the guardian with information transfer.", "label": ["Specific Audiences", "Edit/Control", "Important"], "rewrite": "In the case of requesting the conditions stipulated by the national network information department, we will provide the guardian with information transfer."}
{"task": "rw_71.jsonl", "id": 62081, "text": "According to the specific situation of Children's choice of NetEase game services, the guardian and children can delete some of the children's personal information in the use of NetEase game services.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "The guardian and children can delete some personal information in the use of NetEase game services."}
{"task": "rw_71.jsonl", "id": 62082, "text": "In the following circumstances, the guardian and children can directly make a request to delete the personal information of children. We will take measures in time after completing the identity verification and verification issues to delete it, including:", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "In the following circumstances, the guardian and children can make a request to delete the personal information of children: (1) the behavior of our handling personal information violates laws and regulations or agreed;(4) The guardian or children terminate the use of NetEase game services by canceling and related methods."}
{"task": "rw_71.jsonl", "id": 62083, "text": "1. We violate the provisions of laws and regulations or collect, store, use, transfer, and disclose personal information of children's personal information with the guardian and children;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62084, "text": "2. The scope of the purpose or the necessary period of collection, storage, use, transfer, and disclosure of personal information of children;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62085, "text": "3. The guardian withdrew the consent;", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62086, "text": "4. The guardian or children terminate the use of NetEase game services by canceling and related methods.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62087, "text": "However, please note that if the guardian and children delete or request us to delete specific children's personal information, it will cause it to not continue to use all or part of NetEase game services.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62088, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62089, "text": "In the case of compliance with relevant laws and regulations, we also provide the cancellation of the registered account. The guardian and children can log in to the guidance of the \"NetEase User Personal Information Service Platform\" for operation or contact us to deal with it.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "The guardian and children can log in to the \"NetEase User Personal Information Service Platform\" to guide the cancellation account or contact us to deal with it."}
{"task": "rw_71.jsonl", "id": 62090, "text": "Once the relevant information is deleted or the account is canceled, it will not be recovered. Please operate carefully.", "label": ["Specific Audiences", "Edit/Control", "Important"], "rewrite": "Once the information is deleted or the account is canceled, it will not be recovered."}
{"task": "rw_71.jsonl", "id": 62091, "text": "(5) The scope of change of authorization consent", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62092, "text": "The guardian and children can always choose whether to disclose information.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "Guardian and children can choose whether to disclose information."}
{"task": "rw_71.jsonl", "id": 62093, "text": "Some information is necessary to use Netease game services, but most other information is determined by itself.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62094, "text": "The guardian and children can change our authorization to continue collecting information or withdrawing its authorization by deleting information, closing the equipment function and related methods.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "The guardian and children can change the scope of authorization by deleting information, closing the equipment functions and related methods or withdrawing its authorization."}
{"task": "rw_71.jsonl", "id": 62095, "text": "When the guardian and children withdraw authorization, we cannot continue to provide the service corresponding to the withdrawal of the authorization, and we will no longer process the corresponding information.", "label": ["Specific Audiences", "Edit/Control", "Important"], "rewrite": "When the guardian and children withdraw authorization, they will not be able to provide corresponding services and no longer processing the corresponding information."}
{"task": "rw_71.jsonl", "id": 62096, "text": "But the decision to withdraw authorization will not affect information processing carried out based on the authorization of guardians and children.", "label": ["Specific Audiences", "Edit/Control", "Risk", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_71.jsonl", "id": 62097, "text": "Five, third -party service", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62098, "text": "Netease Game Service for children's access or links to social media or other services provided by children (including websites or other services).", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62099, "text": "Please refer to the chapter of \"How Do We Share, Transfer or Disclosure of your personal information\", and learn more about the types of third -party services we access or link in detail.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62100, "text": "These third -party social media or other services are operated by related third parties.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62101, "text": "Children using such third -party social media services or other services (including any information provided by children to these third parties) must be subject to the third party's own service terms and information protection statements (not these rules).Need to read its clause carefully.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62102, "text": "This rule is only applicable to the personal information we collected, and it does not apply to the service provided by any third party or the information usage rules provided by third parties.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62103, "text": "If the guardian and children find that these third -party social media or other services are risky, it is recommended to terminate the relevant operations to protect the legitimate rights and interests of children and contact us in a timely manner.", "label": ["Important"], "rewrite": "When the guardian and children find that the access to third -party social media or other services is risky, it is recommended to terminate the operation and contact us."}
{"task": "rw_71.jsonl", "id": 62104, "text": "6. Revision of this rule", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62105, "text": "In order to provide better services, we will modify the terms of this rule in a timely manner according to the update of NetEase's game service and the relevant requirements of laws and regulations, which constitute a part of the rules of the cost.", "label": ["Specific Audiences", "Policy Change"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62106, "text": "If such updates have caused the essential reduction or major changes of the rights of the guardian and children under this rule, we will notify the guardian through the website announcement, push notification, pop -up window prompts, or other methods before this rule takes effect. If the guardian does not agree with such changesYou can choose to ask for children to stop using NetEase game services.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "We will notify the change of privacy policy through the website announcement, push notification, pop -up window prompts, or other methods before this rule takes effect."}
{"task": "rw_71.jsonl", "id": 62107, "text": "Any of our modifications will put the user's satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62108, "text": "We encourage guardians and children to consider our \"NetEase Game Children's Personal Information Protection Rules and Guardian Notes\" every time they use Netease Games services.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62109, "text": "Seven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62110, "text": "We have the full -time department of personal information protection and designated the person in charge of specialized child personal information protection, and will protect their personal information strictly in accordance with the rules.", "label": ["Specific Audiences", "Contact Information"], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62111, "text": "If the guardian and children have any questions, opinions or suggestions on the complaints and reports of network information security, or have any issues, opinions or suggestions on this rule and NetEase's personal information protection rules and measures, please contact us at any time to send emails to NEPRIVACY@Service.netease.com or write to the following address: No. 399 NetEase No. 399, NetEase No. 399, Binjiang District, Hangzhou, Personal Information Protection Commissioner (receivable);", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "Email: NEPRIVACY@Service.netease.com; Correspondence address: Personal Information Protection Specialist (received) for Children's Personal Information Protection (receipt)."}
{"task": "rw_71.jsonl", "id": 62112, "text": "Postcode: 310052.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "Postcode: 310052."}
{"task": "rw_71.jsonl", "id": 62113, "text": "Under normal circumstances, we will reply within 15 working days after receiving problems, opinions or suggestions, and verify that the guardian and/or children's identity will be replied.", "label": ["Specific Audiences", "Important", "Contact Information"], "rewrite": "We will reply within fifteen working days after receiving problems, opinions or suggestions, and verify that the guardian and/or children's identity will be replied."}
{"task": "rw_71.jsonl", "id": 62114, "text": "If the guardian or child is not satisfied with our reply, it can also complain to the consumer rights protection department or filed a lawsuit with the courts with jurisdictions.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62115, "text": "The provider of NetEase Game Services includes Hangzhou NetEase Leihuo Technology Co., Ltd. (Registration Address: Room 702, Building 4, Fang Shang, Changhe Street, Changhe Street, Binjiang District, Hangzhou), and Guangzhou Netease Computer System Co., Ltd. (Registration address: Tianhe District, Tianhe District, GuangzhouRoad No. 5 self-edited A2, Unit 01, 2nd Floor) and Shanghai Net Yifeu World Network Technology Co., Ltd. (Registration Address: No. 315, No. 315, Fenggu Road, Xuhui District, Shanghai)Service providers are subject to the game's explanation.", "label": [], "rewrite": []}
{"task": "rw_71.jsonl", "id": 62116, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
