{"task": "rw_86.jsonl", "id": 66262, "text": "Watermelon video privacy policy", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66263, "text": "Update date: March 31, 2022", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66264, "text": "Effective date: April 7, 2022", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66265, "text": "\"Watermelon Video\" refers to the client application that is legally owned and operated by the Beijing Bittage beating Technology Co., Ltd. (now Beijing Douyin Information Service Co., Ltd.) and its related parties (hereinafter referred to as \"we\").Programs (also containing different versions such as watermelon video horizontal screens), \"watermelon video\" websites (ixigua.com), and Internet TV provided content services (including but not limited to \"watermelon video\" and Internet TV broadcast control integration institutionsPlatforms that cooperate with Internet TV content brand licenses and platforms that cooperate with smart TV manufacturers) and related clients (including but not limited to APP, APK, SDK, API and other methods).", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66266, "text": "As operators of watermelon videos, we know the importance of personal information to you. Your trust is very important to us. We will protect your personal information and privacy security in accordance with the provisions of laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66267, "text": "We formulate this \"privacy policy\" and special reminders: I hope you can read and understand the privacy policy carefully before using watermelon videos and related services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66268, "text": "This privacy policy will help you understand:", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66269, "text": "We will follow your information to collect and use your information, but we will not collect personal information in a package of compulsory binding because you agree with your consent of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66270, "text": "When you use or open related functions or use services, we will collect and use relevant information for the implementation of functions and services.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66271, "text": "Unless it is necessary to achieve business functions, or the necessary information necessary for laws and regulations, or if we can collect information according to law without obtaining information you authorize, you can refuse to provide and not affect other functions or services.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66272, "text": "We will explain the information we want to collect in the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66273, "text": "If you only want to use the basic function provided by you with watermelon video, you can enter the basic function mode through the [Personal Information Protection Guidelines] through the Watermelon Video APP, or [Mine] - [Settings] - [[Settings] - [Basic function mode] Open or close the basic functional mode.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66274, "text": "If you do not log in to the account, we will ensure the basic functions of information push through the identifier information corresponding to the device.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66275, "text": "If you log in to your account, we will push information according to account information.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66276, "text": "In order to achieve business functions or necessary in accordance with the requirements of laws and regulations, we will collect and use your sensitive personal information when you use specific functions or services. For specific collection of scenes, purposes, and scope, please see the sensitive personal information list.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and use sensitive personal information when using specific functions or services. For specific collection of scenes, purposes, and scope, please see the sensitive personal information list."}
{"task": "rw_86.jsonl", "id": 66277, "text": "Accurate geographical location, camera (camera), microphone, album (storage), and calendar permissions will not be opened by default. Only by your explicit authorization can you use it when you implement specific functions or services, and you can also withdraw authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Accurate geographical location, camera (camera), microphone, album (storage), and calendar permissions will not be opened by default. Only by explicitly authorization will it be used when realizing specific functions, or the authorization can be withdrawn."}
{"task": "rw_86.jsonl", "id": 66278, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important", "Data Security"], "rewrite": "Even after authorization, these sensitive permissions are obtained, and you will not collect your information at the time of related functions or services."}
{"task": "rw_86.jsonl", "id": 66279, "text": "Application permission application and usage description", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66280, "text": "Unless otherwise explained, this privacy policy is suitable for watermelon video service providers with watermelon video (including watermelon video, watermelon video horizontal screen version, and follow -up series versions we provide and clearly apply for this privacy policy)Watermelon video software development tool packages (SDK) and application programming interface (API) used by small programs, third -party websites and applications, and products and services provided by you with innovative forms with the development of technology.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66281, "text": "If you use a certain or more service provided by us or related companies to you, if you have a separate privacy policy, the corresponding service or the corresponding privacy policy is applicable;", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66282, "text": "If a separate privacy policy is not established, this policy is also applicable to this part of the product or service.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66283, "text": "The following will help you understand how we collect, use, store, transfer (as applicable) and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66284, "text": "Help you understand the way to check, copy, correct, delete, and withdraw authorization of personal information.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66285, "text": "This policy is closely related to your service relationship. We recommend that you read and understand all the contents of this policy, make a proper choice you think, and the important content of your personal information rights and interests.Essence", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66286, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66287, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66288, "text": "3. Partners involved in the data use process, transfer, and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66289, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66290, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66291, "text": "6. Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66292, "text": "7. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66293, "text": "8. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66294, "text": "9. Consultation and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66295, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66296, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66297, "text": "We will collect the information you actively provided when using the service, and collect the information you generated during the use of function or accepting service through automation:", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the active provided by you when using the service as follows, and collect information through automatic means:"}
{"task": "rw_86.jsonl", "id": 66298, "text": "1.1 Registration, login, certification, recovery", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66299, "text": "1.1.1 Registration, login", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66300, "text": "a. When you register, log in to watermelon videos and related services, you can create an account through your mobile phone number, and you can improve the relevant network identification information (avatar, nickname, password), collect this information to help you complete the registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can create an account with your mobile phone number, and you can improve the relevant network identification information (avatar, nickname, password)."}
{"task": "rw_86.jsonl", "id": 66301, "text": "Mobile phone numbers are necessary information to fulfill the requirements of national laws and regulations on the requirements of the online real -name system. If you do not provide mobile phone numbers for registration and login, we may not be able to provide you with functions such as information release and comments.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide mobile phone numbers for registration and login, we may not be able to provide you with functions such as information release and comments."}
{"task": "rw_86.jsonl", "id": 66302, "text": "After you register and log in, you can fill in your personal information (introduction, background map) to improve your information. We will collect your personal information that you actively fill in to show other users and provide you with recommendation.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect your personal information that you are filled in for other users and provide recommended content."}
{"task": "rw_86.jsonl", "id": 66303, "text": "b. Based on our cooperation with communication operators, when you use watermelon video \"one -click login\" function, after your consent, we will process your mobile phone number with the operator to provide you with a fast login service.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66304, "text": "If the above processing is refused, you will not be able to register the watermelon video in the \"one -click login\" method, but it will not affect your registered login in other ways, nor does it affect the normal use of other functions.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66305, "text": "c. You can also use a third -party account to log in and use watermelon videos. After your consent, we will obtain the public information (avatar, nickname, and other information you authorized) registered on the third -party platform for watermelon video accountBinding, so that you can log in and use this product and related services directly.", "label": ["Important", "First Party Collection Information"], "rewrite": "After consent, the public information registered by a third -party platform (avatar, nickname, and other information you authorized) will be obtained for binding with watermelon video accounts."}
{"task": "rw_86.jsonl", "id": 66306, "text": "d. When you log in to a third -party application with a watermelon video account, after your consent, third -party applications will use your nickname, avatar and other information you authorize.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66307, "text": "e. In order to ensure that in different products provide you with consistent services, affiliate products with corresponding connections with the function provides services through the service platform system.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66308, "text": "Within the service scope of the platform system, we will collect and process your personal information with the above -mentioned affiliate products, and create a unified digital logo in different products for the mobile phone number you registered to use to achieve the functionConsistency.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and process your personal information with the above -mentioned affiliate products."}
{"task": "rw_86.jsonl", "id": 66309, "text": "Understand the unified service platform system", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66310, "text": "1.1.2 certification", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66311, "text": "When you use your identity authentication function or related services, according to relevant laws and regulations, we may collect your real identity information (real name, ID number, phone number, face information, etc.) to complete the verification.Based on security considerations, in order to ensure that we provide services for you, we may verify your identity through \"face recognition\" according to the information you provide.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your real identity information (real name, ID number, phone number, face information, etc.) to complete the verification."}
{"task": "rw_86.jsonl", "id": 66312, "text": "These parts of information are personal sensitive information. You can refuse to provide it. If you refuse to provide you, you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide identity authentication information may not be able to obtain related services, but does not affect the normal use of other functions and services."}
{"task": "rw_86.jsonl", "id": 66313, "text": "1.1.3 Account Retain", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66314, "text": "You can retrieve your account by retrieve your account function. To ensure the security of your account, when retrieved the account, we may need you to fill in the relevant information for verification.Verify your identity.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66315, "text": "1.2 Play browse", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66316, "text": "a. In order to ensure the quality of the recommended content and recommend videos and related information that may be more interested in you, watermelon videos may collect the necessary log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Watermelon videos may collect necessary log information."}
{"task": "rw_86.jsonl", "id": 66317, "text": "b. The above log information includes:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66318, "text": "The behavior information you operate and use: click, follow, collect, search, browse, download, share", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect operations and use behavior information: click, follow, collect, search, browse, download, share."}
{"task": "rw_86.jsonl", "id": 66319, "text": "The information you actively provide: feedback, release, likes, comments", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect active information: feedback, release, like, comment."}
{"task": "rw_86.jsonl", "id": 66320, "text": "Geographical location information: Including accurate positioning information obtained by sensor information such as through GPS sensors, WLAN access points, Bluetooth, and base stations, as well as general geographical location information obtained through network location information (such as base stations, IP, and WLAN)", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect geographical location information."}
{"task": "rw_86.jsonl", "id": 66321, "text": "c. Accurate positioning information is sensitive personal information. If you refuse to provide it, we will not recommend information to you according to the precise positioning information, but it will not affect the normal use of other functions of watermelon video.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide accurate positioning information, you will not recommend information to you, but it will not affect the normal use of other functions of watermelon video."}
{"task": "rw_86.jsonl", "id": 66322, "text": "d. We will show you the local related information of your area (city, district, county, etc.) based on the cities and/or counties corresponding to the general geographical location information.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66323, "text": "e. When you play videos and other content, in order to adapt to your device status, we will call the device's gravity, acceleration and other sensors to identify your device horizontal and vertical screen status.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66324, "text": "f. When analyzing data, we will identify the information collected and used by the above. The data analysis only corresponds to a specific, unable to directly associate your identity, and will not be associated with your true identity.", "label": ["Important", "Data Security"], "rewrite": "The information collected and used by the above, data analysis will not be associated with your true identity."}
{"task": "rw_86.jsonl", "id": 66325, "text": "g. If you only want to use the basic functions provided by you with watermelon videos, including a certain period of video viewing and search function, you can enter the basic function mode through the [Personal Information Protection Guide] pop -up window of the Watermelon Video APP, or through the Watermelon Video APP[Mine],-, [Settings],-, [Basic Functional Mode] open or close the basic functional mode.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the basic functional mode through the [Personal Information Protection Guide] of the Watermelon Video APP, or open or close the basic functional mode through the [Settings] - [Basic Functional Mode] through the Watermelon Video APP."}
{"task": "rw_86.jsonl", "id": 66326, "text": "Under the \"basic function mode\", watermelon videos are only to ensure the safe operation of software and services. Collect your personal information in accordance with the relevant provisions of laws and regulations, and do not collect other personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Under the \"basic function model\", personal information is collected in accordance with the relevant provisions of laws and regulations, and other personal information is not collected."}
{"task": "rw_86.jsonl", "id": 66327, "text": "Friends recommendation, information release, interactive communication, comprehensive search, activities participation, and other rich and diverse services. The activity rewards (including but not limited to watching red envelope rewards and other activities before entering the \"basic function mode\" will also be available.Stop calculation, but you can continue to participate in the event or receive the rewards that have been obtained after exiting the \"basic function mode\".", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to ensure the minimum necessary collection of your personal information, you can only use our products or services under the browsing mode (that is, the state of not logging in)."}
{"task": "rw_86.jsonl", "id": 66328, "text": "1.3 Release and interaction", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66329, "text": "1.3.1 Information release", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66330, "text": "a. When you publish audio and video, pictures, etc., we will collect the information you posted and show your nickname, avatar, publishing content and information.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect the information you posted and show your nickname, avatar, publishing content and information."}
{"task": "rw_86.jsonl", "id": 66331, "text": "b. When you publish pictures and audio and video functions, we will ask you to authorize the camera, album (storage space), photos, and microphone permission.", "label": ["Permission Acquisition", "Important"], "rewrite": "Ask you to authorize the camera, album (storage space), photos, microphone permission."}
{"task": "rw_86.jsonl", "id": 66332, "text": "If you refuse to provide authorization, you will not be able to use this function, but it will not affect other functions of using watermelon videos normally.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide cameras, albums (storage space), photos, and microphones, you will not be able to use this function, but it will not affect your normal use of other functions."}
{"task": "rw_86.jsonl", "id": 66333, "text": "c. When you publish dynamic information and choose to add positions, we will ask you to authorize geographical location permissions and collect geographical location information related to this service.", "label": ["Permission Acquisition", "Important"], "rewrite": "Will ask you to authorize geographical location permissions and collect geographical location information related to this service."}
{"task": "rw_86.jsonl", "id": 66334, "text": "If you refuse to authorize to provide accurate positioning information, you will not be able to use this function, but it will not affect other functions of your normal use of watermelon videos.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide accurate positioning information, this function will not be used, but it will not affect other functions of using watermelon videos normally."}
{"task": "rw_86.jsonl", "id": 66335, "text": "d. Note that your public information may involve personal information of users or others. If the information you posted publicly contains personal information of others, you must ensure that it is allowed to be used or already allowed by laws and regulations before uploading and publishing.Get legal authorization.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the published information contains personal information of others, you must ensure that you are allowed or have been legally authorized to be allowed by laws and regulations before uploading."}
{"task": "rw_86.jsonl", "id": 66336, "text": "e. When you use the functions of opening live broadcast, according to laws and regulations and security requirements, you may need to conduct real -name authentication through \"face recognition\" to verify your identity.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66337, "text": "In the process of real -name authentication, we and third -party certification agencies providing certification services need you to provide real names, ID numbers and face information.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66338, "text": "This information is personal sensitive information. You can refuse to provide it without affecting the normal use of other functions of watermelon video.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66339, "text": "This information is only used for real -name authentication or other purposes stipulated in laws and regulations. It will not be used as other purposes without the authorization of you.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66340, "text": "f. Users that users are collected by our products or services can contain some of your information in the information published by other users (such as: comments, messages, release graphics, audio and video related toInformation).", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66341, "text": "g. We attach great importance to the user's experience. In order to improve the upload speed of audio and video, enrich the release function and optimization experience, when you publish audio and video, before clicking \"Publish\" to confirm upload, we may temporarily load the audio and video loading temporarilyTo the server.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66342, "text": "If you cancel or upload it for other reasons, we will immediately delete related audio and videos.", "label": ["Important", "Data Security"], "rewrite": "If you cancel or upload it for other reasons, we will immediately delete related audio and videos."}
{"task": "rw_86.jsonl", "id": 66343, "text": "Please rest assured that the content of pre -uploading in the cloud will be imposed on the storage, and no one has the right to illegally access, view, obtain, use, and disclosure.", "label": ["Important", "Data Security"], "rewrite": "The content of pre -uploading in the cloud will be imposed, and no one has the right to access, view, obtain, use, and disclosure."}
{"task": "rw_86.jsonl", "id": 66344, "text": "h. When you use watermelon videos and the props, special effects, filters, stickers and other tools it provided to shoot and publish content, we will use sensors based on your operation and tool types usedAdapt to tools to be selected.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66345, "text": "We may also use functions such as props, special effects, filters, stickers and other functions to the client locally for some people's face information for this function to provide better visual effects. In this processExplain and obtain your consent, we will not return or provide your face information to any of your face.", "label": ["Important", "Data Security"], "rewrite": "It may be used to provide props, special effects, filters, stickers and other functions, and use the face information for some people only for this function on the client. Unless there is a clear explanation and obtaining consent, it will not return or provide anyone with anyone to provide anyone with a third party.Face information."}
{"task": "rw_86.jsonl", "id": 66346, "text": "1.3.2 Interactive communication", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66347, "text": "a. When you pay attention to or share your account, or browse, comment, collect, search, like, like or share, we will collect your aforementioned information and display the content published by the corresponding content publisher, or recommend the corresponding content to youannouncer.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you pay attention to or share your account, you will collect your aforementioned information and display the content published by the corresponding content publisher."}
{"task": "rw_86.jsonl", "id": 66348, "text": "b. When you use \"shaking\" and other functions, we will call the device's gravity, acceleration and other sensors to identify whether the device shakes.", "label": ["Permission Acquisition", "Important"], "rewrite": "Call the device's gravity, acceleration and other sensors to identify whether the device shakes."}
{"task": "rw_86.jsonl", "id": 66349, "text": "Please understand that the separate device sensor data does not involve any personal location information and cannot be combined with other information to identify the identity of a specific natural person.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66350, "text": "1.3.3 message notice", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66351, "text": "You know and agree that for your contact information (for example: contact telephone number) provided by you in the process of using the product and/or service, we may send one or more of them in the operation.User news notification, authentication, security verification, user experience research, dispute processing, etc.;", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66352, "text": "In addition, we may also provide you with the use of commercial information such as services, functions or activities that you may be interested in through text messages and telephones that are collected in the aforementioned process, but please rest assured, as you doI hope to accept this information, you can unsubscribe the booking method provided in the mobile phone SMS, or you can contact us directly.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66353, "text": "1.3.4 User feedback and service", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66354, "text": "a. Customer service and questions: In order to facilitate the processing plan and results of related issues that facilitate you, help you solve the problem or record related issues as soon asIn order to prove other information provided by related facts, or the contact information you leave).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your communication/call records and related content (including account information, feedback information, other information provided by the relevant facts, or the contact information you leave)."}
{"task": "rw_86.jsonl", "id": 66355, "text": "b. When you complain about others or are complained by others, in order to protect the legitimate rights and interests of you and others, we may provide your account/identity information, contact information, and relevant content of the complaint to the consumer rights protection department and regulatory authority in order to so as toSolving complaint disputes in a timely manner, except for laws and regulations clearly prohibited.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will provide your account/identity information, contact information, and complaints to the consumer rights protection department and regulatory authority."}
{"task": "rw_86.jsonl", "id": 66356, "text": "c. If you use the watermelon video association and partner service through our products or services, and complain, in orderThe personal information provided by your complaint and synchronize it to the corresponding product/service provider.", "label": ["Important", "First Party Collection Information"], "rewrite": "May get the personal information provided by your complaint from the partner and simultaneously given to the corresponding product/service provider."}
{"task": "rw_86.jsonl", "id": 66357, "text": "d. Questionnaire survey: In order to provide reasonable needs for services and improve service quality, we may also use your other information, including the relevant information you provided when you contact the customer service, and the questionnaire answering information sent to us when you participate in the questionnaire surveyItems", "label": ["Important", "First Party Collection Information"], "rewrite": "May use the relevant information provided by you when you contact the customer service to send the questionnaire reply information to us."}
{"task": "rw_86.jsonl", "id": 66358, "text": "If you don't want to provide this information, you can also refuse to provide participation questionnaires.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you don't want to provide this information, you can also refuse to provide participation questionnaires."}
{"task": "rw_86.jsonl", "id": 66359, "text": "1.4 Search", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66360, "text": "a. When you use the search service of watermelon video, we will collect your search keyword information and log information records for analysis to show you a higher degree of search results.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your search keyword information and log information records for analysis to show a higher degree of search results."}
{"task": "rw_86.jsonl", "id": 66361, "text": "Search results, popular search, and related search may be displayed according to your search/browse, personal homepage information, log information, etc.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66362, "text": "b. The search results include information and third -party website information in the watermelon video site. When you enter a third -party website, your information may be collected by a third -party website.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you enter a third -party website, your information may be collected by a third -party website."}
{"task": "rw_86.jsonl", "id": 66363, "text": "c. In order to provide efficient search services, some of the aforementioned information will be temporarily stored in your local storage device, and you can show you the content of the search results and search history.", "label": ["Data Retention", "Important"], "rewrite": "Some search information will be temporarily stored in the local storage equipment, and show you the content of the search results and the search historical records."}
{"task": "rw_86.jsonl", "id": 66364, "text": "d. We may also record the information you provide, form or reserve when using our service. For exampleAnd the information submitted when you participate in the search operation activities.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you provide, form or reserve when using our service."}
{"task": "rw_86.jsonl", "id": 66365, "text": "You have the right to refuse to provide the above information, but this will cause you to be unable to use specific services or functions, or to achieve the effect that related services intend to achieve.", "label": ["Important", "First Party Collection Information"], "rewrite": "It has the right to refuse to provide service information, but this will cause it to be unable to use specific services or functions, or to achieve relevant effects."}
{"task": "rw_86.jsonl", "id": 66366, "text": "1.5 Appointment", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66367, "text": "When you use live broadcast reminder and event appointment functions, we will obtain your equipment calendar authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will obtain your equipment calendar authority."}
{"task": "rw_86.jsonl", "id": 66368, "text": "After you start the relevant permissions, we will access your calendar to help you make an appointment or adjust the time for the live broadcast and activities that have been made, and remind you.", "label": ["Permission Acquisition", "Important"], "rewrite": "After opening the relevant permissions, we will visit your calendar."}
{"task": "rw_86.jsonl", "id": 66369, "text": "If you refuse to provide it, you will not be able to use the corresponding function, but it will not affect your normal use of watermelon video.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide a calendar authority, you will not use the corresponding functions, but it will not affect the normal use of other functions."}
{"task": "rw_86.jsonl", "id": 66370, "text": "1.6 shot screen", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66371, "text": "When you use the screen screen function of watermelon video, we will obtain the access rights of the local network where your device is located, and collect the device -related information connected to the local network (such as device models, unique device identification codes, etc.), network equipment hardware)Address (MAC address), IP, address, WLAN access point (such as SSID, BSSID), as wellYou refuse to provide it, you will not use screen -related functions and services, but it will not affect your normal use of watermelon video other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the screen function, you will obtain the access permissions of the local network where your device is located, and collect the device -related information connected to the local network (such as device model, unique device identification code, etc.), network device hardware address (MAC address), IP address, WLAN access point (such as SSID, BSSID), as well as operation, use, and service log."}
{"task": "rw_86.jsonl", "id": 66372, "text": "If you are using iOS devices and the system is iOS14 or above, you can open/cancel the access permissions of the local network through your device system at any time.", "label": ["Important", "Edit/Control"], "rewrite": "If you use iOS devices and the system is iOS14 or above, you can open/cancel the access rights of the local network at any time."}
{"task": "rw_86.jsonl", "id": 66373, "text": "At the same time, you can also submit feedback by entering the user feedback interface of our products or services to refuse to provide the above information. The user feedback interface in the Watermelon Video APP is: [My]-[My Customer Service]-[Feedback]Essence", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66374, "text": "1.7 Operation and safe operation/guarantee", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66375, "text": "1.7.1 Operation and Security", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66376, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services and information is our core goal.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66377, "text": "In order to maintain the normal operation of our service and protect the legitimate interests of you or other users or the public from losses, we will collect the necessary information for safe and stable operations to maintain products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect the necessary information for maintaining the safe and stable operation of products or services."}
{"task": "rw_86.jsonl", "id": 66378, "text": "1.7.2 Equipment information and log information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66379, "text": "a. In order to ensure the quality and efficiency of software and services, we will collect your hardware model, operating system version number, equipment identifier (Android, Androidid, OAID, IMSI, ICCID, hardware serial number,Meid, iOS such as IDFV, IDFA;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your hardware model, operating system version number, and device logo (Android, Androidid, OAID, IMSI, ICCID, hardware serial number, Meid, iOS such as IDFV, IDFA."}
{"task": "rw_86.jsonl", "id": 66380, "text": "Different identifiers will be different in the validity period, whether the user can be reset, and the acquisition method), the hardware address (MAC address) of the network equipment (MAC), IP address, and WLAN access point (such as SSID, BSSID), Bluetooth, andBase stations, software version numbers, network access methods, types, status, network quality data, operation, use, service log, sensor information and other data.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66381, "text": "We may associate your equipment information or phone number with your watermelon video account.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66382, "text": "b. In order to prevent malicious procedures, improve operational quality and efficiency, and ensure account security, we will collect the application information and process information that is running, the overall operation of the application, the frequency of use, the application crash, the overall installation and use conditions, Performance data, application sources.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the installation application information or the process information that is running, the overall operation of the application, the usage and frequency, the application crash, the overall installation usage, performance data, and the source of application."}
{"task": "rw_86.jsonl", "id": 66383, "text": "c. We may use your account information, equipment information, service log information, and our related parties and partners to obtain information you can provide or can provide in accordance with the law to determine the status of the account and transaction security, conduct authentication, identify illegal and violations of laws and regulationsSituation, testing and preventing safety incidents, and adopting necessary records, analysis, and disposal measures in accordance with the law.", "label": ["Important", "Usage"], "rewrite": "Use your account information, equipment information, service log information, and our related parties and partners to obtain information you authorize or provide in accordance with the law."}
{"task": "rw_86.jsonl", "id": 66384, "text": "1.8 Share and event participation", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66385, "text": "In the case you share or receive information, participate in activities, etc., we need to access your shear plates and albums, and read the passwords, sharing code, links, QR codes, pictures contained in itShare functions or services such as activities and activities.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to visit your shear plates and albums, and read the passwords, sharing code, links, two -dimensional code, and pictures contained in it to achieve functions or services such as jumping, sharing, and activity linkage."}
{"task": "rw_86.jsonl", "id": 66386, "text": "1.9 Statistics analysis", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66387, "text": "In order to analyze statistical indicators such as new, activation, retention, and performance, we may call the shear plates to analyze the relevant statistical information. Please rest assured that we will not collect your privacy information.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "In order to analyze statistical indicators such as new, activation, retention, and performance, we may call the shear plates to analyze the relevant statistical information."}
{"task": "rw_86.jsonl", "id": 66388, "text": "1.10 collection and use of personal information purpose changes", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66389, "text": "Please understand that with the development of our business, we may adjust the functions of watermelon videos and the services provided.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66390, "text": "In principle, when the new features or services are related to the functions or services we are currently provided, the personal information collected and used will be directly or reasonable to the original processing purpose.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66391, "text": "In the scenario without direct or reasonable to the original processing purpose, we collect and use your personal information, and we will again inform you in accordance with the requirements of laws and regulations and national standards with page prompts, interactive processes, and agreement confirmation.And obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting and using your personal information will inform you separately and obtain your consent."}
{"task": "rw_86.jsonl", "id": 66392, "text": "1.11 Exception of authorization consent", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66393, "text": "Please understand that in the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent in advance:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent in advance:"}
{"task": "rw_86.jsonl", "id": 66394, "text": "a. It is related to the obligations stipulated in our law and regulations;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information related to our obligations stipulated in our laws and regulations, there is no need to solicit consent."}
{"task": "rw_86.jsonl", "id": 66395, "text": "b. Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national security and national defense security does not need to solicit consent."}
{"task": "rw_86.jsonl", "id": 66396, "text": "c. It is directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without soliciting consent."}
{"task": "rw_86.jsonl", "id": 66397, "text": "d. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without asking for consent."}
{"task": "rw_86.jsonl", "id": 66398, "text": "e. Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to obtain my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_86.jsonl", "id": 66399, "text": "f. Personal information that you disclose to the public by yourself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect your personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_86.jsonl", "id": 66400, "text": "g. Your personal information collected from the legal publicly disclosed information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_86.jsonl", "id": 66401, "text": "h. Sign or perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information necessary for signing or performing the contract does not need to solicit consent."}
{"task": "rw_86.jsonl", "id": 66402, "text": "i. It is necessary to maintain the safe and stable operation of software and related services, such as discovering and disposing of software and related services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of maintenance software and related services, there is no need to solicit consent."}
{"task": "rw_86.jsonl", "id": 66403, "text": "j. It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the necessary personal information for legal news reports does not need to ask for consent."}
{"task": "rw_86.jsonl", "id": 66404, "text": "k. When the academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide the results of academic research or description, the personal information contained in the result is to identify", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collection of statistics or the necessary personal information of academic research institutions based on public interests does not need to solicit consent."}
{"task": "rw_86.jsonl", "id": 66405, "text": "l. Other circumstances stipulated in laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66406, "text": "Special reminder you pay attention, if the information cannot be identified alone or in combination with other information, it is not your personal information in the legal sense;", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66407, "text": "When your information can identify your personal identity alone or in combination with other information, or we will not be able to connect with any specific personal information with other personal information combined with other personal information, this information will be used as you during combination.Personal information is handled and protected in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66408, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66409, "text": "Similar technologies such as Cookie and Equipment Information Makes are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66410, "text": "When you use watermelon videos and related services, we may use related technologies to send one or more, cookie, or anonymous identifiers to collect, identify and store your information when you access and use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Send one or more cookies or anonymous identifiers to your device to collect, identify and store information when you access and use this product."}
{"task": "rw_86.jsonl", "id": 66411, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66412, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66413, "text": "2.1 Guarantee of the safety and efficient operation of products and services", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66414, "text": "We may set up Cookie or anonymous identifier that guarantees security and ensure security, so that we can confirm whether you log in to the service safely, or whether you encounter dispersion, fraud and other illegal acts.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66415, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66416, "text": "2.2 Help you get a easier access experience", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66417, "text": "Using this kind of technology can help you save the steps and processes of personal information and enter search content (example: record search and form filling).", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66418, "text": "2.3 Recommend, display, and push the content or account you may be interested in", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66419, "text": "a. We may use Cookie and similar technologies to understand your preferences and use habits, analyze data to improve information or functions that users are interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "Using Cookie and similar technologies to learn about your preferences and use habits, and analyze data."}
{"task": "rw_86.jsonl", "id": 66420, "text": "b. In the sharing page of watermelon videos, we may use cookies to record browse activities to recommend information and check the relevant abnormal conditions of collapse, delayed related services, and explore better service methods.", "label": ["Important", "Usage"], "rewrite": "Use Cookie to record the browsing activities."}
{"task": "rw_86.jsonl", "id": 66421, "text": "2.4 COOKIE Clear", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66422, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66423, "text": "If you clear, you may not be able to use the services or corresponding functions that we depend on Cookie.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66424, "text": "3. Partners involved in the data use process, transfer, and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66425, "text": "3.1 The partner involved in the data use process", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66426, "text": "3.1.1 Principles", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66427, "text": "a. Legal principle: Those who involve data use activities in the process of cooperation with the cooperation party must have a legal purpose and a legal basis for legitimate legitimacy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Anyone who involves data use in the process of cooperation with the partners must abide by the legal principles."}
{"task": "rw_86.jsonl", "id": 66428, "text": "If the partner's use of information is no longer in accordance with the principle of legal, it should no longer use your personal information, or use it after obtaining the corresponding legality basis.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The partner's use of information does not meet the legal principles, and should no longer use your personal information, or use it after obtaining the corresponding legitimate basis."}
{"task": "rw_86.jsonl", "id": 66429, "text": "b. Principles and minimum necessary principles: Data use must have a legitimate purpose, and it should be limited to the purpose of achievement.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "The use of data must have a legitimate purpose, and it should be limited to the purpose of achievement."}
{"task": "rw_86.jsonl", "id": 66430, "text": "c. Principles of security and prudence: We will carefully evaluate the purpose of the partners' use of information, comprehensively evaluate the security guarantee capabilities of these partners, and ask them to follow the legal agreement of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Data sharing needs to meet the principles of security and prudential."}
{"task": "rw_86.jsonl", "id": 66431, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Strict security monitoring of the software tool development package (SDK) and application interface (API) obtained by the partners to protect data security."}
{"task": "rw_86.jsonl", "id": 66432, "text": "Third -party information sharing list", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66433, "text": "Based on the need to implement function, we may use the SDK provided by related parties to process your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "SDK provided by related parties can process your personal information."}
{"task": "rw_86.jsonl", "id": 66434, "text": "3.1.2 Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66435, "text": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will sign the relevant processing agreement with the trustees and cooperates in accordance with the law and supervise the personal information use activities."}
{"task": "rw_86.jsonl", "id": 66436, "text": "3.1.3 Common processing", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66437, "text": "For the scenario of jointly handling personal information, we will sign relevant agreements with the partners in accordance with the law and agreed that their rights and obligations to ensure that in the process of using relevant personal information and protect the security of data and protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign the relevant agreement with the partners in accordance with the law and agreed that their respective rights and obligations will be agreed."}
{"task": "rw_86.jsonl", "id": 66438, "text": "3.1.4 The scope of the partner", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66439, "text": "If the specific functions and scenarios are provided by our affiliates and third parties, the scope of the partner includes our affiliates and third parties.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66440, "text": "3.1.5 Data use of function or service", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66441, "text": "a. When you use the functions provided by our partners in the use of watermelon videos, or when software service providers, smart equipment providers, system service providers are provided with us, we may use it with itThe information necessary for business purposes, comprehensively statistics and formation of indirect crowd portraits to recommend, display or push the information you may be interested in to you, or push more suitable for your specific functions, services or commercial advertisements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "It may be used to achieve comprehensive statistics and form a portrait portrait of indirect crowd."}
{"task": "rw_86.jsonl", "id": 66442, "text": "b. Based on our cooperation with communication operators, when you use watermelon video \"one -click login\" function, after your consent, we will use your mobile phone number with the operator to provide you with a fast login service.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66443, "text": "Rejection of the above use will cause you to register login in watermelon videos through the \"one -click login\" method, but it does not affect your registration and login in other ways, nor does it affect the normal use of other functions.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66444, "text": "c. Login and bind other products: When you log in to the application or service of the related parties or third parties with a watermelon video account, or bind the account with other third -party accounts. After your consent, the above application or service will use it will be used.Your nickname, avatar and other information you authorize.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66445, "text": "d. Mini Program: When you use the applet, without your consent, we will not provide your personal information to these developers and operators.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66446, "text": "When you use a small program, the applet may use the authorized authority authorized, you can withdraw authorization in the applet.", "label": ["Permission Acquisition", "Important"], "rewrite": "The mini -program may use the relevant system authorized by your authorization, and you can withdraw authorization in the applet."}
{"task": "rw_86.jsonl", "id": 66447, "text": "For further understanding, you can check the corresponding privacy policies of related mini -programs and mini games.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66448, "text": "e. When you need to use your authentication function or related services, you may need to complete the real -name authentication according to relevant laws and regulations and security requirements to verify your identity.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66449, "text": "In the process of real -name authentication, the certification service agency that cooperates with us needs to use your real name, ID number, mobile phone number and face information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The certification service agency that cooperates with us needs to use your real name, ID number, mobile phone number and face information."}
{"task": "rw_86.jsonl", "id": 66450, "text": "Some information is personal sensitive information. Rejecting the above use will cause you to be unable to complete your identity authentication, but it will not affect the normal use of other functions of watermelon video.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Refusing to provide identity authentication information will cause you to be unable to complete your identity authentication, but it will not affect the normal use of other functions."}
{"task": "rw_86.jsonl", "id": 66451, "text": "This information is for the purpose stipulated in real -name authentication and laws and regulations. Without your explicit authorization, it will not be used as other purposes.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66452, "text": "f. Geographical location service: When you use geographical location -related services, location service providers (Gaode Map) may use the geographical location information and equipment information collected by your GPS sensor through SDK or related technologies to return to youresult.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Location service provider (Gaode Map) may collect the geographical location information and equipment information collected by your GPS sensor through SDK or related technologies for returning position results."}
{"task": "rw_86.jsonl", "id": 66453, "text": "If the above use is rejected, it will only affect the geographical location service function, but it does not affect the normal use of other functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If the above collection is rejected, it will only affect the geographical location service function, but it does not affect the normal use of other functions."}
{"task": "rw_86.jsonl", "id": 66454, "text": "g. In order to adapt the message push function with the terminal model you used, terminal equipment manufacturers (Huawei, Xiaomi, OPPO, vivo, etc.) may use your mobile phone model, version and related device information through SDK and other technologies.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Terminal equipment manufacturers (Huawei, Xiaomi, OPPO, vivo, etc.) may use your mobile phone model, version and related equipment information through SDK and other technologies."}
{"task": "rw_86.jsonl", "id": 66455, "text": "h. Wallet function: The related services in the wallet function are provided by our related parties and partners. When you use wallet -related functions, our related parties and partners will collect information within the necessary limit according to the function or service.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use wallet -related functions, our affiliates and partners will collect information within the necessary limit according to the function or service."}
{"task": "rw_86.jsonl", "id": 66456, "text": "i. Payment function: The payment function will provide you with a payment institution that cooperates with us.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66457, "text": "In order to provide your name, the bank card type and card number, validity period, ID number and mobile phone number will be used to provide functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to provide functions, the partner payment agency will use name, bank card type and card number, validity period, ID number and mobile phone number."}
{"task": "rw_86.jsonl", "id": 66458, "text": "This information is the required information for payment functions. Rejecting the above use will cause you to be unable to use this function, but it does not affect the normal use of other functions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Refusing to provide payment information will cause you to be unable to use this function, but does not affect the normal use of other functions."}
{"task": "rw_86.jsonl", "id": 66459, "text": "j. Order function: When you use watermelon videos \"My order\" function, after your authorization, we may provide your order information with the relevant service provider placed with order to facilitate you to unify the order information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After your authorization, we may provide your order information with the relevant service provider placed with the order to facilitate you to check the order information uniformly."}
{"task": "rw_86.jsonl", "id": 66460, "text": "k. Customer service: In order to deal with your complaints, suggestions, and other demands in a timely manner, customer service providers need to use your account and related information about the complaint event, as well as timely understanding, processing and response related issues.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Customer service providers need to use your account number and relevant information about the complaint events, as well as timely understanding, processing and response related issues."}
{"task": "rw_86.jsonl", "id": 66461, "text": "3.1.6 Implement data of advertising business", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66462, "text": "a. Advertising push and launch: partners who push/promote and advertise or provide the aforementioned services using device, network, channel information and labeling information after dehuminization or anonymity;", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66463, "text": "Services partners in advertising push/promotion and release/analysis of advertisers may need to use the aforementioned information to achieve the effective touch rate of advertising, optimization and enhancement of advertising.", "label": ["Usage"], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66464, "text": "b. Advertising statistical analysis: Push/promotion, advertising, and partners who provide the aforementioned analysis services may need to use information such as your device, network, advertising clicks, browsing, display, and advertising transformation data to analyze, measure, improve advertisingThe effectiveness of related services.", "label": ["Important", "Usage"], "rewrite": "Partners who provide analytical services may need to use information such as your device, network, advertising clicks, browsing, display, and advertising transformation data."}
{"task": "rw_86.jsonl", "id": 66465, "text": "c. Advertising partner's use of information: Advertising partners may combine the above information with other legal obtained data to optimize the effect of advertising. We will require itLegal rights are not violated.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "Advertising partners may combine the above information with other legally obtained data to optimize the effect of advertising.We will require it to follow the principles of legal, correctness, and necessary principles."}
{"task": "rw_86.jsonl", "id": 66466, "text": "d. Advertising information: When you actively fill in your contact information, addresses and other information in the advertising display page provided by the advertiser or the service provider provided by the advertiser or the service provider, this information may be collected and used directly by the advertiser.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you actively fill in your contact information, addresses and other information in the advertising display page, this information may be collected and used directly by advertisers."}
{"task": "rw_86.jsonl", "id": 66467, "text": "3.1.7 Data use of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66468, "text": "a. Guarantee use of security: We attach great importance to accounts, services and content security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement. Our partners may use the necessary.Equipment, account number and log information.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Our partners may use the necessary devices, accounts and log information to ensure the safety of use."}
{"task": "rw_86.jsonl", "id": 66469, "text": "b. Analysis of product conditions: In order to analyze the use and performance of our products, our partners may need to use the product's usage (collapse, flashback), equipment identification information, and overall installation of usage.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Our partners need to use the product's usage (collapse, flashback), equipment identification information, and overall installation of usage. It is used to analyze the product situation."}
{"task": "rw_86.jsonl", "id": 66470, "text": "(Watermelon video websites access Baidu statistics. For details, please check tongji.baidu.com, mtj.baidu.com).", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66471, "text": "c. Academic scientific research: In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may use de -identification or anonymous institutions with cooperative scientific research institutes, universities and other institutions on the premise of ensuring the legitimate data security and purpose.data.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Under the premise of ensuring data security and purpose, we may use de -identified or anonymous data with cooperative scientific research institutes, universities and other institutions."}
{"task": "rw_86.jsonl", "id": 66472, "text": "3.1.8 Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66473, "text": "When you choose to participate in the relevant marketing activities organized by us and our partners, in order to ensure that you can get the same experience in the joint event, or entrust the partner to honor you in time, we and our partners may need to use you to use youName, communication address, contact information, bank account and other information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We and partners may need to use information such as names, communication addresses, contact information, and bank accounts."}
{"task": "rw_86.jsonl", "id": 66474, "text": "Rejection of the above use may affect your participation in related activities, but it will not affect other functions.", "label": ["Important", "Usage"], "rewrite": "Rejecting information may affect your participation in related activities, but it will not affect other functions."}
{"task": "rw_86.jsonl", "id": 66475, "text": "We may use the avatars, nicknames, and/or above information with the partners to ensure that you can get consistent services in joint activities, or entrust the partner to honor you in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may use information such as avatars, nicknames, etc. with partners."}
{"task": "rw_86.jsonl", "id": 66476, "text": "3.2 Transfer", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66477, "text": "With the continuous development of our business, we will be likely to carry out mergers, acquisitions, and asset transfer, and your personal information may be transferred as a result.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66478, "text": "When the previous described changes occur, we will follow the laws and regulations and the security standards that are not lower than the security standards stated by the privacy policy.We will ask the Fang Fang to re -obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When a change in the previous description, the party will be required to continue to fulfill the obligation of personal information processors. If the party changes the original processing purpose and method of processing, it will be required to re -obtain your authorization consent."}
{"task": "rw_86.jsonl", "id": 66479, "text": "3.3 Public", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66480, "text": "a. We will not disclose your personal information, unless we follow national laws and regulations or obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your personal information unless we follow the provisions of national laws and regulations or obtain your consent."}
{"task": "rw_86.jsonl", "id": 66481, "text": "We disclose your personal information adopt security measures that meet the standards of the industry.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "The disclosure of your personal information will adopt security measures that meet the standards of the industry."}
{"task": "rw_86.jsonl", "id": 66482, "text": "b. When a penalty announcement of illegal accounts and fraud, we will disclose information about the relevant account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When a punishment announcement of illegal accounts and fraud, we will disclose information about the relevant account."}
{"task": "rw_86.jsonl", "id": 66483, "text": "c. When you authorize games, applet or other functions or services, the avatars and nicknames of you and friends who are concerned about each other will be displayed in ranking and related functions or services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After being authorized, the avatars and nicknames of you and your friends will be displayed in ranking and related functions or services."}
{"task": "rw_86.jsonl", "id": 66484, "text": "d. The works you publish, the list of attention, the number of attention, the number of followers, the list of fans, the number of fans, etc. will be displayed on the personal homepage.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66485, "text": "3.4 Removal of personal information provided and disclosed in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66486, "text": "Please understand that in the following situations, according to laws and regulations and national standards, we provide and disclose your personal information to your personal information without obtain your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, according to laws and regulations and national standards, provides and disclose your personal information to the partners and disclose your personal information without obtain your authorization consent:"}
{"task": "rw_86.jsonl", "id": 66487, "text": "a. To establish and fulfill your contract as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information necessary for disclosure, sharing, and fulfilling the contract does not need to obtain consent."}
{"task": "rw_86.jsonl", "id": 66488, "text": "b. To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, public information for fulfilling the statutory duties or the required personal information necessary for the legal obstacle does not need to obtain consent."}
{"task": "rw_86.jsonl", "id": 66489, "text": "c. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that is directly related to national security and national security and defense security does not need to obtain consent."}
{"task": "rw_86.jsonl", "id": 66490, "text": "d. Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing, public investigation, prosecution, trial, and judgment execution does not need to obtain consent."}
{"task": "rw_86.jsonl", "id": 66491, "text": "e. In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property security of natural people in emergencies;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, publicly responding to public health incidents, or personal information necessary for protecting the health of natural people and the necessary property safety, no consent is required."}
{"task": "rw_86.jsonl", "id": 66492, "text": "f. For public interests implement news reports and public opinion supervision, handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "For public interests and implementation of news reports and public opinion supervision, handle personal information within a reasonable scope without obtaining consent."}
{"task": "rw_86.jsonl", "id": 66493, "text": "g. Handle your own personal information in accordance with relevant laws and regulations or other legal disclosure;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Do not obtain consent in accordance with relevant laws and regulations."}
{"task": "rw_86.jsonl", "id": 66494, "text": "h. Collect personal information from the information disclosed legal and publicly disclosed;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to obtain consent."}
{"task": "rw_86.jsonl", "id": 66495, "text": "i. Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Any information stipulated in other circumstances stipulated in laws and administrative regulations does not need to obtain consent."}
{"task": "rw_86.jsonl", "id": 66496, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66497, "text": "4.1 Storage location", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66498, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "Your personal information collected and generated during the domestic operation is stored in the territory of the People's Republic of China."}
{"task": "rw_86.jsonl", "id": 66499, "text": "At present, we will not transmit the above information overseas. If we transmit them overseas, we will strictly abide by China's relevant laws and regulatory policies, and will follow relevant state regulations or seek your consent.", "label": ["Data Retention", "Important"], "rewrite": "We will not transmit the above information to overseas, such as transmission to overseas, we will strictly abide by China's relevant laws and regulatory policies, and will follow relevant state regulations or solicit consent."}
{"task": "rw_86.jsonl", "id": 66500, "text": "4.2 Storage period", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66501, "text": "4.2.1, we only retain your personal information during the period for the purpose of providing watermelon video services, such as::", "label": ["Data Retention", "Important"], "rewrite": "We only retain your personal information during the necessary period, such as:"}
{"task": "rw_86.jsonl", "id": 66502, "text": "a. Mobile phone number: When you register with your mobile phone number, we need to continue to retain your mobile phone number in order to provide you with normal services, inquiring your possible inquiries and complaints, and guarantee your account and system security.", "label": ["Data Retention", "Important"], "rewrite": "We need to keep your mobile phone number in order to provide you with normal services."}
{"task": "rw_86.jsonl", "id": 66503, "text": "b. The information, comments, likes, collections and related information you posted. When you have not withdrawn, deleted or canceled your account, we will retain relevant information to provide you with continuous business functions.", "label": ["Data Retention", "Important"], "rewrite": "The information, comments, likes, collection and related information you posted, will retain relevant information to provide you with continuous business functions during the time when you have not withdrawn, delete or cancel accounts."}
{"task": "rw_86.jsonl", "id": 66504, "text": "4.2.2, if you cancel your account, take the initiative to delete your personal information, or go beyond the necessary period, we will delete or processes your personal information, except for the following situations:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If you cancel your account, actively delete personal information, or exceed the necessary period, delete or processes personal information, except for the following situations:"}
{"task": "rw_86.jsonl", "id": 66505, "text": "a. Comply with the requirements for information retention of laws and regulations (for example: the \"E -commerce Law of the People's Republic of China\" stipulates that the time for the saving time of goods and service information and transaction information is not less than three years from the date of the transaction).", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Comply with the requirements for information retention of laws and regulations, will not be deleted or anonymous."}
{"task": "rw_86.jsonl", "id": 66506, "text": "b. For the purpose of finance, auditing, and dispute resolution, the period needs to be reasonably extended.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If the purpose of finance, auditing, and dispute resolution needs to be reasonably extended, it will not be deleted and anonymous."}
{"task": "rw_86.jsonl", "id": 66507, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66508, "text": "a. We attach great importance to your personal information, and we will strive to take reasonable security measures (including technical and management) to protect your personal information and prevent your personal information from being used in improperly or without authorization.It was interviewed, publicly disclosed, used, modified, damaged, lost or leaked.", "label": ["Important", "Data Security"], "rewrite": "Will strive to take reasonable security measures (including technical and management) to protect your personal information."}
{"task": "rw_86.jsonl", "id": 66509, "text": "At present, watermelon videos have passed the evaluation and filing of national information security level protection (level 3), and passed the international authority of ISO27001 information security certification.", "label": ["Important", "Data Security"], "rewrite": "Watermelon videos have passed the evaluation and filing of national information security level protection (level 3), and passed the international authority's ISO27001 information security certification."}
{"task": "rw_86.jsonl", "id": 66510, "text": "b. We will use crypto technology, anonymous treatment, and related reasonable and feasible methods that are not lower than industry peers to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "It will use crypto technology, anonymous treatment, and related reasonable and feasible methods that are not lower than industry peers to protect personal information, and use a security protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_86.jsonl", "id": 66511, "text": "c. We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "It will establish a special security department, security management system, data security process to ensure your personal information security."}
{"task": "rw_86.jsonl", "id": 66512, "text": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "Adopt strict data use and access system to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner."}
{"task": "rw_86.jsonl", "id": 66513, "text": "d. Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant laws have been adopted, please understand that due to the technical restrictions and various malicious means that may exist, even in the Internet industry, even if you can do your best to strengthen your security, you can strengthen your security.Measures cannot always ensure that information is 100 % security. We will try our best to ensure the security of your personal information you provide.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66514, "text": "e. You know and understand that the systems and communication networks you use to access our services may be due to factors outside the controlled range.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66515, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66516, "text": "f. We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand.", "label": ["Important", "Data Security"], "rewrite": "Immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand."}
{"task": "rw_86.jsonl", "id": 66517, "text": "Once the user information security incident (leaked and lost) occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have taken or we will takeAnd reducing risk suggestions, remedy measures for you.", "label": ["Important", "Data Security"], "rewrite": "Once the user information security incident (leaked and lost) occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: basic situations and possible impact, disposal measures, suggestions, remedy measures."}
{"task": "rw_86.jsonl", "id": 66518, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform them one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "If you will inform you in a timely manner, when it is difficult to inform one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_86.jsonl", "id": 66519, "text": "At the same time, we will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities."}
{"task": "rw_86.jsonl", "id": 66520, "text": "Please note that according to the provisions of laws and regulations, if we take measures to effectively avoid information leakage, tampering, and loss of losses, we can choose not to notify you, but the department that fulfills the responsibilities of personal information protection requires us to notify you except what you notify you.Essence", "label": ["Important", "Data Security"], "rewrite": "If we take measures to effectively avoid information leakage, tampering, and loss of loss, we can choose not to notify you, but the department that fulfills the responsibilities of personal information protection requires us to notify you."}
{"task": "rw_86.jsonl", "id": 66521, "text": "g. Once you leave watermelon videos and related services, browse or use other websites, services and content resources, we will not be able to protect your personal information submitted by software or website in addition to watermelon videos and related services, regardless of whetherYou log in, browse, or use the above software, whether the website is based on the link or guidance of a watermelon video.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66522, "text": "6. Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66523, "text": "In order to show you and recommend more information and advertisements, provide services that meet your requirements more. Watermelon videos will provide you with personalized recommendation services. The following we will explain to you in detail the operating mechanism and the operating mechanism of this personalized product service andYour way of control.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66524, "text": "6.1 Personalized recommendation mechanism", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66525, "text": "a., the scope of our personalized recommendation services includes display video content, providing search results, and recommending products and advertisements that you may be interested in.", "label": ["Important", "Usage"], "rewrite": "The scope of our personalized recommendation services includes showing video content, providing search results, and recommending products and advertisements that you may be interested in."}
{"task": "rw_86.jsonl", "id": 66526, "text": "Through the privacy policy, instant notification (including pop -up window, mask, reminder, etc.), we notify you to use the user information collected by personalized recommendations, user feedback, and control information recommendation.", "label": ["Important", "Usage"], "rewrite": "Inform you through this privacy policy, instant notification and other methods for personal information collected by personalized recommendations, user feedback, control information recommendations, etc."}
{"task": "rw_86.jsonl", "id": 66527, "text": "b. In order to predict your preference, we may collect and use your equipment information, location information, and behavior information when using the product. Behavioral information includes your click, follow, browse, like, like, like, likeRelease, comment, sharing, search, collection, collection and trading related records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Will collect and use your equipment information, location information, and behavior information when using products. Behavior information includes your operating related records when visiting/using products."}
{"task": "rw_86.jsonl", "id": 66528, "text": "We will automatically analyze and calculate the above information. The system will automatically screen out the content you may be more interested in according to the calculation results.", "label": ["Important", "Usage"], "rewrite": "Automatic analysis and calculation of equipment information, location information, and behavioral information will be carried out. The system will automatically screen out the content you may be more interested in push according to the calculation results."}
{"task": "rw_86.jsonl", "id": 66529, "text": "c. We will give real -time feedback on the recommendation model based on the browsing behavior of your product, and constantly adjust the optimization results to better provide you with high -quality content.", "label": ["Important", "Usage"], "rewrite": "According to your browsing behavior in the process of using your product, real -time feedback will be adjusted and optimized the results of the recommendation."}
{"task": "rw_86.jsonl", "id": 66530, "text": "6.2 Personalized recommendation control and management", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66531, "text": "6.2.1 Autonomy and controllable information for receiving information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66532, "text": "We will use the recommendation algorithm to personalize and display the information content you browse. You can control the personalized recommendation of information content in the following way:", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You will use the recommendation algorithm to personalize and display the information content you browse. You can control personalized recommendations through the following methods:"}
{"task": "rw_86.jsonl", "id": 66533, "text": "a. Autonomously decide to receive personalized push information", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can independently decide to receive personalized push information."}
{"task": "rw_86.jsonl", "id": 66534, "text": " You can open or close the personalized recommendation function through [Mine],-, [Settings] through the Watermelon Video APP. When you choose to close, you will no longer show you the \"recommendation\" channel. You cannot enjoy personalizationRecommended services, but you can continue to view other non -personal recommendation content. At the same time, you can also open a personality recommendation to get richer content.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "[My] - [Settings] through the Watermelon Video APP can be turned on or closed on the personalized recommendation function."}
{"task": "rw_86.jsonl", "id": 66535, "text": " When you are not interested in the information we push or want to reduce some information recommendation, you can click [Not interested] in recommended audio and video [More], we will make accurate shielding based on your feedback adjustment strategy.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "When you are not interested in the information we push or want to reduce some information recommendation, you can click [Not interested] in recommending audio videos [More]."}
{"task": "rw_86.jsonl", "id": 66536, "text": "This will help you achieve control and independent decision -making on the recommended content.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66537, "text": "At the same time, we also provided [My Customer Service]-[Opinion Feedback] in the Watermelon Video APP to listen to your opinions and suggestions.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66538, "text": "b. Subscribe to the required information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66539, "text": "In the follow -up channel, you will display the account information you actively choose to follow. You can choose to pay attention or cancel your attention.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66540, "text": "c. When you are not interested in content, you can also enter the keywords interested in the search bar, click and read the search results.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66541, "text": "6.2.2 Manage your personalized advertising push", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66542, "text": "In order to provide you with free, high -quality services, the Watermelon Video APP will show you as much as possible to you as much as possible according to your related services. At the same time, we will work hard in this process.Ensure data security.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66543, "text": "Watermelon video horizontal screen has not yet provided personalized advertising services.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66544, "text": "a. Autonomous decision to receive personalized advertising information: Personalized advertising is one of the advertising display techniques. The advertisers are intelligently recommended based on your preferences in its application.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66545, "text": "You can select whether to close or open a personalized advertiseYou no longer receive such personalized advertisements, but you will still see advertisements. The number of advertisements will not change, but the correlation of advertising will be reduced.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can select whether to close or open a personalized advertisement in the Watermelon Video APP [Mine] - [About Watermelon] - [Understanding and Management Advertising Push]."}
{"task": "rw_86.jsonl", "id": 66546, "text": "b. Advertising information withdrawal: You can get the push of the message by closing the \"Push Notice\" in the Watermelon Video APP [Mine],-, [Settings], and we will send your marketing SMS by replying to \"TD\".", "label": ["Important", "Edit/Control"], "rewrite": "You can refuse the message push by closing the \"Push Notice\" in the [Mine] - [Settings] in the Watermelon Video APP, and we will send your marketing text message by replying to \"TD\"."}
{"task": "rw_86.jsonl", "id": 66547, "text": "7. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66548, "text": "We attach great importance to your management of personal information and do our best to protect your personal information inquiry, copy, correct, supplement, access, delete, withdraw, cancel account number, complain report, and set privacy functions to makeYou have the ability to protect your privacy and information security.", "label": ["Important", "Edit/Control"], "rewrite": "Do your best to protect your rights to query, copy, correct, supplement, access, delete, withdraw, withdraw, cancel account number, complain report, and set privacy functions for your personal information."}
{"task": "rw_86.jsonl", "id": 66549, "text": "In order to optimize your experience, we may also adjust the operation settings, so the following guidelines are for reference only.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66550, "text": "There may be differences in the way we provide in different versions or operating systems, please refer to it.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66551, "text": "7.1 Change or withdraw the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66552, "text": "7.1.1 Change or withdraws sensitive permissions settings", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66553, "text": "You can turn off the relevant permissions in the device operating system to change the scope of consent or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off the relevant permissions in the device operating system to change the scope of consent or withdraw your authorization."}
{"task": "rw_86.jsonl", "id": 66554, "text": "After withdrawal authorization, we will no longer collect information related to this permissions.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66555, "text": "7.1.2 Change or withdraw account binding", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66556, "text": "a. You can lift the binding relationship with the third-party account in the Watermelon Video APP [Mine]-[Settings]-[Account and Security] interface.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66557, "text": "b. You can also lift the binding relationship with the watermelon video account on the interface where the third -party account is located, and the specific function of the third -party platform shall prevail.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66558, "text": "7.1.3 Change or withdraw from authorized information processing", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66559, "text": "Please note that specific business functions and services will need your information to be completed. When you withdraw from consent or authorization, we cannot continue to provide you with the functions and services corresponding to the withdrawal consent or authorization, and no longer handle your corresponding correspondencePersonal information.", "label": ["Important", "Edit/Control"], "rewrite": "After you withdraw or authorize, you cannot continue to provide you with the corresponding functions and services corresponding to the withdrawal consent or authorization, and no longer handle your corresponding personal information."}
{"task": "rw_86.jsonl", "id": 66560, "text": "But your decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization."}
{"task": "rw_86.jsonl", "id": 66561, "text": "You can use the Watermelon Video APP [Mine],-, [Settings],-, [Basic Function Mode] to open or close the basic function mode to choose the scope of our function and services.", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close the basic functional mode through the Watermelon Video APP [Mine] - [Settings] - [Basic Function Mode], and select the scope of our functions and services."}
{"task": "rw_86.jsonl", "id": 66562, "text": "7.2 Your personal information rights", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66563, "text": "7.2.1 Personal information collection list", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66564, "text": "You can use the Watermelon Video APP [Mine]-[Settings]-, [Personal Information Collection List], query the scene of collecting personal information according to categories, and personal information that may be collected, and access, correct, delete your personal personalinformation.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the Watermelon Video APP [My]- [Settings]- [Personal Information Collection List], query the scene of collecting personal information according to categories, and personal information that may be collected, and access, correct, delete personal information."}
{"task": "rw_86.jsonl", "id": 66565, "text": "When you find that there is an error in your personal information, you have the right to ask us to make corrections or supplements.", "label": ["Edit/Control", "Important"], "rewrite": "When your personal information is wrong, you have the right to ask us to make corrections or supplements."}
{"task": "rw_86.jsonl", "id": 66566, "text": "You can submit a correction or supplementary application in the method listed in the Watermelon Video APP, or use the [My]-[My Customer Service]-[Feedback of Opinion] entrance to feedback.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for correction or supplementation through the method listed in the [Personal Information Collection List] in the Watermelon Video APP, or use [My]-[My Customer Service]-[Feedback of Opinion] entrance."}
{"task": "rw_86.jsonl", "id": 66567, "text": "7.2.2 Check and copy personal account information", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66568, "text": "You can check and copy your avatar, username (nickname), profile, you can check, copy, and correct them in the Watermelon Video APP [Mine]-, [Edit Information].", "label": ["Edit/Control", "Important"], "rewrite": "You can check and copy your avatar, username (nickname), and profile. You can check, copy and correct them in the Watermelon Video APP [My]- [Edit Information]."}
{"task": "rw_86.jsonl", "id": 66569, "text": "7.2.3 Check, correct, cancel your attention account", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66570, "text": "Enter [My Following] In the follow -up list, check and cancel the account of your attention.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66571, "text": "7.2.4 Review, change, delete your collection, search history", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66572, "text": "a. Click [Mine],-, click [My Favorites] into the video of your collection and delete your collection;", "label": ["Important", "Edit/Control"], "rewrite": "Click [Mine] -Click [My Favorites] into the video of your collection and delete your collection."}
{"task": "rw_86.jsonl", "id": 66573, "text": "b. Click the search bar, -s, click [Delete] Delete [Search Record];", "label": ["Important", "Edit/Control"], "rewrite": "Click the search bar -click [Delete] Delete [Search Record]."}
{"task": "rw_86.jsonl", "id": 66574, "text": "c. You can click [Settings],-, click [Clear Clear].", "label": ["Important", "Edit/Control"], "rewrite": "You can click [Settings] -click [Clear Cacus]."}
{"task": "rw_86.jsonl", "id": 66575, "text": "7.2.5 Delete the published content and review content", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66576, "text": "a. Delete publishing content: Enter the Watermelon Video APP [Mine],-, click [Content Management], and delete the publishing content through [Delete] in [];", "label": ["Edit/Control", "Important"], "rewrite": "Delete the publishing content: Enter the Watermelon Video APP [Mine] -Click [Content Management], and delete the publishing content through [Delete] in []."}
{"task": "rw_86.jsonl", "id": 66577, "text": "b. Delete comment content: You can delete your comments by accessing a single comment content and accessing the page.", "label": ["Important", "Edit/Control"], "rewrite": "Delete comment content: You can delete your comments by accessing a single comment content and accessing the page."}
{"task": "rw_86.jsonl", "id": 66578, "text": "7.2.6 The range of control information can be visible", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66579, "text": "Enter the Watermelon Video APP [Mine]-[Content Management] to control whether others can see your published works and whether you can comment on the works you posted.", "label": ["Important", "Edit/Control"], "rewrite": "Enter the Watermelon Video APP [Mine]-[Content Management] to control whether others can see the works you published and whether it can be comment."}
{"task": "rw_86.jsonl", "id": 66580, "text": "7.3 Explanation of personal information collection and management", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66581, "text": "In addition to the above, if you or other rights have the exercise of personal information rights given by relevant laws and regulations, you can have any claims, requirements or questions, and you can use the watermelon video app [My]-[My Customer Service]-[Opinion feedback] Enter the user feedback interface, or contact us through dataprivacy@bytedance.com. We will review the issues involved as soon as possible and reply after verifying your user identity.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact us through the user feedback interface of [My]-[My Customer Service]-[Opinion Feedback] through the user feedback interface, or contact us through dataprivacy@bytedance.com."}
{"task": "rw_86.jsonl", "id": 66582, "text": "Special reminder that you pay attention to the consideration of security and identity identification (such as number appeal services), you may not be unable to modify some initial registration information submitted when registering.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66583, "text": "If you really need to modify this type of registration information, please contact us according to the contact information stated by this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66584, "text": "7.4 Logging out account", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66585, "text": "You can in the Watermelon Video APP [My]-[Settings]-[Account and Security]-[Account Logging into], Watermelon Video Heng screen version []-[Settings]-[Privacy]-[Account Logging up] and and and and and and and and and and and and and and and.We contact our account to cancel your account. We will handle it in time after receiving your application, and reply to your request within 15 working days or the time limit required by laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You can in the Watermelon Video APP [My]-[Settings]-[Account and Security]-[Account Logging into], Watermelon Video Heng screen version []-[Settings]-[Privacy]-[Account Logging up] and and and and and and and and and and and and and and and.We contact our account to cancel your account."}
{"task": "rw_86.jsonl", "id": 66586, "text": "Before you cancel your account, we will verify your personal identity, security state, equipment information, etc.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66587, "text": "You know and understand that the behavior of canceling the account is irreversible behavior. When you cancel your account, we will delete relevant information about you or processed anonymous, except for the laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "The behavior of canceling the account is irreversible. When you cancel your account, we will delete relevant information about you or perform anonymous processing, except for the laws and regulations."}
{"task": "rw_86.jsonl", "id": 66588, "text": "For the process and content of the injection, see the \"Watermelon Video Lancer Instructions\".", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66589, "text": "7.5 feedback and complaint report", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66590, "text": "You can complain or report in accordance with our publicity system.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66591, "text": "If you have any comments or you think your personal information rights may be violated, or you can find a clue to infringe the right to personal information, you can enter the Watermelon Video APP [My]-[My Customer Service]-[Feedback of Opinions] into the userThe feedback interface, or contact us through dataprivacy@bytedance.com.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact us in the Watermelon Video APP [My]-[My Customer Service]-[Feedback of Opinions] into the user feedback interface, or contact us through dataprivacy@bytedance.com."}
{"task": "rw_86.jsonl", "id": 66592, "text": "We will report your complaints and reports in time after verification.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66593, "text": "7.6 Visiting Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66594, "text": "a. You can register the page, or in the Watermelon Video APP [Mine]-[Settings]-, [About Watermelon], Watermelon Video horizontal screen versionCheck all the contents of this privacy policy or check all the content of this privacy policy through www.ixigua.com.", "label": ["Important", "Edit/Control"], "rewrite": "You can register the page, or in the [Mine]- [Settings]- [About Watermelon], Watermelon Video Heng screen version of the Watermelon Video APP []- [Settings]- [Privacy]Check the content of the content through www.ixigua.com."}
{"task": "rw_86.jsonl", "id": 66595, "text": "b. Please understand that the \"watermelon video\" and related services described in this privacy policy may be different according to factors such as the mobile phone model, system version, software application version, mobile client and other factors you use.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66596, "text": "The final product and service are subject to the \"watermelon video\" software and related services you use.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66597, "text": "7.7 Stopping operations to tell you", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66598, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of delivery or announcement one by one, and delete or processes your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "If the operation is stopped, it will stop collecting your personal information in a timely manner and notify you to delete or treat your personal information you hold."}
{"task": "rw_86.jsonl", "id": 66599, "text": "7.8 The right to explain", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66600, "text": "You have the right to ask us to explain the rules of personal information processing.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66601, "text": "You can contact us in the Watermelon Video APP [My]-[My Customer Service]-[Feedback of Opinions] into the user feedback interface, or contact us through dataprivacy@bytedance.com.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the Watermelon Video APP [My]-[My Customer Service]-[Feedback of Opinions] into the user feedback interface, or contact us through dataprivacy@bytedance.com."}
{"task": "rw_86.jsonl", "id": 66602, "text": "8. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66603, "text": "8.1 General Terms of Minor", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66604, "text": "a. We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66605, "text": "According to the relevant laws and regulations, if you are a minor under the age of 18, you should read and agree to the privacy policy together under the supervision and guidance of your parents or other guardians before using watermelon videos and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18, before using watermelon videos and related services, should be read and read together under the guidance and agree to the privacy policy."}
{"task": "rw_86.jsonl", "id": 66606, "text": "b. If you are a guardian under the age of 14, you should read and agree to your privacy policy for your guardian before using watermelon videos and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardians of minors under the age of 14 should read and agree to the privacy policy for your guardian before using watermelon videos and related services."}
{"task": "rw_86.jsonl", "id": 66607, "text": "c. We protect personal information of minors in accordance with the provisions of relevant national laws and regulations, and will only collect, use or disclose individuals who are required by law, parents or other guardians to collect, use or disclose the individuals who are necessary for minors.information;", "label": ["Specific Audiences", "Important"], "rewrite": "It will only collect, use, or disclose personal information of minors when legal permission, guardian clearly agree or protect minors."}
{"task": "rw_86.jsonl", "id": 66608, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If you find that the personal information of minors is collected without the consent of the guardian in advance, he will try to delete relevant information as soon as possible."}
{"task": "rw_86.jsonl", "id": 66609, "text": "At the same time, we have established rules for collection and use of minor information to protect personal information security for children and adolescents. You can learn more about the more specific content by reading \"Children/Adolescents\".", "label": ["Specific Audiences", "Important"], "rewrite": "We have established rules for collection and use of minor information to protect personal information security for children and adolescents."}
{"task": "rw_86.jsonl", "id": 66610, "text": "d. If you are the guardian of minors, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information of this privacy policy.", "label": ["Specific Audiences", "Important"], "rewrite": "When the guardian has doubts about the personal information of the monitoring minor, please contact us through the contact information of the privacy policy."}
{"task": "rw_86.jsonl", "id": 66611, "text": "8.2 Special protection of minors", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66612, "text": "Child/adolescent mode", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66613, "text": "[Mine]-[Settings]-[Child/Youth Model], Watermelon Video Heng screen version of the Watermelon Video APP [Settings]-[Children/Youth Model] can be set in \"Children/Youth Model\" in the Watermelon Video.After the function is turned on, it can only use watermelon videos in specific periods and durations. Specifically, you need to enter the password set in advance to continue to use.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You can set the \"Child/Adolescent Mode\". After the function is turned on, it can only use watermelon videos in specific periods and durations. When it exceeds a specific time, you need to enter the password to continue to use."}
{"task": "rw_86.jsonl", "id": 66614, "text": "9. Consultation and revision of privacy policies", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66615, "text": "a. In order to provide you with better services, watermelon videos and related services will be updated and changed from time to time. We will revise this privacy policy in a timely manner. These amendments constitute a part of the privacy policy and have the effect of equivalent privacy policies.With your clear consent, we will not reduce the rights you should enjoy based on the current privacy policy that takes effect.", "label": ["Policy Change", "Important"], "rewrite": "We will revise this privacy policy in a timely manner. Without your clear consent, we will not reduce the rights you should enjoy based on the current privacy policy that take effect."}
{"task": "rw_86.jsonl", "id": 66616, "text": "b. After the privacy policy is updated, we will issue an updated version in the watermelon video, and announce the announcement of the official website (https://www.ixigua.com/) before the update the terms take effect or other appropriate ways to remind youContents so that you can understand the latest version of this privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "After the privacy policy is updated, the updated version will be issued, and before the updated terms take effect, it will be announced through the official website (https://www.ixigua.com/) or other appropriate ways to remind you of the updated content."}
{"task": "rw_86.jsonl", "id": 66617, "text": "c. Please understand that in order to meet the needs of operation, we may develop different versions based on factors such as the mobile phone model, system version, and mobile clients you use. Therefore, when you use a specific version, the function of watermelon video may be with privacy and privacyThe policy description is different, but it will not exceed the purpose, method, and scope of the data processing described by the privacy policy, and will not reduce your rights and interests. The specific functions are based on the actual use of your actual use.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66618, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66619, "text": "a. Watermelon video is provided by Beijing Bitting Technology Co., Ltd. (now Beijing Douyin Information Service Co., Ltd.) and its related parties. If you have complaints, suggestions, and questions on personal information protection issues, you can send the problem to (DataPrivacy@bytedance.com), when we verify and verify your user identity, you will report your complaints and reports in time.", "label": [], "rewrite": []}
{"task": "rw_86.jsonl", "id": 66620, "text": "b. If you have any questions, opinions or suggestions on the content of this privacy policy, you can enter the user feedback interface in [My Customer Service]-[Opinion Feedback] in the Watermelon Video APPWe contact.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the Watermelon Video APP [My]-[My Customer Service]-[Feedback of Opinions] into the user feedback interface, or contact us through dataprivacy@bytedance.com."}
{"task": "rw_86.jsonl", "id": 66621, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
