{"task": "rw_8.jsonl", "id": 38978, "text": "Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38979, "text": "Update date: August 01, 2022", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38980, "text": "Effective date: August 01, 2022", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38981, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38982, "text": "Beijing Cali Technology Co., Ltd. and affiliated companies (hereinafter referred to as \"Keep APP\" or \"We\") attach great importance to your personal information and allow you to control your personal information. We will use strong encryption technology to protect your privacy.At the same time, strict policies are formulated to manage all data.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38983, "text": "When you access the KEEP APP or use the services we provide, you need to agree with the regulations on how we collect, use, store, and share your relevant information in this policy.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38984, "text": "If you do not agree with any content in this privacy policy, stop using or accessing our products and services immediately.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with this privacy policy, stop using or accessing our products and services immediately."}
{"task": "rw_8.jsonl", "id": 38985, "text": "If you have any questions about this policy, please contact: Feedback@keep.com, we will complete the verification and processing within 15, and complete the inspection and processing within 15.", "label": ["Important", "Contact Information"], "rewrite": "Email: feedback@keep.com"}
{"task": "rw_8.jsonl", "id": 38986, "text": "about Us", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38987, "text": "The operators of Keep webpages and apps are Beijing Cali Technology Co., Ltd. or its affiliates.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38988, "text": "The registered address is the No. 1 section number VIII, No. 031, and Room 032, 1st floor of Wangjing Street, Chaoyang District, Beijing.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38989, "text": "The main points of this privacy policy are as follows:", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38990, "text": "i. We will explain the types of your personal information and its corresponding purposes we collected one by one, so that you can understand the category, use reasons and collection methods we collected for a specific function.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38991, "text": "II., When you use some functions, we will collect some of your sensitive information after obtaining your separate consent. Unless you must collect it in accordance with the requirements of relevant laws and regulations, it will only make you unable to use the relevant features.But it does not affect your normal use, Keep, APP, other functions.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We will collect some of your sensitive information and refuse to provide it that may make you unable to use relevant features."}
{"task": "rw_8.jsonl", "id": 38992, "text": "III., At present, Keep, APP, will not actively share or transfer your personal information to, key, app, third parties outside, such as other sharing or transfer your personal information or you need us to share your personal information sharingOr transfer to, Keep, APP, and third -party situations outside, we will directly or confirm that third parties obtain your separate consent of the above behavior. In addition, we will evaluate the risk of providing information to the outside world.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The Keep App will not actively share or transfer your personal information to a third party outside the Keep APP. If the sharing will obtain your consent, we will provide information on the outside of the outside world."}
{"task": "rw_8.jsonl", "id": 38993, "text": "IV. You can access, correct, and delete your personal information through this guide. You can also withdraw your consent, cancel account number, complaint reports, and set privacy functions.", "label": ["Important", "Edit/Control"], "rewrite": "You can set relevant personal information status and privacy functions through the path listed in this guideline."}
{"task": "rw_8.jsonl", "id": 38994, "text": "If you want to know more detailed information, read the corresponding chapter according to the following index:", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38995, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38996, "text": "2. How do we entrust your personal information to deal with, share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38997, "text": "3. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38998, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 38999, "text": "5. Your personal subject right", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39000, "text": "6. Third -party service provider", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39001, "text": "7. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39002, "text": "8. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39003, "text": "9. Update of this policy", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39004, "text": "10. Scope of application", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39005, "text": "11. How to contact us", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39006, "text": "12. Supplementary provisions", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39007, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39008, "text": "When we provide services, we will collect and use your personal information based on the goals described in this policy based on the goals described in this policy.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "We will collect and use your personal information based on the goals described in this policy based on the purpose of legitimate, legal, transparent, and minimum necessary."}
{"task": "rw_8.jsonl", "id": 39009, "text": "1. Basic business functional services", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39010, "text": "The basic business functions of this application are free training courses that can be used indoors. You can use this basic functional service without providing us with any personal information.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39011, "text": "2. Upgrade experience service service", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39012, "text": "The upgrade experience function of this application is member courses, paid training courses, smart hardware proper courses, training camp courses, and intelligent training programs.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39013, "text": "3. Extended functional services", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39014, "text": "The expansion function of this application is running, cycling, walking, community, dietary tools, body testing, malls, members, smart hardware, keepland, on -site activities related functions.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39015, "text": "In order to provide you with better products and intelligent services, when you use experience or expansion functional services, we may need to collect the following information from you. If you refuse to provide it, you will not be able to enjoy the corresponding functions and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to provide better services, we may need to collect relevant information. If you refuse to provide, you will not be able to enjoy the corresponding functions and services."}
{"task": "rw_8.jsonl", "id": 39016, "text": "1.1 Registration, login account number", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39017, "text": "A.When you register, log in, keyp, app, you can create an account with your mobile phone number, and you can improve relevant personal information (including avatars, nicknames, passwords), and collect this information to help you complete registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number and related personal information to help you complete the registration and login."}
{"task": "rw_8.jsonl", "id": 39018, "text": "You can also select your information according to your own needs to fill in gender, birthday, regional and personal introduction.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also improve your information according to your own needs."}
{"task": "rw_8.jsonl", "id": 39019, "text": "B., you can also use a third -party account to log in and use, Keep, APP, and you will authorize us to obtain the public information (avatar, nickname, mobile phone number (encryption)) registered on the third -party platform., APP, account binding, so that you can log in and use this product and related services directly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_8.jsonl", "id": 39020, "text": "1.2 certification", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39021, "text": "When you need to use your authentication function or related services, according to relevant laws and regulations, you may need to provide your real identity information (real name, ID number, phone number) to complete the real -name verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use your authentication function or related services, you may need to provide your real identity information (real name, ID number, phone number) to complete the real -name verification."}
{"task": "rw_8.jsonl", "id": 39022, "text": "This part of the information is a sensitive personal information. You can refuse to provide it. If you refuse to provide you, you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "You can refuse to provide this part of sensitive information and refuse to provide you who may not be able to obtain related services."}
{"task": "rw_8.jsonl", "id": 39023, "text": "You can decide whether to bind the real-name authentication by \"setting\"-\"personal information\"-\"my real-name authentication\" in the upper left corner.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide whether to bind the real -name authentication by \"setting\"."}
{"task": "rw_8.jsonl", "id": 39024, "text": "1.3 Trading information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39025, "text": "You can buy product services in Keep APP (including Keep member services, Keep paid training plan services, Keep private courses).", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39026, "text": "Payment may be required in the process of using this feature. During the payment process, we may collect your third -party payment account (including Alipay account, WeChat account, UnionPay account).", "label": ["Important", "First Party Collection Information"], "rewrite": "In the use of payment functions, we may collect your third -party payment account (including Alipay account, WeChat account, UnionPay account)."}
{"task": "rw_8.jsonl", "id": 39027, "text": "1.4 Account Security and abnormal investigation", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39028, "text": "In the process of using our service, in order to understand product adaptability, ensure your account security and system operation security, judge your account risk, and ensure that we provide you with services normally, statistics and investigation of abnormal information, we will collect youThe services of the service and the method of use, including you are using, Keep, APP, exercise, in, key, community comments, barrage or participation in topic activities, where, key, mall purchase products or joinIn terms of use, Keep, membership, use, Keep, paid training plan, use, key products or services that may be generated.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the process of using our service, we will collect the relevant information of the services you use and the way of use."}
{"task": "rw_8.jsonl", "id": 39029, "text": "This kind of information includes:", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39030, "text": "1.4.1 Equipment information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39031, "text": "We will receive and record the equipment related information you use according to your software installation and/or the specific authority of using authorization, including your device model, operating system version information, device settings, mobile device versions, equipment recognition codes (including the equipment version, equipment recognition code (including, IMEI, Androidid, OAID, IMSI, ICCID, GAID, Meid, AAID, VAID), screen table split rate, device environment and other software and hardware feature information, the relevant information of the device is located (including IP address, GPS location, and related information that can provide relevant information, WLAN, access point, Bluetooth and base station sensor information).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your equipment model, operating system version information, equipment settings, mobile device versions, device recognition codes, screen segmentation rates, equipment environment and other software and hardware feature information and equipment related information."}
{"task": "rw_8.jsonl", "id": 39032, "text": "If you refuse to grant us the corresponding permissions during the installation and/or use, we will not collect your corresponding information.", "label": ["Edit/Control", "First Party Collection Information", "Important"], "rewrite": "If you refuse to grant the corresponding permissions during installation or use, we will not collect your corresponding information."}
{"task": "rw_8.jsonl", "id": 39033, "text": "1.4.2 log information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39034, "text": "A., device or software information, including your mobile device, web browser, or the configuration information provided by other programs used to access our services, your, IP, address and mobile device's versions and device identification codes (Including IMei, Androidid, OAID, IMSI, ICCID, GAID, Meid, AAID, VAID);", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect device or software information, including your mobile device, web browser or the configuration information provided by other programs used to access our services, your IP address and version and device identification code used in mobile devices."}
{"task": "rw_8.jsonl", "id": 39035, "text": "B. Search or browse information when using our service, including the web search words you use, the social media page of the access, the address of the access, and other information and content details you are provided when you use our service;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting search or browsing information, including the web search words you use, the social media page URL address you access, and other information and content details you are required to be provided when using our service."}
{"task": "rw_8.jsonl", "id": 39036, "text": "1.4.3 IP address", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39037, "text": "A. Information about mobile applications (APPs) and other software you have used, as well as information you used to use this type of mobile application and software;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information about mobile applications and other software you have used, as well as information you used to use this type of mobile application and software."}
{"task": "rw_8.jsonl", "id": 39038, "text": "B., you communicate information through our services, including the account number of Zeng Communication, as well as communication time, data, and duration;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect relevant communication information, including the account number of the communication, as well as communication time, data, and duration."}
{"task": "rw_8.jsonl", "id": 39039, "text": "C., the information (metadata) contained in the content you shared through our service, including the date, time, or place of the shared photo or video of shooting or uploading.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information contained in the content shared through our service."}
{"task": "rw_8.jsonl", "id": 39040, "text": "1.5 Bluetooth", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39041, "text": "If you already have related hardware devices (whether or not you are, Keep, brand), you hope to record the information recorded by the hardware product (including heart rate, sleep information, steps, exercise data, weight, BMI's personal information and personal physical data that has been uploaded uploaded, and personal physical data) Synchronization to, kep, app, and can be implemented by turning on Bluetooth function.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you already have related hardware devices, you can simultaneously synchronize the information recorded by the hardware product to the KEEP APP by turning on the Bluetooth function."}
{"task": "rw_8.jsonl", "id": 39042, "text": "If you refuse to open, it will only make you unable to use this function, but it does not affect your normal use, Keep, other functions.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to turn on permissions, it will only make you unable to use this function, but it does not affect other functions."}
{"task": "rw_8.jsonl", "id": 39043, "text": "At the same time, you can also cancel the permissions at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can also cancel the permissions at any time through related functional settings."}
{"task": "rw_8.jsonl", "id": 39044, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the corresponding service."}
{"task": "rw_8.jsonl", "id": 39045, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the processing and storage of information based on your previous authorized information.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Unless you delete your information in accordance with the law, it will not affect the processing and storage of information we have authorized based on your previous authorization."}
{"task": "rw_8.jsonl", "id": 39046, "text": "1.6 Pay order, payment and order management services", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39047, "text": "When you buy goods or services in Keep App, we will generate orders you purchase the product or service.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39048, "text": "In order to send you the goods and provide after -sales service after the order is placed, you need to fill in the consignee's name, the receiving address and the mobile phone number of the consignee during the order.Service information, order time, the amount you actually pay, and the payment method you use.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to send you the goods and provide after -sales service, we will collect the consignee information and order information you filled in."}
{"task": "rw_8.jsonl", "id": 39049, "text": "You can buy goods or services for others through Keep APP, and please obtain its consent before providing personal information of others.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39050, "text": "1.7 community", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39051, "text": "When you comment in the community, we will collect the text and pictures of your comments.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the text and pictures you comment."}
{"task": "rw_8.jsonl", "id": 39052, "text": "We hereby prompt you that you will be published publicly during your comments, such as personal information will bring you a certain risk.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39053, "text": "Therefore, it is recommended that you carefully consider in the comments whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39054, "text": "If you publish the information involved in other natural persons or children's personal information, you need to obtain the consent of the natural person or the child guardian before the release.", "label": ["Specific Audiences", "Important"], "rewrite": "Involving other natural persons or children's personal information, you need to obtain the consent of the natural person or the child guardian before release."}
{"task": "rw_8.jsonl", "id": 39055, "text": "1.8 Message and evaluation", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39056, "text": "When you buy goods or services, Keep, APP, feedback or evaluate comments, we will collect your message and comments on the product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your messages and comments on the product after purchasing products or services."}
{"task": "rw_8.jsonl", "id": 39057, "text": "Here we remind you that because the message and comments on the product are published publicly, such as the personal information will bring you a certain risk.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39058, "text": "Therefore, it is recommended that you carefully consider in comments and comments whether to share or even share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39059, "text": "If you publish the information involved in other natural persons or children's personal information, you need to obtain the consent of the natural person or the child guardian before the release.", "label": ["Specific Audiences", "Important"], "rewrite": "Involving other natural persons or children's personal information, you need to obtain the consent of the natural person or the child guardian before release."}
{"task": "rw_8.jsonl", "id": 39060, "text": "1.9 Customer Service Complaint", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39061, "text": "To ensure your account security, our call center customer service and online customer service will use your avatar and nickname to verify your identity.", "label": ["Important", "Data Security"], "rewrite": "To ensure your account security, we will use your avatar and nickname to verify your identity."}
{"task": "rw_8.jsonl", "id": 39062, "text": "When you need us to provide customer service and after -sales service related to your transaction information, we will query your order information (including the name of the consignee, the receiving address, the consignee's mobile phone number, the order number, the product or service you buyInformation, order time, the amount you actually pay, and the payment method you use).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you need us to provide customer service and after -sales service related to your transaction information, we will check your order information."}
{"task": "rw_8.jsonl", "id": 39063, "text": "At the same time, we will collect the information you provide when you contact your customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you provided when you contact your customer service."}
{"task": "rw_8.jsonl", "id": 39064, "text": "You do not provide the above information, our customer service will not be able to provide you with the aforementioned service, but it does not affect the other services you provide.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you do not provide the above information, our customer service will not be able to provide you with the aforementioned service, but it will not affect other services."}
{"task": "rw_8.jsonl", "id": 39065, "text": "1.10 advertising service", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39066, "text": "In order to provide you with more convenient and more information display, search and push services that are more convenient and more in line with your personalized needs, we may send you commercial services/promotional information, the latest platforms related to the platform through telephone, text messages, and in -site information methods.Management, product content and other considers the need to inform the registered user's service notification.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39067, "text": "In order to provide you with a better service and user experience, we may associate your, Keep, account, browsing information, fitness needs, and your personal information (including service logs, equipment information) you authorize us to be associated and carried outData analysis is used to form a user portrait to recommend products or services that you are interested in.", "label": ["Important", "Usage"], "rewrite": "In order to provide you with a better experience, we will use your authorized personal information to analyze data analysis to form user portraits."}
{"task": "rw_8.jsonl", "id": 39068, "text": "We promise that without obtaining your authorization consent, we will not provide your portrait information to any third direction to push you personalized advertising information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your authorization consent, you will not provide your portrait information to any third party."}
{"task": "rw_8.jsonl", "id": 39069, "text": "We strive to ensure your browsing experience. If you don't want to accept the commercial advertisement we send to you, you can reply to the withdrawal or other methods provided by SMS prompts to be withdrawn or close.", "label": ["Edit/Control", "Important"], "rewrite": "If you don't want to accept the commercial advertisement we send to you, you can be withdrawn or close in the relevant method."}
{"task": "rw_8.jsonl", "id": 39070, "text": "1.11 Sport data synchronization", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39071, "text": "Under the premise that the third -party software is synchronized to the synchronization of the third -party software to, the type of sports data types and the type of sports data, we will obtain the motion data generated by your third -party software from third -party software and synchronize it to you, Keep.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of getting your authorization, we will obtain the generating data generated from third -party software and synchronize to your Keep."}
{"task": "rw_8.jsonl", "id": 39072, "text": "1.12 Customized Movement Program Service", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39073, "text": "If you use our curriculum planning service, we will collect your height information, exercise goals, the longest distance of a single run, and the length of the tablet to recommend more suitable physical fitness plans.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your height information, exercise goals, the longest distance of a single run, and the length of the tablet to provide you with related services."}
{"task": "rw_8.jsonl", "id": 39074, "text": "If you want us to record the changes in your body at the same time, you can actively provide bust, waist, hip circumference, static heart rate, maximum heart rate, thighs, calf surrounding data, and check related information in our products.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can take the initiative to provide bust, waist, hips, static heart rate, maximum heart rate, thighs, calf fence data, and check related information in our products."}
{"task": "rw_8.jsonl", "id": 39075, "text": "1.13, if you apply for authentication services using the creator identity authentication of the creative center, we need you to take the initiative to provide the real name, the front and back photos of the ID card (including name, birth date, nation, address, ID card validity period, ID number, gender, gender), Passport (including name, date of birth, nationality, passport number, validity period of passport, gender, place of birth, distribution authority), handheld ID card photos or passport photos, and collect the above information. If you refuse to take the initiative to take the initiative for usIf you provide the above information, we will not collect your corresponding information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need you to provide the real name, the front and back photos, passports, handheld ID photos or passport photos of the ID card and collect the above information. If you refuse to provide us with the initiative to provide the above information, we will not collect your aboveCorresponding information."}
{"task": "rw_8.jsonl", "id": 39076, "text": "4. The permissions obtained by the Keep app", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39077, "text": "1. Storage permissions", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39078, "text": "(1) Read_external_storage (read external memory)", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39079, "text": "In order to provide you with a full range of sports experience, after your authorization, our client will upload the videos, pictures, preservation dynamics, avatars, and video videos that you actively upload to the server for external storage;", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "After your authorization, we will upload videos, pictures, pictures, saving dynamics, avatars, and video videos to the server for external storage."}
{"task": "rw_8.jsonl", "id": 39080, "text": "The software name and version number in your device may be collected, and uploaded to the server by encryption to the server for processing and storage.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the software name and version number in your device and upload to the server by encrypted and store."}
{"task": "rw_8.jsonl", "id": 39081, "text": "(2) WRITE_EXTERNAL_STORAGE", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39082, "text": "In order to provide you with the function of writing external storage, after your authorization, we will write/download/save/modify/delete pictures, files, and collapse log information.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will obtain permissions such as writing/download/save/modify/delete pictures, files, and collapse log information."}
{"task": "rw_8.jsonl", "id": 39083, "text": "You can also refuse/cancel the permissions at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can always refuse/cancel the permissions at any time."}
{"task": "rw_8.jsonl", "id": 39084, "text": "Refusing to provide this permission only makes you unable to use the above features, but it does not affect the normal use of the key, other functions and services;", "label": ["Important", "Edit/Control"], "rewrite": "Refusing to provide this permission only makes you unable to use the above functions, but does not affect the normal use of other functions."}
{"task": "rw_8.jsonl", "id": 39085, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the corresponding service."}
{"task": "rw_8.jsonl", "id": 39086, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the storage or processing of information we have authorized based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Unless you delete your information in accordance with the law, it will not affect the storage or processing of information we have authorized before."}
{"task": "rw_8.jsonl", "id": 39087, "text": "2. Camera permissions", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39088, "text": "When you use scanning QR codes, shooting photos, and video features, we will visit the camera permissions of your device and read your uploading to us based on scanning QR codes, shooting photos, saving dynamics, avatars, video videos, and video videos.Pictures and video information.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will visit the camera permissions of your device and read the pictures and video information you uploaded to us based on scanning QR codes, shooting photos, saving dynamics, avatars, and video videos."}
{"task": "rw_8.jsonl", "id": 39089, "text": "If you refuse to provide permissions and content, it will only make you unable to use this function, but it does not affect your normal use, Keep, other functions.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to provide permissions and content, it will only make you unable to use this function, but it does not affect other functions."}
{"task": "rw_8.jsonl", "id": 39090, "text": "At the same time, you can also cancel the permissions at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can also cancel the permissions at any time through related functional settings."}
{"task": "rw_8.jsonl", "id": 39091, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_8.jsonl", "id": 39092, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the processing and storage of information based on your previous authorized information.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of information based on your previous authorization, except for laws."}
{"task": "rw_8.jsonl", "id": 39093, "text": "3. Position permission", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39094, "text": "You can authorize to open the device positioning function, access rough position function, and access the background position function and use the relevant services provided by the above functions (including outdoor running, outdoor walking, outdoor cycling). Of course, you can also turn off the positioning function at any time at any timeStop our collection of your geographical information.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can authorize to open the device positioning function, access rough position function, access the background position function and use the relevant services provided by the above functions. Of course, you can also stop our collection of your geographical location information at any time by closing the positioning function."}
{"task": "rw_8.jsonl", "id": 39095, "text": "You can allow us to access your activity and physical training records, and record steps and step information by reading your activities and physical training.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can allow us to access your activities and physical training records, record steps and step information."}
{"task": "rw_8.jsonl", "id": 39096, "text": "At the same time, you can also cancel the permissions at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can also cancel the permissions at any time through related functional settings."}
{"task": "rw_8.jsonl", "id": 39097, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_8.jsonl", "id": 39098, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the processing and storage of information based on your previous authorized information.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of information based on your previous authorized information, except for the law."}
{"task": "rw_8.jsonl", "id": 39099, "text": "4. Microphone permission", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39100, "text": "When you use the recording video function, we will access your device microphone and recording -related permissions, and we need to collect your voice information and voice interaction information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will obtain your device microphone and recording related permissions, and we need to collect your voice information and voice interaction information."}
{"task": "rw_8.jsonl", "id": 39101, "text": "If you refuse to provide, it will only make you unable to use this function, but it does not affect your normal use, Keep, other functions.", "label": ["Edit/Control", "Important"], "rewrite": "If you refuse to provide, it will only make you unable to use this function, but it does not affect other functions."}
{"task": "rw_8.jsonl", "id": 39102, "text": "At the same time, you can also cancel the permissions at any time.", "label": ["Edit/Control", "Important"], "rewrite": "You can also cancel the permissions at any time."}
{"task": "rw_8.jsonl", "id": 39103, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_8.jsonl", "id": 39104, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the processing and storage of information based on your previous authorized information.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of information based on your previous authorized information, except for the law."}
{"task": "rw_8.jsonl", "id": 39105, "text": "5. Phone permissions", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39106, "text": "When you use our intelligent hardware (such as: bracelet), we will access your phone permissions to read your phone status and apply for your answering phone permissions to provide the function of answering calls.", "label": ["Permission Acquisition", "Important"], "rewrite": "When using smart hardware functions, visit your phone permissions to read the phone status and apply for your answering phone permissions to provide the function of answering calls."}
{"task": "rw_8.jsonl", "id": 39107, "text": "At the same time, you can also cancel the permissions at any time.", "label": ["Edit/Control", "Important"], "rewrite": "You can also cancel the permissions at any time."}
{"task": "rw_8.jsonl", "id": 39108, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_8.jsonl", "id": 39109, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the processing and storage of information based on your previous authorized information.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the processing and storage of information based on your previous authorized information, except for the law."}
{"task": "rw_8.jsonl", "id": 39110, "text": "Note that you can pay attention: You can \"set\" in the upper left corner-\"Privacy\"-\"Management of Equipment Privacy Authorization\" page, withdraw/refuse to grant KEEP, access to the device information (including location, camera, album, microphone, local network)Essence", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw/refuse to grant the device information of the device information that Keep access at any time."}
{"task": "rw_8.jsonl", "id": 39111, "text": "If you refuse to provide this permission, it will only make you unable to use the above features, but it does not affect the normal use of the key, other functions and services;", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to provide this permissions, it will only make you unable to use the above functions, but it does not affect other functions."}
{"task": "rw_8.jsonl", "id": 39112, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services."}
{"task": "rw_8.jsonl", "id": 39113, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the storage or processing of information we have authorized based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the storage or processing of information based on your previous authorized information, except for laws."}
{"task": "rw_8.jsonl", "id": 39114, "text": "5. Non -personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39115, "text": "We may also collect other information that cannot be identified and does not belong to individual information, such as statistical data generated when you use specific services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect other information that cannot recognize specific individuals and does not belong to personal information."}
{"task": "rw_8.jsonl", "id": 39116, "text": "The purpose of collecting such information is to improve the services we provide to you.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39117, "text": "The category and quantity of the collected information depends on how you use our products or services.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39118, "text": "6. According to relevant laws and regulations and national standards, in the following situations, we may collect and use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and using your relevant personal information is based on relevant laws and regulations and national standards, and no authorization consent is required."}
{"task": "rw_8.jsonl", "id": 39119, "text": "1. In order to establish and fulfill the contract as a party as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to establish and fulfill the person's contract as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law and the collective contracts formulated in accordance with the law, there is no need to solicit authorization."}
{"task": "rw_8.jsonl", "id": 39120, "text": "2. In order to fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to fulfill the statutory duties or the necessary situations necessary for the legal duty, there is no need to solicit authorization consent."}
{"task": "rw_8.jsonl", "id": 39121, "text": "3. In order to cope with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to cope with emergencies, or in urgent situations, in order to protect the life and health of natural persons and property security, there is no need to solicit authorization consent."}
{"task": "rw_8.jsonl", "id": 39122, "text": "4. Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "For public interests to implement news reports and public opinion supervision, it is not necessary to solicit authorization consent within a reasonable scope."}
{"task": "rw_8.jsonl", "id": 39123, "text": "5. Treatment of personal information that individuals are disclosed or other legally disclosed in accordance with the provisions of this Law;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In accordance with the provisions of this Law, it is not necessary to solicit authorization to the individual's self -disclosure or other legal information that has legal information."}
{"task": "rw_8.jsonl", "id": 39124, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Other circumstances stipulated in laws and administrative regulations do not require authorization consent."}
{"task": "rw_8.jsonl", "id": 39125, "text": "7. We promise", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39126, "text": "1. We will not show you advertisements based on sensitive categories (such as race, religion, sexual orientation or health status).", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39127, "text": "2. We will not share information with advertisers to identify your personal identity, such as your name or email address (unless you are authorized);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not share with advertisers to identify information that can be used to identify your personal identity."}
{"task": "rw_8.jsonl", "id": 39128, "text": "3. At any time or under any circumstances, we will not transmit or share your personal information to any third party. We will only use information obtained based on this agreement within the scope allowed by law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only use your personal information within the scope permitted by law and will not transmit or share to any third party."}
{"task": "rw_8.jsonl", "id": 39129, "text": "We will formulate strict policies to protect your personal information. Unless you get your authorization or other regulations in advance, you will not make your information publicly or provide to third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will protect your personal information and will not provide your information publicly or provided to third parties unless you get your authorization in advance."}
{"task": "rw_8.jsonl", "id": 39130, "text": "4. The third -party services in the key in Keep, APP, and services are provided by the external third -party subject. Keep, APP, cannot obtain information you generate when using this class of third -party services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Keep app cannot get information you generate when using external third -party services."}
{"task": "rw_8.jsonl", "id": 39131, "text": "However, if you have explicitly agreed that the third party will get your geographical location information, the third party will obtain your terminal geographical location information through Keep and APP interfaces.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you agree with the third party to get your geographical location information, the third party will obtain your terminal geographical location information through the Keep APP interface."}
{"task": "rw_8.jsonl", "id": 39132, "text": "This information is a sensitive information. The refusal to provide this information will only make you unable to use the above third -party services, but it does not affect your function of using Keep and APP normally.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Refusing to provide location information only makes you unable to use the above third -party services, but it does not affect the function of your normally using the Keep APP."}
{"task": "rw_8.jsonl", "id": 39133, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and your information is collected, we will explain the content, scope and purpose of the information collection to you to obtain your consent."}
{"task": "rw_8.jsonl", "id": 39134, "text": "Please note that the personal information processing activities needed for the business required for the business of the APP are beyond your authorization consent when you originally provided personal information to the third party. We will obtain your explicit consent before handling your personal information.Items", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For example, the personal information processing activity required for the KEEP App to carry out business is beyond the scope of the original authorization consent, and we will first obtain your explicit consent."}
{"task": "rw_8.jsonl", "id": 39135, "text": "In addition, we will also strictly abide by the provisions of relevant laws and regulations, and require a third party to ensure the legality of the information provided.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will protect the legitimacy of the information provided by a third party in accordance with the law."}
{"task": "rw_8.jsonl", "id": 39136, "text": "5. Unless we have a separate consent, we will not provide your personal information to anyone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not provide your personal information unless you get consent."}
{"task": "rw_8.jsonl", "id": 39137, "text": "2. How can we entrust your personal information to deal with, share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39138, "text": "1. Entrust your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39139, "text": "In order to improve efficiency and reduce costs, we may entrust related parties to handle information on behalf of us. For example, we will hire our affiliates to provide us with infrastructure technical services and customer support services.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39140, "text": "For companies, organizations, and individuals who commission our personal information, we will require them to abide by strict confidentiality obligations and take effective confidentiality measures through written agreements and on -site audit methods.Do not use your information for its own interests and supervise the trustee's personal information processing activities.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For companies, organizations, and individuals who commission our personal information, they require that they can only process your information within the scope of the commission, instead of using your information for their own interests and supervise the trustee's personal information processing activities."}
{"task": "rw_8.jsonl", "id": 39141, "text": "When the entrusted contract does not take effect, is invalid, was revoked or terminated, we will ask the trustee to return personal information or delete personal information, and we must not be retained.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "When the contract does not take effect, invalidity, cancellation or termination, we will require the recipient to return personal information and not be retained."}
{"task": "rw_8.jsonl", "id": 39142, "text": "Our trustee includes:", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39143, "text": "1.1, authorized partners of push services in the application: Push partners will use the services provided by us, SDK, (software program development package) (including Tencent player, Hele broadcast screen, etc. For details, please refer to the third -party SDK service list), You may visit your system language, network type, IP, address, album, equipment information, external storage status, recent geographical location information, network location information, continuous positioning, wifi, information, application installation list, but not notWill collect your personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "WIFI information, application installation list, but will not collect your personal identity information."}
{"task": "rw_8.jsonl", "id": 39144, "text": "This information is used to create internal user numbers to help us better push accurate information, avoid repeated delivery information, and cause information interference.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "This information is to help us better push accurate information to avoid repeated delivery information."}
{"task": "rw_8.jsonl", "id": 39145, "text": "1.2 Authorized partners of statistical services: Statistics partners will use it in the services we provide, SDK, (software program development package) (including divine strategy statistics).IDFV, but will not collect your personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Statistical partners will use SDK in the services we provide, which may visit your network types, WIFI information, IDFA, IDFV, but will not collect your personal identity information."}
{"task": "rw_8.jsonl", "id": 39146, "text": "This information is to help us analyze the use of product functions, so as to better improve our products and/or services, and improve your user experience.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39147, "text": "2. Sharing", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39148, "text": "In addition to the personal information we take the initiative, you pass the information uploaded by, key, apps, published texts, uploaded photos and videos, and information uploaded during the use of social network services.The \"Personal Information Protection Law\" and other laws and regulations and regulatory policy requirements will not collect your information for other business purposes or information sharing, but when it meets the relevant national laws and regulations and its policy requirements or relevant national departments,When required, we will use your information within the scope permitted by the law, such as retrieval and screening whether there are contents that do not comply with laws, regulations, and violation of public order and customs.Information stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The text, uploaded photos and videos published by the Keep app, and the information uploaded during the use of social network services, we are only used as data to serve in the server. We will not collect your information for other business purposes or information.Share, but except for laws."}
{"task": "rw_8.jsonl", "id": 39149, "text": "Please consider the content of uploading, publishing and communicating through our services.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39150, "text": "In some cases, you can control the privacy settings of some of our services to control the scope of user scope of your shared information.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39151, "text": "You can delete the information you uploaded, published or shared. If you ask us to delete your relevant information, please send emails, feel backback@Keep.com, contact us and make your request, we will be after receiving it15. Complete and verify and deal with them within working days.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete the information you upload, publish or share, or contact us to ask us to delete your relevant information for you."}
{"task": "rw_8.jsonl", "id": 39152, "text": "We will not provide your personal information to other personal information processors.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39153, "text": "In the following circumstances, when we will provide your personal information to other third -party personal information processors, we will tell you the name or name, contact information of the receiver involved in a single scenario in a single scenario in a pop -up window and increase notification., Types of processing purposes, processing methods and personal information, and obtain your separate consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When we will provide your personal information to other third -party personal information processors, we will inform you of the name or name of the receiver, name, contact information, processing purpose, processing method, and personal information, and get your separate consent."}
{"task": "rw_8.jsonl", "id": 39154, "text": "At present, our authorized partners mainly include the following types:", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39155, "text": "2.1 Sensor application scenario declaration", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39156, "text": "Sensor type Chinese name application scenario receiver", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39157, "text": "Type_Step_counter Step out sensor Daily step data access to help users record daily walking, users can upload offline step data Keep independently", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39158, "text": "Type_Step_detector step -by -time sensor running outdoors and walking are used to record the number of steps and steps of the user's outdoor sports, and it is estimated to consume data Keep accordingly", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39159, "text": "Type_accelerometer accelerates the sensor outdoor running, walking, cycling, calculates outdoor sports frequency, pace, consumption, etc. based on step information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39160, "text": "Type_magnetic_field Sensor Outdoor running, walking, and riding when outdoors, draw user sports map Keep according to the orientation information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39161, "text": "Type_pressure Pneumatic sensor Outdoor running, walking, and cycling, obtain altitude information according to air pressure, and calculate the altitude and climb distance in outdoor sports according to this", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39162, "text": "Type_Gyroscope is used for outdoor running, walking, and riding. Calculate and modify the speed of outdoor sports at the angle of the gyroscope, the speed information of the outdoor sports, the acceleration information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39163, "text": "2.2 Sharing with third -party service providers and business partners", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39164, "text": "To ensure the services described by the purpose of this privacy policy, we may share the necessary personal information from third -party service providers such as third -party service providers and business partners.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "To ensure the services described by the purpose of this privacy policy, we may share the necessary personal information from a third party."}
{"task": "rw_8.jsonl", "id": 39165, "text": "This includes our logistics suppliers, data centers, data storage facilities, customer service providers, advertising and marketing service providers, and other business partners, such as: Alipay (China) Network Technology Co., Ltd., Shenzhen Tencent Computer System Co., Ltd., Guangzhou NetEase Computer System Co., Ltd., Beijing Weimeng Chuangke Network Technology Co., Ltd., Gaode Software Co., Ltd., Huawei Technology Co., Ltd., Xiaomi Technology Co., Ltd., etc.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third parties to shared data include our logistics suppliers, data centers, data storage facilities, customer service providers, advertising and marketing service providers, and other business partners."}
{"task": "rw_8.jsonl", "id": 39166, "text": "These third parties may represent your personal information for one or more projects of this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "These third parties may process your personal information."}
{"task": "rw_8.jsonl", "id": 39167, "text": "We guarantee that we only provide you with the necessary personal information for you to provide you only for the right, legal, necessary, specific, and clear purpose sharing.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It is guaranteed to provide you with the necessary personal information for you to provide you only for the right, legal, necessary, specific, and clear purpose."}
{"task": "rw_8.jsonl", "id": 39168, "text": "Keep, APP will conduct due diligence and sign contracts to ensure that third -party service providers comply with relevant national laws and regulations and their policy requirements or relevant national departments.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The KEEP APP will ensure that third -party service providers comply with relevant national laws and regulations and their policy requirements or relevant national departments."}
{"task": "rw_8.jsonl", "id": 39169, "text": "Third -party service providers may also have their son -in -law.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39170, "text": "Marketing authorized partners: When you choose to participate in the relevant marketing activities we organize, you need to provide you in the event of the name, communication address, contact information, and bank account information in order to provide you with prizes in time.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In marketing activities, you need to provide name, communication address, contact information, and bank account information so that third -party logistics companies can provide you with prizes in time."}
{"task": "rw_8.jsonl", "id": 39171, "text": "After your individual consent, we will share the above information with the third party so that third parties will provide you with prizes in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your consent, we will share the above information with a third party so that third parties will provide you with prizes in time."}
{"task": "rw_8.jsonl", "id": 39172, "text": "In order to provide results measurement, analysis and other business services, we may also share information (non -personal information) with third parties (such as our advertisers) in a summary.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may also share information with third parties in the form of summary."}
{"task": "rw_8.jsonl", "id": 39173, "text": "We use the information we have controlled to help advertisers and other partners evaluate the effectiveness and coverage of their advertising and services, and understand how the type of crowds they use and how people interact with their websites, applications and services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We use information to help partners evaluate the effectiveness of their advertising and services, and understand the types and interaction of the crowds used by them."}
{"task": "rw_8.jsonl", "id": 39174, "text": "We may also share the general use trend of our services with them, such as the number of customers who buy certain products or engaged in certain transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may also share the general use trend of our services with them."}
{"task": "rw_8.jsonl", "id": 39175, "text": "In the case of access to third -party services, we may access third -party SDK services and share certain information we collected in accordance with this policy with these third -party service providers in order to improve a better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may access third -party SDK services and share certain information we collected in accordance with this policy with these third -party service providers."}
{"task": "rw_8.jsonl", "id": 39176, "text": "If you want to withdraw the consent authorization of your sharing information during your use, you can decide whether to change your authorization behavior through the \"settings\"-\"privacy\"-\"third-party data cooperation\" in the upper left corner.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can set the consent authorization of your sharing information yourself."}
{"task": "rw_8.jsonl", "id": 39177, "text": "If you refuse to make you unable to use the withdrawal function that has been withdrawn, but it does not affect the normal use of Keep, other functions and services;", "label": ["Important", "Edit/Control"], "rewrite": "You refuse to only make you unable to use the withdrawal function that has been withdrawn, but does not affect the normal use of other features of Keep."}
{"task": "rw_8.jsonl", "id": 39178, "text": "But when you cancel the authorization, we will no longer collect this information, nor can it provide you with the above -mentioned services;", "label": ["Important", "Edit/Control"], "rewrite": "After you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the corresponding service."}
{"task": "rw_8.jsonl", "id": 39179, "text": "But unless you delete your information in accordance with the law, your cancellation behavior will not affect the storage or processing of information we have authorized based on your previous authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your cancellation will not affect the storage or processing of information based on your previous authorized information, except for laws."}
{"task": "rw_8.jsonl", "id": 39180, "text": "3. Transfer", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39181, "text": "If we need to transfer personal information for reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you that the name or name and contact information of the receiver will be asked to the receiver.Fang changed the original treatment purpose and method of treatment, and we will ask for re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer personal information, we will inform you the relevant information of the receiver and ask the receiver to continue to perform the obligation of personal information processors. If there is a change, you will re -obtain your consent."}
{"task": "rw_8.jsonl", "id": 39182, "text": "4. Public disclosure", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39183, "text": "We will not disclose your personal information unless you get your alone consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Discover your personal information under the disclosure of your consent."}
{"task": "rw_8.jsonl", "id": 39184, "text": "3. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39185, "text": "1. Location of information storage", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39186, "text": "The information obtained from the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The information obtained from the People's Republic of China is stored in the People's Republic of China."}
{"task": "rw_8.jsonl", "id": 39187, "text": "At present, we will not transmit your personal information abroad.", "label": ["Data Retention", "Important"], "rewrite": "We will not transmit your personal information abroad."}
{"task": "rw_8.jsonl", "id": 39188, "text": "2. The period for information storage", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39189, "text": "We promise to store your personal information within a reasonable and necessary period in accordance with the law.", "label": ["Data Retention", "Important"], "rewrite": "We will store your personal information within a reasonable and necessary period in accordance with the law."}
{"task": "rw_8.jsonl", "id": 39190, "text": "After exceeding the above period, we will delete your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the above period, we will delete your personal information."}
{"task": "rw_8.jsonl", "id": 39191, "text": "When our products or services stop operating, we will notify you in the form of push notifications, announcements and other forms, and delete your personal information within a reasonable period.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "When stopping operations, we will notify you to delete your personal information within a reasonable period."}
{"task": "rw_8.jsonl", "id": 39192, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39193, "text": "1. We strive to provide protection for user information security to prevent information from leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Important", "Data Security"], "rewrite": "We strive to provide support for users' information security."}
{"task": "rw_8.jsonl", "id": 39194, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technical protection methods, management system control, security system guarantee, etc. At the same timeEssence", "label": ["Important", "Data Security"], "rewrite": "We will ensure that the protection of users' personal information is at a reasonable level of security, and at the same time, the impact of personal information protection is performed according to the requirements of regulations."}
{"task": "rw_8.jsonl", "id": 39195, "text": "2. In order to protect your personal information security, we will strive to take various security measures that meet industry standards to protect your personal information to maximize your personal information being lost, damaged, stolen, leaked, non -authorized access, non -authorized visits,Risk of use, disclosure and change.", "label": ["Important", "Data Security"], "rewrite": "We will strive to take various security measures to protect your personal information and reduce risks."}
{"task": "rw_8.jsonl", "id": 39196, "text": "We will use various security protection measures within a reasonable level to ensure the security of information, including: (1) using encrypted technology (such as, TLS,), anonymous processing, etc.Private;", "label": ["Important", "Data Security"], "rewrite": "We will use various security protection measures within a reasonable security level to ensure information security."}
{"task": "rw_8.jsonl", "id": 39197, "text": "(2) Provide a variety of security functions to help you protect your account security;", "label": ["Important", "Data Security"], "rewrite": "Provide a variety of security functions to help you protect your account security."}
{"task": "rw_8.jsonl", "id": 39198, "text": "(3) Examine our practices (including physical security measures) in collecting, storing and processing information to prevent unauthorized personnel from accessing our system;", "label": ["Important", "Data Security"], "rewrite": "Examine our practice in collecting, storing and processing information to prevent unauthorized personnel from accessing our system."}
{"task": "rw_8.jsonl", "id": 39199, "text": "(4) Keep, employees, contractors, and agents who must contact personal information for services, all need to comply with the strict confidentiality obligations specified in the contract, otherwise they can be punished or unblocked;", "label": ["Important", "Data Security"], "rewrite": "Keep employees, contractors and agents who contact personal information all need to obey the confidentiality obligations in the contract, otherwise they will be punished."}
{"task": "rw_8.jsonl", "id": 39200, "text": "(5) We establish data classification hierarchical system, data security management specifications, and data security development specifications to manage the storage and use of personal information to ensure that personal information that has nothing to do with the services we provided.", "label": ["Important", "Data Security"], "rewrite": "We use various ways to manage the storage and use of personal information to ensure that personal information has not been collected without collecting services we provided."}
{"task": "rw_8.jsonl", "id": 39201, "text": "3. Your account has a security protection function, please keep your account and password information properly.", "label": ["Important", "Data Security"], "rewrite": "Your account has a security protection function, please keep your account and password information properly."}
{"task": "rw_8.jsonl", "id": 39202, "text": "Keep will ensure that your information is not lost and will not be abused and altered by backup security measures such as backup and encryption of user passwords.", "label": ["Important", "Data Security"], "rewrite": "Keep will ensure that your information is not lost, and it will not be abused and altered through various security measures."}
{"task": "rw_8.jsonl", "id": 39203, "text": "Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant laws have been adopted, please understand that due to the technical restrictions and various malicious means of malicious means, in the Internet industry, even if you can do your best to strengthen security measures, you can strengthen your security measures, and you can strengthen your security measures.It is also impossible to ensure that the information is 100 % security, and we will try our best to ensure the security of the personal information you provide.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39204, "text": "You confirm that you know and understand that the systems and communication networks you use to access our services are likely to have problems due to factors outside of our controllable range.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39205, "text": "Therefore, in order to prevent safety accidents, we have formulated a proper early warning mechanism and emergency plan in accordance with the provisions of laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "We have formulated a proper early warning mechanism and emergency plan in accordance with the provisions of laws and regulations."}
{"task": "rw_8.jsonl", "id": 39206, "text": "If a security incident is confirmed, we will inform you in a timely manner to select the relevant situation by email, telephone, push notification, etc. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "If a security incident is confirmed, we will inform you or issue an announcement in time."}
{"task": "rw_8.jsonl", "id": 39207, "text": "At the same time, we will also actively report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities, and closely cooperate with the work of government agencies.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_8.jsonl", "id": 39208, "text": "At the same time, we strongly recommend that you pay full attention to the protection of personal information when using products and services, and take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modifying passwords, not your account password and other personal information disclosure.Give others.", "label": ["Important", "Data Security"], "rewrite": "We strongly recommend that you pay full attention to the protection of personal information when using products and services, and take positive measures to protect the security of personal information."}
{"task": "rw_8.jsonl", "id": 39209, "text": "We will also provide a variety of security functions to help you protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39210, "text": "4. We have obtained the evaluation and filing of national network security level protection (level three), in terms of information security in terms of information security, and have obtained corresponding certificates.", "label": ["Important", "Data Security"], "rewrite": "Our information security has reached the requirements of domestic authoritative certification standards and has obtained corresponding certificates."}
{"task": "rw_8.jsonl", "id": 39211, "text": "We use industry -leading technical protection measures. The technical means we use include, but not limited to network firewalls, encryption (such as TLS), de -identification or anonymous treatment, access control measures, host network isolation, etc.", "label": ["Important", "Data Security"], "rewrite": "We adopt industry -leading technical protection measures."}
{"task": "rw_8.jsonl", "id": 39212, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39213, "text": "For example, we will complete some information encryption work locally to consolidate security transmission.", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_8.jsonl", "id": 39214, "text": "5. We strictly restrict the scope of the personnel of the information, ask them to obey the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "We strictly restrict the scope of the personnel accessing information, asking them to abide by the confidentiality obligations and audit, and the violation of obligations will be punished."}
{"task": "rw_8.jsonl", "id": 39215, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "We will also review the management system, processes and organizations to prevent other people from accessing, using or disclosing users' information."}
{"task": "rw_8.jsonl", "id": 39216, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": ["Important", "Data Security"], "rewrite": "We will also provide a variety of security functions to help you protect your personal information security."}
{"task": "rw_8.jsonl", "id": 39217, "text": "6. What can you do?", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39218, "text": "You can disclose your login password or account information without anyone (unless this person is officially authorized), and you can set the unique password for the Keep APP to prevent other websites from leaking the account security of your account on Keep APP.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39219, "text": "Whenever you disclose the verification code you received from anyone (including those who claim to be Keep APP customer service).", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39220, "text": "Whenever you log in to the Keep APP as a Keep APP account user, especially when you log in on the computer, mobile phone, or public Internet terminal, you should always cancel and log in at the end of use.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39221, "text": "The Keep app is not responsible for the security omissions caused by a third -party access to your personal information due to your failure to maintain the privacy of your personal information.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39222, "text": "Despite the above provisions, if any other Internet users have unauthorized use of your account or any other security vulnerabilities, you should immediately notify us.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39223, "text": "Your assistance will help us protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39224, "text": "5. Your personal rights rights", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39225, "text": "We attach great importance to your management of personal information and do our best to protect your personal information inquiry, update, change, export, delete, and withdraw your consent, so that you have full ability to maintain your privacy and personal information security.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39226, "text": "1. When you use our products and services, you will be required to provide your true personal information. You should be responsible for the authenticity, legality, validity and integrity of the information you provide, and update and maintain your time in timePersonal information to ensure the authenticity, legality and effectiveness of the information.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39227, "text": "You can manage your personal information at any time, such as your personal account registration information.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage your personal information at any time."}
{"task": "rw_8.jsonl", "id": 39228, "text": "2. Through the design of the interactive interface, we provide you with channels that can access, query, and correct related personal information. You can set it in the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "Through the design of the interactive interface, we provide you with channels that can access, query, and correct related personal information."}
{"task": "rw_8.jsonl", "id": 39229, "text": "2.2.1, you can access and correct your personal information through \"Settings\"-\"Personal Information\" in the upper left corner.", "label": ["Edit/Control", "Important"], "rewrite": "You can access and correct your personal information through \"Settings\"-\"Personal Information\" in the upper left corner."}
{"task": "rw_8.jsonl", "id": 39230, "text": "2.2.2, you can set, access, and correct account information through \"Settings\"-\"Account and Security\" in the upper left corner.", "label": ["Important", "Edit/Control"], "rewrite": "You can set, access, and correct account information through \"Settings\"-\"Account and Security\" in the upper left corner."}
{"task": "rw_8.jsonl", "id": 39231, "text": "2.2.3, you can set, access, correct privacy information through \"Settings\"-\"Privacy\" in the upper left corner, including Weibo recommendation settings, location information settings, message acceptance settings, display content settings;", "label": ["Important", "Edit/Control"], "rewrite": "You can set, access, and correct privacy information through the \"settings\"-\"privacy\" settings, access, and correction of privacy information."}
{"task": "rw_8.jsonl", "id": 39232, "text": "2.2.4, you can set, access, and correct related information through \"Settings\"-\"Message and Reminder\" in the upper left corner.", "label": ["Important", "Edit/Control"], "rewrite": "You can set, access, and correct related notification information through the \"settings\"-\"Message and Reminder\" in the upper left corner."}
{"task": "rw_8.jsonl", "id": 39233, "text": "3., you can delete your content or personal information in your own, key, account, or ask us to delete or modify the information. For example, if you want to delete your personal account, you can send mail toAnd put forward your request, we will contact you and complete the verification and processing within 15, and within 15, and we will complete the verification and processing.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete your content or personal information from the Keep account, or ask us to delete or modify the information."}
{"task": "rw_8.jsonl", "id": 39234, "text": "4. In some cases, we will retain the data for a period of time for a period of legal purpose or legal business.", "label": ["Data Retention", "Important"], "rewrite": "We will keep the data for a period of time for a period of limited legal purpose or legal business."}
{"task": "rw_8.jsonl", "id": 39235, "text": "We will try our best to ensure that Keep and services can protect information from accidental or maliciously deleted.", "label": ["Important", "Data Security"], "rewrite": "Make sure that Keep's service can protect information from accidental or maliciously deleted."}
{"task": "rw_8.jsonl", "id": 39236, "text": "Therefore, if you delete some content, we may delete its copy from our current and spare systems within 15, and within 15, and within our working days.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "If you delete some content, we will also delete its copy within 15 days."}
{"task": "rw_8.jsonl", "id": 39237, "text": "5. You can copy and export the content under the name of your personal account at any time or use it for non -, keep, service, you can send emails, contactback@keep.comAfter receiving your contact, 15, complete the verification and processing within 15, complete the check and processing.", "label": ["Important", "Contact Information"], "rewrite": "Email: feedback@keep.com"}
{"task": "rw_8.jsonl", "id": 39238, "text": "6. Withdraw consent", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39239, "text": "You can grant us by submitting the request to be awarded us before the withdrawal, including collecting, using and/or disclosing your personal information we control or control.", "label": ["Important", "Edit/Control"], "rewrite": "You can give us your personal information by submitting a request to withdraw from us."}
{"task": "rw_8.jsonl", "id": 39240, "text": "According to the specific services you use, you can perform related operations by accessing, kep, apps, account management centers or send emails, feedback@Keep.com.", "label": ["Important", "Contact Information"], "rewrite": "Email: feedback@keep.com"}
{"task": "rw_8.jsonl", "id": 39241, "text": "We will process your request within a reasonable time after you make a request, and will not collect, use and/or disclose your personal information according to your request.", "label": ["Important", "Edit/Control"], "rewrite": "After you withdraw authorization, we will process your request within a reasonable time."}
{"task": "rw_8.jsonl", "id": 39242, "text": "Depending on the scope of your withdrawal, it may cause you not to continue to enjoy, Keep, APP, products or services.", "label": ["Important", "Edit/Control"], "rewrite": "Depending on the scope of your withdrawal, it may lead to restricted related functions."}
{"task": "rw_8.jsonl", "id": 39243, "text": "But your decision to withdraw consent or authorization will not affect the effectiveness of personal information processing activities we have carried out based on your consent.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "Your withdrawal authorization will not affect the effectiveness of our previous personal information processing activities."}
{"task": "rw_8.jsonl", "id": 39244, "text": "After you withdraw the privacy policy authorization, we will no longer handle your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "After withdrawal of privacy policies, you will no longer process your personal information."}
{"task": "rw_8.jsonl", "id": 39245, "text": "At the same time, we will delete all your personal information, unless you register, Keep, account, and you will not be able to continue to use, Keep, the product function provided, please do it carefully.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We will delete all your personal information and cannot continue to use the product functions provided by Keep."}
{"task": "rw_8.jsonl", "id": 39246, "text": "7. Logging out service or account", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39247, "text": "If you want to cancel the specific products or services, you can cancel the account through the \"Settings\"-\"Account and Security\"-\"Logging out\" in the upper left corner.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel the account through \"Settings\"-\"Account and Security\"-\"Logging out\" in the upper left corner."}
{"task": "rw_8.jsonl", "id": 39248, "text": "When you cancel your account, we will delete your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "Logging out the account will delete your personal information."}
{"task": "rw_8.jsonl", "id": 39249, "text": "If you want to cancel, Keep, APP, account, due to cancellation, kep, app, account operations will make you unavailable, Keep, APP, full -line products or services, please do it carefully.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "The operation of canceling the Keep APP account will make you unable to use the KEEP APP product or service."}
{"task": "rw_8.jsonl", "id": 39250, "text": "8. respond to your request", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39251, "text": "To ensure safety, we will deal with your request in time after verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39252, "text": "For your reasonable requests, we do not charge fees in principle, but we will charge a certain cost fee as required for multiple repeated and more reasonable limit.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Reasonable requests, in principle, we do not charge fees, repeat and beyond the reasonable request, and will charge a certain cost fee depending on the situation."}
{"task": "rw_8.jsonl", "id": 39253, "text": "For those who need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks or very unrealistic requests to the legitimate rights and interests of others, we may refuse.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "We may refuse those unreasonable requests."}
{"task": "rw_8.jsonl", "id": 39254, "text": "9. Special protection of minors", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39255, "text": "You can open or close the minor model through the \"Settings\"-\"Minor Model\" in the upper left corner. The model will only recommend the content of minor browsing in the community. If you want to close this mode, you need to enter in advanceThe set password can be closed.", "label": ["Specific Audiences", "Important"], "rewrite": "Related settings and content of minor model."}
{"task": "rw_8.jsonl", "id": 39256, "text": "10. The right of personal information processing of the deceased", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39257, "text": "In the case of meeting relevant laws, your close relatives can exercise the rights of your relevant personal information to check, copy, correct, delete, etc.", "label": ["Specific Audiences", "Important"], "rewrite": "The close relatives of the minor can exercise the rights of your relevant personal information to check, copy, correct, delete, etc."}
{"task": "rw_8.jsonl", "id": 39258, "text": "You have other arrangements.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39259, "text": "Six, third -party service providers", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39260, "text": "1. In order to facilitate your access and enrich your experience, there may be products or services provided by third parties.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39261, "text": "You can choose whether to access such content or links, or whether to use the third -party product or service.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Users can choose whether to access such content or links, or whether to use the third -party product or service."}
{"task": "rw_8.jsonl", "id": 39262, "text": "But we have no control over the products or services provided by third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Keep has no control over the products or services provided by a third party."}
{"task": "rw_8.jsonl", "id": 39263, "text": "We cannot control any personal information of your third party.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39264, "text": "The problem of information protection during the use of third -party products or services is not applicable to the management of this policy.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39265, "text": "This policy is not applicable to any information you choose to provide to third parties.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39266, "text": "Please check the privacy protection policy of the third party.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39267, "text": "7. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39268, "text": "Cookie is a small file containing string, which will be sent to your computer when you access the website.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39269, "text": "When you visit the website again, Cookie enables the website to recognize your browser.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39270, "text": "Cookie can also store users' preferences and other information.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39271, "text": "You can reset your browser to reject all, cookies, or when sending, cookies, time prompts.", "label": ["Important", "Edit/Control"], "rewrite": "Users can reject all Cookie, or prompt when sending cookies."}
{"task": "rw_8.jsonl", "id": 39272, "text": "But without cookies, some websites may not work normally.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39273, "text": "Cookie and similar technologies are common common technologies in the Internet.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39274, "text": "When you use, Keep, related services, we may use related technologies to send one or more, cookie, or anonymous identifiers to collect and store your access, use, Keep, time information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use related technologies to collect and store information when you access and use Keep."}
{"task": "rw_8.jsonl", "id": 39275, "text": "We will be regarded as non -personal information collected through cookies and other technologies.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39276, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39277, "text": "1. Ensure the safety and efficient operation of products and services", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39278, "text": "We may set up Cookie or anonymous identifier that guarantees security and ensure security, so that we can confirm whether you log in to the service safely, or whether you encounter illegal behaviors such as stolen or fraud.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39279, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39280, "text": "2. Help you get a easier access experience", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39281, "text": "Using this kind of technology can help you save the steps and processes of personal information and enter search content, such as achieving one -click login process and recording search history.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39282, "text": "3. Recommend, display, and push you what you may be interested in", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39283, "text": "We may use, cookies, and similar technologies to understand your preferences and use habits, and conduct consultation or data analysis to improve product services and user experience.", "label": ["Important", "Usage"], "rewrite": "We may use cookie and other technologies to analyze data to improve product services and user experience."}
{"task": "rw_8.jsonl", "id": 39284, "text": "If you want to withdraw the consent authorization of your sharing information during your use, you can decide whether to change your authorization behavior through the \"settings\"-\"privacy\"-\"show the content I may be interested in\" through the upper left corner.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide whether to change your authorization of information."}
{"task": "rw_8.jsonl", "id": 39285, "text": "4. Log file", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39286, "text": "Like most websites, we collect specific information and save them in the log file.", "label": ["Important", "First Party Collection Information"], "rewrite": "Keep collects specific information and stores in the log file."}
{"task": "rw_8.jsonl", "id": 39287, "text": "Such information may include Internet protocol (IP), address, browser type, Internet service provider, (ISP), reference/exit page, operating system, date/time stamp, and/or click flow data.", "label": ["Important", "First Party Collection Information"], "rewrite": "Such information may include the Internet protocol (IP) address, browser type, Internet service provider (ISP), reference/exit page, operating system, date/time stamp, and/or click stream data will be stored in the log."}
{"task": "rw_8.jsonl", "id": 39288, "text": "We will not associate the log data we collected automatically with the other information we collect.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not associate log data with other information."}
{"task": "rw_8.jsonl", "id": 39289, "text": "5. Mobile analysis", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39290, "text": "In some mobile applications, we use mobile analysis software to better understand the functions of our mobile software in your phone.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39291, "text": "This software may record the following information, such as the frequency of your application, events that occur in the application, cumulative use, performance data, and application collapse.", "label": ["Important", "First Party Collection Information"], "rewrite": "Keep may record the frequency of your program, events that occur in the application, cumulative use, performance data, and application collapse."}
{"task": "rw_8.jsonl", "id": 39292, "text": "We will not associate information stored in the analysis software with any personal information you submitted in mobile applications.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39293, "text": "6 Local storage-HTML5/FLASH", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39294, "text": "We use local storage objects, (LSO), for example, HTML5, or, Flash,, to store content.", "label": ["Data Retention", "Important"], "rewrite": "We use local storage objects such as HTML5 or Flash to store content."}
{"task": "rw_8.jsonl", "id": 39295, "text": "Cooperate with us, Keep, APP, and provide certain functions on the third parties that are provided by your browsing behavior. HTML5, or, Flash, Cookie, to collect and store related information.", "label": ["Data Retention", "Important"], "rewrite": "Third parties will also collect and store relevant information through HTML5 or Flash Cookie."}
{"task": "rw_8.jsonl", "id": 39296, "text": "Various browsers provide their respective management tools to delete, HTML5, local storage objects.", "label": ["Data Retention", "Important"], "rewrite": "Various browsers provide their respective management tools to delete HTML5 local storage objects."}
{"task": "rw_8.jsonl", "id": 39297, "text": "7. Cutting plate", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39298, "text": "We use mobile phone cutting plate functions to read the harmony, Keep, APP, related specific information, collect the source information of the user, which is convenient for statistics and content recommendation.", "label": ["Important", "First Party Collection Information"], "rewrite": "We use the mobile phone shear plate function to collect the source information of the user by reading specific information related to the Keep APP to facilitate statistics and content recommendation."}
{"task": "rw_8.jsonl", "id": 39299, "text": "We will not associate the collected information with any personal information you submitted in mobile applications.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39300, "text": "8. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39301, "text": "1. General clauses of minors", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39302, "text": "1.1, if you are over, 14, years old but not full, 18, years of age, before using, Keep, and related services, you should read and agree with your parents or other guardians under the guidance and guidance.Privacy Policy.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, please read privacy policies with your guardian and use services or information under the consent and guidance of the guardian."}
{"task": "rw_8.jsonl", "id": 39303, "text": "1.2, if you are not full, 14, years old, you should read and agree to your privacy policy and \"Children's Personal Information Protection Policy and Guardian Notice\" before using, Keep, and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14, you should read and agree to the privacy policy and the \"Children's Personal Information Protection Policy and Guardian Notice\"."}
{"task": "rw_8.jsonl", "id": 39304, "text": "\"Children's Personal Information Protection Policy and Guardian Notice\" is part of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39305, "text": "1.3, we can protect the personal information of minors in accordance with the provisions of relevant national laws and regulations, and will only collect, use, share or disclose minors to collect, use, share, or disclose minors when legal permission, parents or other guardians need to protect or protect minors.Personal information;", "label": ["Specific Audiences", "Important"], "rewrite": "It will only use, share, transfer, or disclose this information if the laws and regulations are allowed, parents or guardians to clearly agree or protect minors."}
{"task": "rw_8.jsonl", "id": 39306, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_8.jsonl", "id": 39307, "text": "At the same time, we have established rules for collecting and useful information collection and use to protect personal information security of children and adolescents. You can learn more about the \"Minor User Agreement\".", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "We have established a rigorous rule of minor information collection and use. You can learn more about the more specific content by reading the \"User Agreement of the Minor\"."}
{"task": "rw_8.jsonl", "id": 39308, "text": "1.4 We believe that monitoring children's use of our products or services is the responsibility of parents or guardians.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39309, "text": "We do not directly provide services to children, nor do we use children's personal information for marketing purposes.", "label": ["Specific Audiences", "Important"], "rewrite": "We do not directly provide services to children, nor do we use children's personal information for marketing purposes."}
{"task": "rw_8.jsonl", "id": 39310, "text": "If you are a parent or guardian of the minor, when you have any questions about the personal information of the minors you monitor, or you think the underage direction, key, app, submit your personal information, please pass the privacy policy through your own privacy policy.Article 11 The contact information of the publicity in the publicity is contacted with us.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a parent or guardian of the minor, you can contact us with any questions that have any questions."}
{"task": "rw_8.jsonl", "id": 39311, "text": "2. Minor model", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39312, "text": "You can open or close the minor mode through \"Settings\"-\"Minor Model\" in the upper left corner. The model will be recommended to only recommend minor browsing in the community. If you want to close this mode, you need to enter the password set in advance beforeCan be closed.", "label": ["Specific Audiences", "Important", "Edit/Control"], "rewrite": "Related settings for minor models need to enter a password."}
{"task": "rw_8.jsonl", "id": 39313, "text": "Nine, update of this policy", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39314, "text": "1. We may modify and update this privacy policy from time to time. For the update of privacy policies, we will be published in the form of Keep, APP, and the notification announcement.policy.", "label": ["Policy Change", "Important"], "rewrite": "For the update of privacy policies, we will publish in the Keep APP in the form of notification announcements."}
{"task": "rw_8.jsonl", "id": 39315, "text": "For major changes, we will send you a solemn notice.", "label": ["Policy Change", "Important"], "rewrite": "For major changes in privacy policies, we will issue a solemn notice to you."}
{"task": "rw_8.jsonl", "id": 39316, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39317, "text": "1.1 Our products and/or service models have changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39318, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39319, "text": "1.2 We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39320, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39321, "text": "1.3 The main objects of personal information sharing, transfer or public disclosure have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39322, "text": "1.4 The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39323, "text": "1.5 When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39324, "text": "1.6 Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39325, "text": "You agree and continue to use, Keep, APP, which means that you agree with the content of this policy (including the updated version).", "label": ["Policy Change", "Important"], "rewrite": "You agree and continue to use the Keep APP, which means that you agree with the content of this policy (including the updated version)."}
{"task": "rw_8.jsonl", "id": 39326, "text": "If you don't agree, please don't use the Keep APP.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39327, "text": "2. If you want to withdraw your consent authorization during use, you can decide whether to change your authorization through the \"settings\"-\"privacy\"-\"withdrawal of privacy policies\" in the upper left corner.", "label": ["Important", "Edit/Control"], "rewrite": "If you want to withdraw your consent authorization, you can decide whether to change your authorization by \"setting\" yourself."}
{"task": "rw_8.jsonl", "id": 39328, "text": "But when you cancel the authorization, we will no longer provide you with the collection of the information, and we can no longer provide you with upgrade experience functional services and expansion functional services, and only provide you with basic business functional services.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "But when you cancel the authorization, we will no longer provide you with the collection of the information, and we can no longer provide you with relevant services, and only provide you with basic business functional services."}
{"task": "rw_8.jsonl", "id": 39329, "text": "10. Scope of application", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39330, "text": "1. Our privacy policy is suitable for all services provided by Beijing Cali Technology Co., Ltd. and its affiliated companies, including services provided by the Keep App and www.keep.com, but excluding services with independent privacy policies (such as No. 1Products and services provided by the three parties).", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39331, "text": "2. Our privacy policy is not applicable to products and services provided by third parties, such as products and services provided by third parties on the Keep APP and www.keep.com, and other websites connected to our services.These products, services or websites will have independent privacy policies to regulate, please check the corresponding policies and regulations.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39332, "text": "3. For advertising for our services, and other companies and organizations that may use our cookies or other log information to put and use advertising, our privacy policy does not cover its information processing policy.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39333, "text": "Eleven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39334, "text": "You can contact us in the following way:", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39335, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the Keep app online customer service;", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39336, "text": "2. If you find that your personal information may be leaked, you can report a complaint through the Keep app. We will contact you within 15 working days and complete the inspection and processing;", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39337, "text": "3. We have also set up a personal information protection work department. You can pass the mailbox, Privacy@Keep.com, or telephone, 010-86223197, contact us, we will contact you within 15, complete you and complete the verification within a working day and complete the verificationAnd processing.", "label": ["Important", "Contact Information"], "rewrite": "Email privacy@keep.com or telephone 010-86223197."}
{"task": "rw_8.jsonl", "id": 39338, "text": "4. If it is found, the key discrimination, \"big data killing\", fake traffic, induction and induction, etc.APP, complaint report, we will contact you within 15 working days and complete the verification and processing.", "label": ["Important", "Contact Information"], "rewrite": "If you find that the Keep app has related problems, you can report it through the Keep APP complaint."}
{"task": "rw_8.jsonl", "id": 39339, "text": "Twelve, Affiliated", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39340, "text": "The interpretation and dispute resolution of this policy shall apply the laws of the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39341, "text": "Any disputes related to this policy, the two parties should be resolved by friendly negotiation;", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39342, "text": "If you cannot negotiate, you will agree to submit the dispute to the People's Court of Chaoyang District, Beijing.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39343, "text": "If any court with jurisdiction rules or judge any terms of this policy invalid, this clause will be removed from this policy, but the invalidation of this clause will not affect the effectiveness of the other terms of this policy.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39344, "text": "The remaining terms of this policy will continue to be implemented.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39345, "text": "The affiliated company described in this policy refers to other companies that the platform participates in or indirectly controlled or indirectly controlled, as well as two or more companies controlled by a certain enterprise, such as Beijing Cali Information Technology Co., Ltd.Sports Management (Beijing) Co., Ltd., Shenzhen Cali Technology Co., Ltd., etc.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39346, "text": "The title of this policy is only designed for the convenience of reading, and does not affect the meaning or explanation of any terms of this policy.", "label": [], "rewrite": []}
{"task": "rw_8.jsonl", "id": 39347, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
