{"task": "rw_81.jsonl", "id": 64865, "text": "Weibo personal information protection policy", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64866, "text": "Update date: March 3, 2022", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64867, "text": "Effective date: March 3, 2022", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64868, "text": "In order to effectively protect the personal information of Weibo users and optimize the user experience, Weibo (hereinafter or \"us\" refers to Beijing Weimengchuangke Network Technology Co., Ltd.) to formulate the \"Weibo Personal Information Protection Policy\" (according to the current regulations and policiesThe following is referred to as \"this policy\").", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64869, "text": "This policy will explain in detail our policies and measures in obtaining, using, managing and protecting user personal information.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64870, "text": "We strive to express it in an easy -to -understand and concise text, and mark the stiff characters to be marked with the clauses that are closely related to your rights and interests in this policy to prompt you to pay attention.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64871, "text": "Therefore, before you use Weibo, be sure to read it carefully and fully understand this policy. After confirming and consent, you can use Weibo services.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64872, "text": "important hint:", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64873, "text": "1 This policy is applicable to the various products and services provided to you with new forms that include websites, clients, small programs, H5, fast applications, components, widgets, and new forms that appear with technology.Equipment, mobile terminal or Weibo service obtained by other devices.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64874, "text": "This policy is not applicable to:", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64875, "text": "The information collected by a third -party product or service (including any third -party website) accessed by Weibo may include the products or services and advertising content displayed to you in personalized recommendations, or other products or linked in the Weibo or other products or linkedServe;", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64876, "text": "Information collecting third -party collected by Weibo for advertising;", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64877, "text": "Information collected by third parties on Weibo on Weibo.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64878, "text": "You use these third -party services (including any personal information you provided to these third parties), and will be constrained by these third -party service terms and privacy policies (rather than this policy). For specific regulationsEssence", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64879, "text": "Please protect your personal information properly and provide third parties only if necessary.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64880, "text": "2 Please understand that the client and related services described in this policy may be different according to factors such as the models, system versions, browser versions, software application versions of your loading client equipment.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64881, "text": "The final product and service are based on the Weibo client you use.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64882, "text": "3 Related terms in this policy, if there is no special agreement, are explained by the applicable data protection laws.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64883, "text": "\"Applicable data protection laws\" mainly refer to laws and regulations related to Chinese personal information protection (\"Personal Information Protection Law\", \"Data Security Law\", \"Civil Code\", \"Network Security Law\") and its supporting implementation rules, national standards and regulatory requirements(In order to avoid doubt, it does not include the Hong Kong Special Administrative Region, the Macau Special Administrative Region and Taiwan Law).", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64884, "text": "4 You know and understand that some of the services we provide to you may need to process your sensitive personal information. These sensitive personal information will be marked with rough characters to prompt you to pay attention.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64885, "text": "We will only process your sensitive personal information based on your consent, provide you with the service you need or to perform legal obligations, and these processing activities will not adversely affect your rights and interests.", "label": ["Important", "Data Security"], "rewrite": "We will only process your sensitive personal information based on your consent, provide you with the service you need or to fulfill your legal obligations."}
{"task": "rw_81.jsonl", "id": 64886, "text": "We will adopt security and technical measures that match the level of sensitive personal information risks in accordance with the law to prevent unauthorized access and personal information leakage, tampering, and loss.", "label": ["Important", "Data Security"], "rewrite": "We will adopt security and technical measures that match the level of sensitive personal information risks in accordance with the law to prevent unauthorized access and personal information leakage, tampering, and loss."}
{"task": "rw_81.jsonl", "id": 64887, "text": "In this policy, we will disclose the necessary matters (including but not limited to the type of purpose, method, and sensitive personal information, etc.) to you in accordance with the law, andReminder you and ask for your separate consent (except for other provisions of the applicable data protection law).", "label": ["Important", "Data Security"], "rewrite": "We will disclose the necessary matters to deal with your sensitive personal information to you in accordance with the law, and prompt you and ask you alone in the form of pop -up windows or individual pages in Weibo."}
{"task": "rw_81.jsonl", "id": 64888, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64889, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64890, "text": "2. COOKIE and related technology notifications", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64891, "text": "3. How can we entrust your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64892, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64893, "text": "5. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64894, "text": "6. Your personal information subject right", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64895, "text": "7. How do we collect and handle personal information of minors", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64896, "text": "8. Update of this policy", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64897, "text": "9. How to contact us", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64898, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64899, "text": "1 The personal information you voluntarily provided to us", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64900, "text": "1.1 Registration and login account", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64901, "text": "When you register a Weibo account or use other account management functions, we will collect and log in through the registration and login to collect your account nickname, password, password protection option, email, mobile phone number.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your account nickname, password, password protection option, email, mobile phone number through the registration and login process."}
{"task": "rw_81.jsonl", "id": 64902, "text": "If you log in to Weibo in other ways, we will request your personal information from a third party in the affiliate. For personal information that we ask but cannot provide third parties, we may still ask you: (1) when you use the QQ account numberWhen logging in, we will access your QQ avatar, nickname, regional and gender information;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64903, "text": "(2) When you log in with WeChat accounts, we will get your WeChat avatar, WeChat nickname, gender and regional information;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you log in with a WeChat account, we will get your WeChat avatar, WeChat nickname, gender and regional information."}
{"task": "rw_81.jsonl", "id": 64904, "text": "(3) When you log in with Apple, ID, we will get the email address of your Apple, ID.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you log in with the Apple ID, we will get the email address of your Apple ID."}
{"task": "rw_81.jsonl", "id": 64905, "text": "In order to ensure the security of the account and implement the real -name system of the network, when you use other methods to log in and use some functions of Weibo, you may still need to bind an effective mobile phone number.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64906, "text": "Collecting this information is to help you create a Weibo account and provide real -name verification on you. If you refuse to provide this information, it will affect your registration and use Weibo.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting this information is to help you create a Weibo account and provide real -name verification on you. If you refuse to provide this information, it will affect your registration and use Weibo."}
{"task": "rw_81.jsonl", "id": 64907, "text": "In order to log in to and use the products provided by us and related parties, we use a unified account system. You can use Weibo account to log in, use Weibo and other products.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64908, "text": "If you modify the account information (including account passwords, password protection options, emails, and mobile phone numbers) in any product, these modifications will automatically synchronize to your unified account number.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64909, "text": "If you understand and agree, if you cancel your account in any product, it may affect your use of other products.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64910, "text": "In addition, if you want to set up a \"adolescent model\" for your children under the age of 14, we will collect information about your child's account nickname, gender, and year of birth.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you want to set up a \"adolescent model\" for your children under the age of 14, we will collect information about your child's account nickname, gender, and year of birth."}
{"task": "rw_81.jsonl", "id": 64911, "text": "For details, please refer to the \"Personal Information Protection Policy of Weibo Children's Personal Information\".", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64912, "text": "1.2, when you browse Weibo information flow, we will provide you with personalities based on your device information, IP address, location information, personal homepage information, and your behavior information (that isRecommended service service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will provide you with personalized content recommendation services based on your device information, IP address, location information, personal homepage information, and your behavior information."}
{"task": "rw_81.jsonl", "id": 64913, "text": "You can independently control the opening and closing of personalized content recommendation services in Weibo settings (path: Weibo-me-setting-privacy settings-personalized content recommendation), which will not affect other functions of your normally using Weibo.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can independently control the opening and closing of personalized content recommendation services in Weibo settings, which will not affect other functions of your normally using Weibo."}
{"task": "rw_81.jsonl", "id": 64914, "text": "For the relevant information and services provided for you in the Weibo (such as information and advertising push, location marking, location sign -in, \"same city\" service, the topic of the Weibo publisher \\ place \\ weather \\ Super Talk recommendation guidance), such as guidance), such asYour device supports these options, and we will collect your accurate location information or rough location information after you open your positioning authority.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "For the relevant information and services provided by you in the Weibo, if your device supports these options, we will collect your accurate location information or rough location information after you open your positioning authority."}
{"task": "rw_81.jsonl", "id": 64915, "text": "You know and understand that we may rely on other information (such as IP address, Wi-Fi access point, mobile signal base station location, etc.) to judge your approximate location and provide you with information and services based on such positions.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may rely on other information (such as IP address, Wi-Fi access point, mobile signal base station location, etc.) to judge your approximate location and provide you with information and services based on such locations."}
{"task": "rw_81.jsonl", "id": 64916, "text": "1.3 Release and interaction", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64917, "text": "When you publish or forward Weibo, comment or send private messages with other users, we will collect the content you posted (including text, pictures or videos).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the content you posted (including text, pictures or videos)."}
{"task": "rw_81.jsonl", "id": 64918, "text": "If the pictures or videos you use when you release Weibo include location information, we will extract such location information and use it as the alternative item of your labeling location information;", "label": ["Important", "First Party Collection Information"], "rewrite": "The pictures or video containing location information you used when you post on Weibo will extract such location information and use it as a sequinity for your labeling location information."}
{"task": "rw_81.jsonl", "id": 64919, "text": "You can also choose or guidance based on our recommendation and guidance to marked the geographical location of the Weibo content that you plan to release.", "label": ["Important", "Usage"], "rewrite": "You can also choose or guidance based on our recommendation and guidance to marked the geographical location of the Weibo content that you plan to release."}
{"task": "rw_81.jsonl", "id": 64920, "text": "If you refuse to open the positioning authority or provide location information, you will not be able to mark the location information on the published content.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to open the positioning authority or provide location information, you will not be able to mark the location information on the published content."}
{"task": "rw_81.jsonl", "id": 64921, "text": "1.4, when you sign in and sharing functions in your location, we will collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you sign in and sharing function in your place, we will collect your location information."}
{"task": "rw_81.jsonl", "id": 64922, "text": "If you refuse to provide location information, you will not be able to use this feature.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide location information, you will not be able to use this feature."}
{"task": "rw_81.jsonl", "id": 64923, "text": "1.5, when you find the function of the communication records, we will collect your address book information so that you can find and add a contact person as a Weibo friend.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the function of a communication records, we will collect your address book information."}
{"task": "rw_81.jsonl", "id": 64924, "text": "If you refuse to provide this information, you will not be able to use this feature.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide this information, you will not be able to use this feature."}
{"task": "rw_81.jsonl", "id": 64925, "text": "1.6 Weibo live broadcast", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64926, "text": "When you watch the live broadcast, we will not collect your information extra.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you watch the live broadcast, we will not collect your information extra."}
{"task": "rw_81.jsonl", "id": 64927, "text": "When you initiate a live broadcast, you need to provide us with your real name and ID number, so that we can provide you with real -name authentication in accordance with the requirements of relevant laws and regulations, and open the camera and microphone on the device.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to provide us with your real name and ID number to perform real -name authentication and turn on the camera and microphone on the device."}
{"task": "rw_81.jsonl", "id": 64928, "text": "When you release a live broadcast appointment, you need to provide an introduction information for the live broadcast and designated broadcast time, and shoot or upload live broadcast trailer videos.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide an introduction information and designated broadcast time for the reservation live broadcast, and shoot or upload a live broadcast trailer video."}
{"task": "rw_81.jsonl", "id": 64929, "text": "If you want to interact with the anchor you watch, you may need to turn on the camera and microphone on your device;", "label": ["Permission Acquisition", "Important"], "rewrite": "If you want to interact with the anchor you watch, you may need to turn on the camera and microphone on your device."}
{"task": "rw_81.jsonl", "id": 64930, "text": "When you watch the live broadcast function with free traffic, we may also need to confirm your disqualification of your free service based on your IMSI.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64931, "text": "If you plan to create a live broadcast appointment, you can also open the calendar permissions on the device so that we can create the schedule and remind you before the start of the live broadcast. You can also adjust the cover picture of your live broadcast or mark your live broadcast position according to your willingness.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you plan to create a live broadcast appointment, you can also open the calendar authority on the device."}
{"task": "rw_81.jsonl", "id": 64932, "text": "If you refuse to provide this information or open up related permissions, you will not be able to use the functions corresponding to such information and permissions, but it will not affect you to watch, initiate or make an appointment for live broadcast.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to provide this information or open up related permissions, you will not be able to use the functions corresponding to such information and permissions, but it will not affect you to watch, initiate or make an appointment for live broadcast."}
{"task": "rw_81.jsonl", "id": 64933, "text": "1.7 Weibo wallet function", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64934, "text": "When you use the Weibo wallet function, you will need to bind your Alipay account. We will collect your Alipay account to authorize the information we get (including name, login name, corporate name, nickname, avatar, gender, region and usersStatus) and the binding relationship between the Alipay account and Weibo account so that you can complete the withdrawal or use the wallet balance.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the Weibo wallet function, we will collect your Alipay account to authorize the information we obtain and the binding relationship between the Alipay account and the Weibo account."}
{"task": "rw_81.jsonl", "id": 64935, "text": "If you refuse to bind, you will not be able to use the withdrawal of the Weibo wallet and the balance payment function.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64936, "text": "1.8, when you use video creation and content management functions, we will collect and show you your video content, video cover, video description, and information about comments, interaction related to you so that you can check and manage.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and show you your video content, video cover, video description, information, interaction and other information related to you, so that you can check and manage."}
{"task": "rw_81.jsonl", "id": 64937, "text": "If you need to upload videos, you need to authorize us to access the album or external storage information, otherwise we will not be able to obtain the video content in your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to upload videos, you need to authorize us to access the album or external storage information, otherwise we will not be able to obtain the video content in your device."}
{"task": "rw_81.jsonl", "id": 64938, "text": "If you need to make video creation, you may also need to turn on the camera and microphone on the device.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to make video creation, you may also need to turn on the camera and microphone on the device."}
{"task": "rw_81.jsonl", "id": 64939, "text": "If you need to settle the revenue of the video on the platform, you need to provide us with your real name, Alipay account, mobile phone number, ID number, so that we can verify your identity and make money to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to settle the revenue of the video on the platform, you need to provide us with your real name, Alipay account, mobile phone number, ID number, so that we can verify your identity and make money to you."}
{"task": "rw_81.jsonl", "id": 64940, "text": "If you refuse to provide this information, we will not be able to settle related income for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide this information, we will not be able to settle related income for you."}
{"task": "rw_81.jsonl", "id": 64941, "text": "1.9, when you edit your personal homepage, you can edit your nickname, avatar, gender, birthday, and local information. You can actively fill in the introduction, emotional status, hometown, school, company, etc. to expand information according to the actual situation.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you edit your personal homepage, you can edit your nickname, avatar, gender, birthday and local information, and you can actively fill in the expansion information according to the actual situation."}
{"task": "rw_81.jsonl", "id": 64942, "text": "If you refuse to provide expansion information, it will not affect your editor's personal homepage or other functions of using Weibo.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide expansion information, it will not affect your editor's personal homepage or other functions of using Weibo."}
{"task": "rw_81.jsonl", "id": 64943, "text": "If you need to modify the avatar, you need to authorize us to access the album or external storage information, otherwise we will not be able to obtain the file content in your device.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "If you need to modify your avatar, you need to authorize us to access the album or external storage information."}
{"task": "rw_81.jsonl", "id": 64944, "text": "If you need to shoot avatar, you may also need to turn on the camera on the device.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to shoot avatar, you may also need to turn on the camera on the device."}
{"task": "rw_81.jsonl", "id": 64945, "text": "1.10, when you use Weibo authentication functions (including identity certification, interest certification, gold V certification, super -topic certification, video certification, articles/quiz certification, and other authentication types that are added from time to time) or other required real -name authenticationWhen the service (for example, when you open a Weibo store), we will collect your name, mobile phone number, ID information, and career information based on the service types you use.Verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Weibo authentication functions or other services that need to perform real -name authentication, we will collect your name, mobile phone number, ID information, and professional information."}
{"task": "rw_81.jsonl", "id": 64946, "text": "Collect this information to help you complete your identity authentication.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64947, "text": "We will protect your personal information to the greatest extent. If you do not provide this information, we will not be able to provide relevant services.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64948, "text": "Among them, for some account numbers (such as real -name official accounts) involving public information dissemination, we will force the identity card information of the main responsible person (such as account operators) to maintain the order of public communication.", "label": ["Important", "First Party Collection Information"], "rewrite": "In response to some accounts involving public information dissemination, we will force the identity card information of the main responsible person to maintain the order of public communication."}
{"task": "rw_81.jsonl", "id": 64949, "text": "Except for the above situations, we generally do not enforce the user's ID information.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64950, "text": "1.11, when you use Weibo \"City\" service, we will collect your location information so that we can show you the content of the \"same city\" users based on your geographical location.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use Weibo \"City\" service, we will collect your location information."}
{"task": "rw_81.jsonl", "id": 64951, "text": "If you refuse to provide accurate location information, we will only rely on the rough location information of the city level to provide you with the \"city\" service. You can also browse other \"same city\" Weibo content by switching the city.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide accurate location information, we will only rely on the rough location information of the city level to provide you with \"city\" services."}
{"task": "rw_81.jsonl", "id": 64952, "text": "At the same time, if you don't want your Weibo to display in the \"City\", you can close it in the Weibo settings, which will not affect other functions of your normally using Weibo.", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want your Weibo to be displayed in the \"City\", you can close it in the Weibo settings, which will not affect other functions of your normally using Weibo."}
{"task": "rw_81.jsonl", "id": 64953, "text": "1.12, when you use the shooting props, photo album production and other tools provided in your Weibo, if you choose to use tools that need to be fitted with the face of the person in the image, we will need to identify your facial feature value information as aBetter visual effects.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We will need to identify your facial feature value information to provide better visual effects."}
{"task": "rw_81.jsonl", "id": 64954, "text": "In the process, unless there is another clear explanation and obtaining your individual consent, we will not return, store or provide the above information to third parties. This information will only be processed locally in your device (such as mobile phones).", "label": ["Important", "Data Security"], "rewrite": "Unless there is another clear explanation and obtaining your alone consent, we will not return, store or provide the above information to third parties. This information will only be processed locally in your device."}
{"task": "rw_81.jsonl", "id": 64955, "text": "If you refuse to provide facial feature value information, you will not be able to use relevant tools, but it will not affect other functions of your Weibo.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide facial feature value information, you will not be able to use relevant tools, but it will not affect other functions of your Weibo."}
{"task": "rw_81.jsonl", "id": 64956, "text": "1.13, when you participate in marketing activities in Weibo (for example, use points in Weibo to accumulate points for gifts), we will collect your name, mobile phone number, and mailing address.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in marketing activities in Weibo, we will collect your name, mobile phone number, and mailing address."}
{"task": "rw_81.jsonl", "id": 64957, "text": "Collecting this information is to send gifts to you. If you refuse to provide this information, we will not be able to issue gifts to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting this information is to send gifts to you. If you refuse to provide this information, we will not be able to issue gifts to you."}
{"task": "rw_81.jsonl", "id": 64958, "text": "1.14, when you participate in the red envelope activities of the Weibo User Mission Center, we will collect your location information so that users who participate in the event based on your geographical location matching.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in the red envelopes of the Weibo User Mission Center, we will collect your location information."}
{"task": "rw_81.jsonl", "id": 64959, "text": "If you refuse to provide location information, you will not be able to use the shaking function, you refuse to provide this information will not affect other functions of your use of Weibo.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide location information, you will not be able to use the shaking function, you refuse to provide this information will not affect other functions of your use of Weibo."}
{"task": "rw_81.jsonl", "id": 64960, "text": "1.15, when you use the customer service center to manage the account, according to the type of service you use (including but not limited to regaining login names, recovering passwords, modifying passwords, binding mobile phones, etc.), you may need to provide us with nicknames, originals, original, original, original, originalDifferent information such as passwords, new binding mobile phone numbers, etc. to achieve different account management functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the customer service center to manage the account, you may need to provide us with different information such as nicknames, original passwords, and new binding mobile phone numbers to achieve different account management functions."}
{"task": "rw_81.jsonl", "id": 64961, "text": "If you refuse to provide this information, you will not be able to use the function corresponding to the information, but it will not affect other functions of your use of Weibo.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide this information, you will not be able to use the function corresponding to the information, but it will not affect other functions of your use of Weibo."}
{"task": "rw_81.jsonl", "id": 64962, "text": "If you need to upload files with the \"Fraud Report\" function, you need to authorize us to access the album or external storage information, otherwise we will not be able to obtain the file content in your device.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to upload files with the \"Fraud Report\" function, you need to authorize us to access the album or external storage information, otherwise we will not be able to obtain the file content in your device."}
{"task": "rw_81.jsonl", "id": 64963, "text": "If you need to take photos, you may also need to turn on the camera on the device.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you need to take photos, you may also need to turn on the camera on the device."}
{"task": "rw_81.jsonl", "id": 64964, "text": "1.16, when you use the search service we provided, we will collect keyword information, search history records, equipment information you searches (including the equipment attributes, connections and status information you use, suchIMEI/, Android/, IDFA/, Openudid/, Guid/, OAID), device MAC address, telecommunications operator and other software and hardware feature information).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect keyword information, search history, equipment information, equipment MAC address, telecommunications operator and other software and hardware feature information you searched."}
{"task": "rw_81.jsonl", "id": 64965, "text": "In order to provide efficient search services, some information will be temporarily stored in your local equipment.", "label": ["Data Retention", "Important"], "rewrite": "In order to provide efficient search services, some information will be temporarily stored in your local equipment."}
{"task": "rw_81.jsonl", "id": 64966, "text": "Here, what you need to pay attention to is that the separate search keyword information cannot identify your personal identity, and it does not belong to your personal information, so we have the right to use it with other purposes;", "label": ["Important", "Risk"], "rewrite": "Searching for keyword information alone cannot identify your personal identity, and it does not belong to your personal information, so we have the right to use it with other purposes."}
{"task": "rw_81.jsonl", "id": 64967, "text": "Only when your search keyword information is linked to your other information and can combine your personal identity, we will use your search keyword information as your personal information and follow your search history.Policies are processed and protected.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64968, "text": "1.17, in the case of you copying or following the information, we need to access your shear plates to read the passwords, copy code, links contained in it to achieve functions or services such as jumping, sharing, and help you open or follow.Content to enhance your product experience.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to access your shear board and read the passwords, copy code, and links contained in it to achieve functions or services such as jumping, sharing."}
{"task": "rw_81.jsonl", "id": 64969, "text": "Weibo will upload our server only when the content of the shear plate is a Weibo jump instruction. In addition, Weibo will not upload other information of your cut plate to our server.", "label": ["Important", "Data Security"], "rewrite": "Weibo will upload our server only when the content of the shear plate is a Weibo jump instruction. In addition, Weibo will not upload other information of your cut plate to our server."}
{"task": "rw_81.jsonl", "id": 64970, "text": "Some mobile phones and other terminal devices will prompt the application (APP) to read the shear plate, but the system prompts that it cannot distinguish whether to collect shear information and do not rule out the error alarm.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "Some mobile phones and other terminal devices will prompt the application (APP) to read the shear plate, but the system prompts that it cannot distinguish whether to collect shear information."}
{"task": "rw_81.jsonl", "id": 64971, "text": "Therefore, if you find a similar prompt, please contact us so that we can locate the problem.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64972, "text": "1.18, when you use Weibo, we will push you personalized advertisements based on your device information, IP address and location information.", "label": ["Important", "Usage"], "rewrite": "Some mobile phones and other terminal devices will prompt the application (APP) to read the shear plate, but the system prompts that it cannot distinguish whether to collect shear information."}
{"task": "rw_81.jsonl", "id": 64973, "text": "When using the above information, we will identify it, so that the relevant information cannot be directly associated with your true identity.", "label": ["Important", "Data Security"], "rewrite": "When using the above information, we will identify it, so that the relevant information cannot be directly associated with your true identity."}
{"task": "rw_81.jsonl", "id": 64974, "text": "If you refuse to personalized advertising push service, you can close it in Weibo settings (path: Weibo-me-setting-privacy settings-personalized advertising recommendation), but does not affect other functions of your normally using Weibo.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "If you refuse to personalized advertising push services, you can turn it off on Weibo settings, but it does not affect other functions of your normally using Weibo."}
{"task": "rw_81.jsonl", "id": 64975, "text": "1.19 In some special circumstances (such as the compliance of the user's specific use behavior), we may ask you to provide you with a copy or scanning part of the relevant written proof.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64976, "text": "We will properly handle your information after receiving your materials and give you feedback to you in time.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64977, "text": "1.20, if we get your personal information outside the above scenario, we will re -obtain your explicit consent and fully explain to you before obtaining your consent.Except for the protection of laws.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you get your personal information outside the above scenario, you will re -obtain your explicit consent and fully explain to you the content and scope of the application scenario and the content of obtaining your relevant information."}
{"task": "rw_81.jsonl", "id": 64978, "text": "2 The personal information we collect indirectly", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64979, "text": "When you use the access to a third -party application on Weibo, in order to provide the purpose of providing docking technical support, developers and technical service providers of third -party applications from this third -party application may obtain your necessary personal information, such as device information, Operation Behavior Log Information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use access to third -party applications on Weibo, in order to provide docking technical support, we may obtain your necessary personal information from developers and technical service providers of third -party applications."}
{"task": "rw_81.jsonl", "id": 64980, "text": "If you involve your sensitive personal information, we will authorize you alone.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Data Security"], "rewrite": "If you involve your sensitive personal information, we will authorize you alone."}
{"task": "rw_81.jsonl", "id": 64981, "text": "If you refuse us to collect relevant personal information, all or part of the function of third -party applications cannot be implemented, but it does not affect other functions of your use of Weibo.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse us to collect relevant personal information, all or part of the function of third -party applications cannot be implemented, but it does not affect other functions of your use of Weibo."}
{"task": "rw_81.jsonl", "id": 64982, "text": "Developers and technical service providers of such third -party applications may directly collect and use your personal information based on the privacy policies it provide, but we will not obtain these personal information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Developers and technical service providers of such third -party applications may directly collect and use your personal information based on the privacy policies it provide, but we will not obtain these personal information."}
{"task": "rw_81.jsonl", "id": 64983, "text": "It is recommended that you read and confirm such privacy policies before receiving relevant services and providing personal information.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64984, "text": "3 The personal information we collect automatically", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64985, "text": "When you use our services through the service entrances of the website, client, small program, etc., we may automatically collect your IP address, device model, unique device recognition code, browser model, rough location information (for example, for exampleState or urban information), the installation application information, and other equipment technical information, we will also collect some log information you use our service, such as the page you have visited or the link you have clicked.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may automatically collect your IP address, device model, unique device recognition code, browser model, rough location information, installation application information, and other device technical information from your device."}
{"task": "rw_81.jsonl", "id": 64986, "text": "Collecting such information is mainly to ensure the safe operation of services, and it can also make us better understand you, such as where you and what our services have attracted you.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64987, "text": "We use these information for internal analysis and improve service quality and service correlation (such as information and content that you may be interested in).", "label": ["Important", "Usage"], "rewrite": "We use these information for internal analysis and improve service quality and service correlation for you."}
{"task": "rw_81.jsonl", "id": 64988, "text": "At the same time, we also need to retain the corresponding logs to record the running status of service entrances such as our website, mobile client, in order to comply with the provisions of laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "We also need to retain the corresponding logs to record the running status of service entrances such as our website, mobile client."}
{"task": "rw_81.jsonl", "id": 64989, "text": "This information is generally collected through the cookies or similar tracking technology we use. For details, please refer to the \"Cookie and related technical notification\" part below.", "label": ["Important", "First Party Collection Information"], "rewrite": "This information is generally collected through the cookies or similar tracking technology we use. For details, please refer to the \"Cookie and related technical notification\" part below."}
{"task": "rw_81.jsonl", "id": 64990, "text": "4 The device permissions we obtain", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64991, "text": "To provide you with convenient and high -quality services, we may call some permissions on your device.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64992, "text": "When you use the corresponding function, you will see the pop -up reminder and ask if you authorize.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 64993, "text": "You can choose to close part or all permissions in the setting function of the client or device.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to close part or all permissions in the setting function of the client or device."}
{"task": "rw_81.jsonl", "id": 64994, "text": "In different devices, the above -mentioned authority may be different from the opening and closing methods of the authority. For details, please refer to the instructions or guidance of the device and system developer.", "label": ["Important", "Edit/Control"], "rewrite": "In different devices, the above -mentioned authority may be different from the opening and closing methods of the authority. For details, please refer to the instructions or guidance of the device and system developer."}
{"task": "rw_81.jsonl", "id": 64995, "text": "For the specific situation of Weibo calling permissions, please see the \"Equipment Permissions List\".", "label": ["Important", "Edit/Control"], "rewrite": "For the specific situation of Weibo calling permissions, please see the \"Equipment Permissions List\"."}
{"task": "rw_81.jsonl", "id": 64996, "text": "5. According to the relevant provisions of the applicable data protection law, in the following circumstances, we have the right to deal with your personal authority (including collection, use, commission processing, sharing, transfer, and public disclosure) without obtaining your authorization consent).information:", "label": ["Important", "Risk"], "rewrite": "In the following circumstances, we have the right to process your personal information without obtaining your authorization:"}
{"task": "rw_81.jsonl", "id": 64997, "text": "5.1, it is necessary for the contract to establish and fulfill your contract as a party;", "label": ["Important", "Risk"], "rewrite": "It does not need to solicit consent if you set up and fulfill your contract as a contract that you are required to deal with your contract."}
{"task": "rw_81.jsonl", "id": 64998, "text": "5.2, to fulfill our legal volunteers;", "label": ["Important", "Risk"], "rewrite": "To perform personal information in order to fulfill our legal obligations, there is no need to solicit consent."}
{"task": "rw_81.jsonl", "id": 64999, "text": "5.3, to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "Risk"], "rewrite": "Personal information is used in order to deal with emergencies, no consent is required."}
{"task": "rw_81.jsonl", "id": 65000, "text": "5.4, implement news reports and supervision of public opinion for public interests, and deal with your personal information within a reasonable range;", "label": ["Important", "Risk"], "rewrite": "Implement news reports and supervision of public opinion for public interests, and deal with your personal information within a reasonable scope without asking for consent."}
{"task": "rw_81.jsonl", "id": 65001, "text": "5.5, handle your own personal information within a reasonable scope in accordance with the law or other legal disclosure;", "label": ["Important", "Risk"], "rewrite": "In accordance with the law, you can handle your own or legal personal information within a reasonable scope without asking for consent."}
{"task": "rw_81.jsonl", "id": 65002, "text": "5.6, other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "Risk"], "rewrite": "Personal information is used under other circumstances stipulated in laws and administrative regulations without asking for consent."}
{"task": "rw_81.jsonl", "id": 65003, "text": "6. Unless you reject us in deletion, withdrawal consent or other methods. During your use of Weibo, we will use you within the scope of direct or reasonable correlation with the purpose of compliance with applicable data protection laws and the purpose of this policy.Personal information.", "label": ["Important", "Data Security"], "rewrite": "Unless you reject us in deleting, withdrawal consent or other ways, we will use your personal information in a direct or reasonable relationship during your use of Weibo."}
{"task": "rw_81.jsonl", "id": 65004, "text": "For example, analyze and commercialize your personal identity information, or use your own information in a reasonable range (not affecting the privacy setting items provided by you through Weibo (such as setting privacy through Weibo (such as setting privacy.Weibo, or set up only half a year of Weibo, etc.) to adjust the visibility of some information).", "label": ["Important", "Data Security", "Usage"], "rewrite": "After identifying your personal identity information, analyze and commercialize, or use your own information within a reasonable range."}
{"task": "rw_81.jsonl", "id": 65005, "text": "2. Cookie and related technology notifications", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65006, "text": "1 Cookie and related technologies can help websites identify registered users. Calculate the number of users. It is usually used by various websites to determine whether the user who has completed the registration has been logged in. We use cookies and related technologies to achieve the following functions or services:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65007, "text": "1.1 Safety and efficient operation of products or services.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65008, "text": "We may set COOKIE with authentication and security to confirm whether you log in to the service safely, or whether you encounter dispersion, fraud and other illegal behaviors.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65009, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65010, "text": "1.2 Simplify your operation steps.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65011, "text": "Using such technologies can help you save the steps and processes of personal information and enter search content to help you get a easier access experience.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65012, "text": "1.3 Recommend, display, and push the content or account you may be interested in.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65013, "text": "We may use such technologies to understand your preferences and use habits, analyze data to improve product services, recommend information or functions you are interested in, and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "We may use such technologies to understand your preferences and use habits and analyze data."}
{"task": "rw_81.jsonl", "id": 65014, "text": "2. If you want to disable Cookies, you can configure the browser: select \"Reject Cookies\" or \"Notify you when you send cookies when you send cookies\".", "label": ["Important", "Edit/Control"], "rewrite": "If you want to disable Cookies, you can configure the browser: select \"Reject Cookies\" or \"Notify you when you send cookies when you send cookies\"."}
{"task": "rw_81.jsonl", "id": 65015, "text": "Given that our service is achieved by supporting cookies, after completing the operation of closing Cookies, you access Weibo may be affected or cannot be fully obtained by our services.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After completing the operation of closing the cookies, you may be affected or cannot be fully obtained by our services."}
{"task": "rw_81.jsonl", "id": 65016, "text": "You can't help but use cookies, you may get prompts, for example, whether to retain user information when entering this website next time to simplify login procedures (such as automatic login).", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65017, "text": "3. How can we entrust your personal information to deal with, share, transfer and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65018, "text": "1", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65019, "text": "In order to improve the efficiency of information processing, we may entrust a third party to handle your personal information on behalf of us.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to improve the efficiency of information processing, we may entrust a third party to handle your personal information on behalf of us."}
{"task": "rw_81.jsonl", "id": 65020, "text": "For the third party who entrusts our personal information, we will sign a commissioned processing agreement with it, asking them to handle personal information in accordance with the agreement, this policy, and the applicable data protection laws.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the third party who entrusts our personal information, we will sign the commissioned processing agreement with it."}
{"task": "rw_81.jsonl", "id": 65021, "text": "2 sharing", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65022, "text": "In order to provide you with the relevant services of Weibo, ensure the stable operation of Weibo services and other reasonable purposes, we may share your personal information to other personal information processors under the following specific circumstances.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with other personal information processors under the following specific situations."}
{"task": "rw_81.jsonl", "id": 65023, "text": "For details, please refer to the \"Third Party Cooperation List\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For details, please refer to the \"Third Party Cooperation List\"."}
{"task": "rw_81.jsonl", "id": 65024, "text": "For the third party that shares the personal information with us, we will evaluate the legality, legitimacy, and necessity of the collection of information, investigate its data security environment, and require itProcess personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "For third parties to sharing personal information with us, we will evaluate the legality, legitimacy and necessity of collecting information, and investigate its data security environment."}
{"task": "rw_81.jsonl", "id": 65025, "text": "2.1 Information sharing of Weibo services and functions of Weibo", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65026, "text": "Please understand that some functions and services of Weibo are provided by third parties (including our affiliated parties). To achieve these functions and services, we may share your necessary information with related third parties so that these third directions can soar in the third directionYou provide related functions and services to display or push you information and content you may be interested in.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Some functions and services of Weibo are provided by third parties (including our affiliates). To achieve these functions and services, we may share your necessary information with related third parties."}
{"task": "rw_81.jsonl", "id": 65027, "text": "2.2 Information sharing to help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65028, "text": "To help you participate in marketing promotion activities, we may share your information with third parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To help you participate in marketing promotion activities, we may share your information with third parties."}
{"task": "rw_81.jsonl", "id": 65029, "text": "When you choose to participate in the marketing promotion activities we organize, according to the needs of different activities, you may need to provide us with names, mobile phone numbers, and communication addresses.", "label": ["Important", "First Party Collection Information"], "rewrite": "When participating in the marketing promotion activities we organized, according to the needs of different activities, you may need to provide us with names, mobile phone numbers, and communication addresses."}
{"task": "rw_81.jsonl", "id": 65030, "text": "After your explicit consent, we will share the above information with the third party so that third parties can provide you in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your explicit consent, we will share the above information with the third party so that third parties can provide you in time."}
{"task": "rw_81.jsonl", "id": 65031, "text": "2.3 Implement information -related information sharing", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65032, "text": "In order to achieve a programmatic advertising push, we may share information with advertising partners (including advertisers and other advertising service providers) after identifying or anonymous processing to help them improve their personal identity without identifying your personal identity.Effective touch rate of advertisements.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To achieve a programmatic advertising push, we may share information after the identification or anonymous processing with advertising partners."}
{"task": "rw_81.jsonl", "id": 65033, "text": "Without your authorization, we will not share your personal identity information (that is, you can identify your identity, such as name or mobile phone number) with advertising partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your authorization, we will not share your personal identity information with advertising partners."}
{"task": "rw_81.jsonl", "id": 65034, "text": "2.4 Information sharing of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65035, "text": "In order to maintain the legitimate rights and interests of your and other Weibo users and ensure the stable operation of Weibo services, we will share your device information and network information with data security partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your device information and network information with data security partners."}
{"task": "rw_81.jsonl", "id": 65036, "text": "In addition, in order to analyze the usage of Weibo services and improve your experience, we will share information about your Weibo use behavior after sharing desensitization with data analysis partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share information about your Weibo after sharing the desensitization of the data analysis partner."}
{"task": "rw_81.jsonl", "id": 65037, "text": "3. The technical module of some functions in Weibo services is provided by the assistance of third -party SDK. For the specific situation of the third -party SDK collection and user information connected by the Weibo client, please see the \"Third -Party Cooperation List\".", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific situation of the third -party SDK collection and user information connected in the Weibo client, please see the \"Third Party Cooperation List\"."}
{"task": "rw_81.jsonl", "id": 65038, "text": "4. If we need to transfer your personal information for reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you that the name or name and contact information of the receiver will be told youPersonal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer your personal information for mergers and separation, we will tell you the names or names and contact information of the receiver, and ask the receiver to handle your personal information in accordance with the agreement of this policy."}
{"task": "rw_81.jsonl", "id": 65039, "text": "If the receiving party changes the original treatment purpose and method, it shall re -obtain your authorization consent (except for other provisions of the applicable data protection law).", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method, it shall re -obtain your authorization consent in accordance with the law."}
{"task": "rw_81.jsonl", "id": 65040, "text": "5. Unless you obtain your consent in accordance with the law, or in accordance with the provisions of laws and regulations, we will not transfer or disclose your personal information in addition to the situation described in this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you obtain your consent in accordance with the law, or in accordance with the provisions of laws and regulations, we will not transfer or disclose your personal information in addition to the situation described in this policy."}
{"task": "rw_81.jsonl", "id": 65041, "text": "6. You should understand that in the process of using Weibo, you can send photos, identity information, location information and other personal information to specific people. You can also share your photos, location information, location information, location information, location information, location information, location information,Identity information and other personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the process of using Weibo service, you can send personal information such as photos, identity information, location information, etc. You can also share your own photos, location information, identity information and other personal information to unspecified people based on our services."}
{"task": "rw_81.jsonl", "id": 65042, "text": "Because of these active sharing and disclosure behaviors, your personal information is known to others, and we do not bear relevant responsibilities.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You are known to others because of these active sharing and disclosure behaviors, and we will not bear the relevant responsibilities"}
{"task": "rw_81.jsonl", "id": 65043, "text": "4. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65044, "text": "1. We will do our best to protect your personal information, and to protect personal information by special data security departments to prevent your personal information from being illegally accessed and copied without accidental and unauthorized conditions., Modify, transmit, lose, destroy, deal with or use.", "label": ["Important", "Data Security"], "rewrite": "We will do our best to protect your personal information and protect personal information by specialized data security departments."}
{"task": "rw_81.jsonl", "id": 65045, "text": "At present, Weibo has passed the evaluation and filing of national network security level protection (level three), and has met the requirements of domestic authoritative certification standards in terms of information security, and has obtained corresponding certification.", "label": ["Important", "Data Security"], "rewrite": "Weibo has passed the evaluation and filing of national network security level protection (level three), and has reached the requirements of domestic authoritative certification standards in terms of information security, and has obtained corresponding certification."}
{"task": "rw_81.jsonl", "id": 65046, "text": "2. We take the following technical measures to protect your personal information:", "label": ["Important", "Data Security"], "rewrite": "We take the following technical measures to protect your personal information:"}
{"task": "rw_81.jsonl", "id": 65047, "text": "2.1, our network service adopts encrypted technologies such as transport layer security protocols, and provides browsing services through HTTPS and other methods to ensure the security of user personal information during transmission;", "label": ["Important", "Data Security"], "rewrite": "Our network service adopts encrypted technologies such as transport layer security protocols, and provides browsing services through HTTPS and other methods to ensure the security of user personal information during transmission."}
{"task": "rw_81.jsonl", "id": 65048, "text": "2.2, encrypt the user's personal information by adopting encryption technology, and isolate through isolation technology;", "label": ["Important", "Data Security"], "rewrite": "Personal information is used for encryption and preservation of user information by using encrypted technology, and isolates through isolation technology."}
{"task": "rw_81.jsonl", "id": 65049, "text": "2.3, when personal information use, such as personal information display and personal information association calculation, we will use a variety of data desensitization technologies including content replacement and encryption desensitization to enhance the security of personal information in use;", "label": ["Important", "Data Security"], "rewrite": "When the personal information is used, we will use a variety of data desensitization technology including content replacement and encryption desensitization to enhance the security of personal information in use."}
{"task": "rw_81.jsonl", "id": 65050, "text": "2.4, establish strict data use and access system, use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid your personal information is illegally used;", "label": ["Important", "Data Security"], "rewrite": "Establish strict data use and access systems, and use strict data access permissions control and multiple identity authentication technology to protect personal information to prevent your personal information from being used illegally."}
{"task": "rw_81.jsonl", "id": 65051, "text": "as well as", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65052, "text": "2.5, adopt special data and technical security audits, set up log audit and behavioral audit measures.", "label": ["Important", "Data Security"], "rewrite": "Adopt special data and technical security audits, set up logging and behavioral audit measures."}
{"task": "rw_81.jsonl", "id": 65053, "text": "3. In addition, we have taken the following measures to protect your personal information:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65054, "text": "3.1, manage the storage and use of personal information by establishing a data classification grading system, data security management specifications, and data security development specifications;", "label": ["Important", "Data Security"], "rewrite": "Manage the storage and use of personal information by establishing a data classification grading system, data security management specifications, and data security development specifications."}
{"task": "rw_81.jsonl", "id": 65055, "text": "3.2. Establish a special data security department and be responsible for security emergency response organizations to promote and ensure personal information security;", "label": ["Important", "Data Security"], "rewrite": "Establish a special data security department and be responsible for security emergency response organizations to promote and ensure personal information security."}
{"task": "rw_81.jsonl", "id": 65056, "text": "3.3, strengthen employee personal information protection awareness of security.", "label": ["Important", "Data Security"], "rewrite": "Strengthen employee personal information protection security awareness."}
{"task": "rw_81.jsonl", "id": 65057, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information;", "label": ["Important", "Data Security"], "rewrite": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of protecting personal information."}
{"task": "rw_81.jsonl", "id": 65058, "text": "as well as", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65059, "text": "3.4 Applicable data protection laws clearly require other personal information protection measures.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65060, "text": "4 Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant laws have been adopted, we still cannot guarantee that your personal information is safe when communicating through unsafe ways.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65061, "text": "Therefore, you should take positive measures to ensure the security of personal information, such as regularly modify the account password, and do not disclose personal information such as your account password to others.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65062, "text": "5. There are always risks of various information leaks in the network environment. When accidental events, force majeure and other circumstances lead to leakage of your information, we will strongly control the situation and inform you of the cause of the incident in time.Active information such as security measures.", "label": ["Important", "Data Security"], "rewrite": "When your information is leaked, we will inform you of the relevant information such as the cause of the incident and security measures in time."}
{"task": "rw_81.jsonl", "id": 65063, "text": "We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand.", "label": ["Important", "Data Security"], "rewrite": "We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand."}
{"task": "rw_81.jsonl", "id": 65064, "text": "Once the user information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have adopted or we are going to take, your suggestions that can prevent and reduce risks independently prevent and reduce risksRemedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "Once the user information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact, disposal measures, suggestions, and remedy measures."}
{"task": "rw_81.jsonl", "id": 65065, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_81.jsonl", "id": 65066, "text": "At the same time, we will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities."}
{"task": "rw_81.jsonl", "id": 65067, "text": "6 Please understand that the personal information protection measures we provide are only applicable to Weibo.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65068, "text": "Once you leave Weibo, browse or use other websites, services and content resources, we are not capable and obliged to protect any personal information submitted by your website other than Weibo. Whether you log in or browse the above website based on Weibo links based on Weibo linksOr guide.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65069, "text": "5. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65070, "text": "1 Storage location", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65071, "text": "In accordance with the applicable data protection laws, we have stored your personal information collected in the country in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "In accordance with the applicable data protection laws, we have stored your personal information collected in the country in the territory of the People's Republic of China."}
{"task": "rw_81.jsonl", "id": 65072, "text": "At present, we will not use, store, share, and disclose your personal information in cross -border business, or transmit your personal information abroad.", "label": ["Data Retention", "Important"], "rewrite": "We will not use, store, share, and disclose your personal information in cross -border business, or transmit your personal information abroad."}
{"task": "rw_81.jsonl", "id": 65073, "text": "2. If the business changes in the future, we may need to transmit your personal information to other countries or regions.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If the business changes in the future, we may need to transmit your personal information to other countries or regions."}
{"task": "rw_81.jsonl", "id": 65074, "text": "These countries or regions may have different data protection laws, and even related laws are not established.", "label": ["Risk"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65075, "text": "In this case, we will ensure that your personal information is protected at the same level as the domestic level in accordance with the relevant applicable data protection laws.Agree alone (except for other provisions of the applicable data protection law).", "label": ["Data Retention", "Important"], "rewrite": "We will ensure that your personal information is protected by the same level as the country, informs you the necessary matters, implement the corresponding compliance procedures in accordance with the law, and solicit your individual consent."}
{"task": "rw_81.jsonl", "id": 65076, "text": "3 Storage time", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65077, "text": "We only retain your personal information during the period of time, laws and regulations and regulatory requirements for the purpose of this policy.", "label": ["Data Retention", "Important"], "rewrite": "We only retain your personal information during the period of time, laws and regulations and regulatory requirements for the purpose of this policy."}
{"task": "rw_81.jsonl", "id": 65078, "text": "We will save your personal information in accordance with the time limit of the applicable data protection law.", "label": ["Data Retention", "Important"], "rewrite": "We will save your personal information in accordance with the time limit of the applicable data protection law."}
{"task": "rw_81.jsonl", "id": 65079, "text": "After exceeding the statutory preservation period, we will delete or do anonymous processing your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the statutory preservation period, we will delete or do anonymous processing your personal information."}
{"task": "rw_81.jsonl", "id": 65080, "text": "6. Your personal information subject right", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65081, "text": "We attach great importance to your management of personal information and do our best to ensure your access, correction, deletion, withdrawal consent, and other legal rights for personal information, so that you have full ability to maintain your privacy and personal information security.", "label": ["Important", "Edit/Control"], "rewrite": "We attach great importance to your management of personal information and do our best to ensure your access, correction, deletion, withdrawal consent and other legal rights for personal information."}
{"task": "rw_81.jsonl", "id": 65082, "text": "1 Visit, modify, copy, delete your personal information", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65083, "text": "1.1, when you complete your Weibo account registration, you can access, modify, and copy your personal information at any time.", "label": ["Important", "Edit/Control"], "rewrite": "When you complete your Weibo account registration, you can access, modify, and copy your personal information at any time."}
{"task": "rw_81.jsonl", "id": 65084, "text": "1.2 The following situations, you can make a request to delete personal information:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65085, "text": "1.2.1 If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65086, "text": "1.2.2 If our handling of personal information is violated with your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65087, "text": "1.2.3 If we terminate the operation and service of Weibo, or you withdraw your authorization consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65088, "text": "1.2.4 Other circumstances stipulated in laws and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65089, "text": "If we decide to respond to your deletion request, we will also notify the third parties to obtain your personal information from us at the same time, asking them to delete them in time, unless the laws and regulations have other regulations or these third parties have obtained your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the third parties to obtain your personal information from our personal information as much as possible at the same time, asking them to delete them in time."}
{"task": "rw_81.jsonl", "id": 65090, "text": "1.3, personal information that is difficult to access, modify, copy, delete directly on the client, or exercise other legal rights, you can also submit relevant applications to us through contact information provided by this policy.", "label": ["Edit/Control", "Important"], "rewrite": "For personal information that is difficult to access, modify, copy, delete directly on the client, or exercise other legal rights, you can also submit relevant applications to us through contact information provided by this policy."}
{"task": "rw_81.jsonl", "id": 65091, "text": "2 withdraw consent", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65092, "text": "Specific business functions in Weibo will need to be completed based on the information provided by your authorization consent or the device permissions opened. You can withdraw the equal consent by closing the corresponding business function.", "label": ["Important", "Edit/Control"], "rewrite": "The specific business functions in Weibo need to be completed based on the information provided by your authorization consent or the device permissions opened. You can withdraw the equal consent by closing the corresponding business function."}
{"task": "rw_81.jsonl", "id": 65093, "text": "When you withdraw your consent, we cannot continue to provide you with the corresponding functions, and we will not process your corresponding personal information.", "label": ["Edit/Control", "Important"], "rewrite": "When you withdraw your consent, we cannot continue to provide you with the corresponding functions, and we will not process your corresponding personal information."}
{"task": "rw_81.jsonl", "id": 65094, "text": "But your decision to withdraw consent will not affect the personal information processing we carried out based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "But your decision to withdraw consent will not affect the personal information processing we carried out based on your authorization."}
{"task": "rw_81.jsonl", "id": 65095, "text": "3 Logging out account", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65096, "text": "You can cancel your account through the official Weibo client.", "label": ["Important", "Edit/Control"], "rewrite": "You can cancel your account through the official Weibo client."}
{"task": "rw_81.jsonl", "id": 65097, "text": "Please understand that cancellation of accounts is an irreplaceable operation.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65098, "text": "Given that we use a unified account system, once you cancel your account, we will delete all information about your account (including the information you log in to the same account and other applications provided by the affiliated parties), but the laws and regulations also stipulateExcept.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Once you log out your account, we will delete all information about your account, except for other provisions of laws and regulations."}
{"task": "rw_81.jsonl", "id": 65099, "text": "You can't re -obtain related services for Weibo and other applications through the cancellation account.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65100, "text": "4 response to your request", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65101, "text": "4.1 To ensure safety, we will deal with your request in time after verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65102, "text": "For unseen repetition, too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks or very unrealistic requests to the legitimate rights and interests of others, we may refuse.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "We may refuse for no repetition, too much technical means, risk or very unrealistic requests to others, or very unrealistic requests."}
{"task": "rw_81.jsonl", "id": 65103, "text": "If there is one of the following circumstances, we may not be able to respond to your request:", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "If there is one of the following circumstances, we may not be able to respond to your request:"}
{"task": "rw_81.jsonl", "id": 65104, "text": "4.1.1, related to our obligations stipulated in the performance of our laws and regulations;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "What is related to our obligations stipulated in our law and regulations may not be able to respond to the request."}
{"task": "rw_81.jsonl", "id": 65105, "text": "4.1.2, directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Directly related to national security and national defense security may not be able to respond to requests."}
{"task": "rw_81.jsonl", "id": 65106, "text": "4.1.3, directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests may not be able to respond to requests."}
{"task": "rw_81.jsonl", "id": 65107, "text": "4.1.4, directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to requests."}
{"task": "rw_81.jsonl", "id": 65108, "text": "4.1.5, we have sufficient evidence that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, we cannot respond to requests."}
{"task": "rw_81.jsonl", "id": 65109, "text": "4.1.6, because of maintaining major legitimate rights and interests such as the life and property of others or others, it is difficult to get my authorization consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It is difficult for the major and legitimate rights and interests to obtain the consent of my authority and cannot respond to the request."}
{"task": "rw_81.jsonl", "id": 65110, "text": "4.1.7, responding to your request will cause you or the legitimate rights and interests of others or organizations to be seriously damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Responding to your request will cause serious damage to the legitimate rights and interests of you or others and organizations, and cannot respond to the request."}
{"task": "rw_81.jsonl", "id": 65111, "text": "4.1.8, involved business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_81.jsonl", "id": 65112, "text": "5. If we terminate our services or operations, we will notify you at least 30 days in advance, and delete or anonymous processing of your personal information after termination of services or operation.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "If we terminate services or operations, we will notify you at least 30 days in advance and delete or processes your personal information after terminating the service."}
{"task": "rw_81.jsonl", "id": 65113, "text": "7. How do we collect and handle personal information of minors", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65114, "text": "1. If you are a minor under the age of 18, before using Weibo, you should read and decide if your parents (or other guardians) are monitored and guided.It stipulates the protection of personal information of minors.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of 18, before using Weibo, you should read and decide whether to agree with this policy under your parents' guardianship and guidance."}
{"task": "rw_81.jsonl", "id": 65115, "text": "2. If you are a child under the age of 14 and want to use Weibo, please inform your parents (or other guardians) and the \"Youth Model\" on Weibo in detail to learn more about the \"Personal Information Protection Policy for Children on Weibo\".We need to obtain the consent of your parents (or other guardians) before you start using Weibo.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child under the age of 14 and want to use Weibo, we need to obtain your parents (or other guardians) before you start using Weibo."}
{"task": "rw_81.jsonl", "id": 65116, "text": "8. Update of this policy", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65117, "text": "1 In order to provide you with better services and with the development of our business, this policy will be updated.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65118, "text": "For major changes, we will also provide more prominent notifications (we will explain the specific changes of this policy through the methods including but not limited to mail, text messages, private messages, or make special prompts on the browsing page).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide a more significant notice."}
{"task": "rw_81.jsonl", "id": 65119, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65120, "text": "1.1 Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65121, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65122, "text": "1.2 We have undergone major changes in the aspects of ownership structure and organizational structure, which leads to changes in the main body of actual collection and processing of your personal information, such as changes in the owner caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65123, "text": "1.3 The main objects of personal information sharing, transfer or public disclosure have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65124, "text": "1.4 The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65125, "text": "1.5 When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65126, "text": "1.6 Personal information security impact assessment report shows that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65127, "text": "2. We will issue an updated version on the website and client (setting- \"About Weibo\"), and remind you to update the relevant content through the website announcement or other appropriate ways before taking effect, so that you can understand the latest version of this policy in time.Essence", "label": ["Policy Change", "Important"], "rewrite": "We will issue a updated version on the website and client (setting- \"about Weibo\"), and remind you to update the relevant content through the website announcement or other appropriate ways before taking effect."}
{"task": "rw_81.jsonl", "id": 65128, "text": "You agree and continue to use Weibo, which means that you agree with the content of this policy (including the updated version).", "label": ["Policy Change", "Important"], "rewrite": "You agree and continue to use Weibo, which means that you agree with the content of this policy (including the updated version)."}
{"task": "rw_81.jsonl", "id": 65129, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65130, "text": "If you have any problems with this policy or related matters, especially if we think that our personal information processing behavior has damaged your legitimate rights and interests, you can get in touch with us at any time.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65131, "text": "We will review the issues involved as soon as possible and respond in time in time in accordance with the requirements of the applicable data to protect the law.", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65132, "text": "Customer Service Hotline: 400-096-0960", "label": ["Important", "Contact Information"], "rewrite": "Customer service hotline: 400-096-0960."}
{"task": "rw_81.jsonl", "id": 65133, "text": "Online Customer Service:@Weibo customer service, private message contact Weibo customer service", "label": [], "rewrite": []}
{"task": "rw_81.jsonl", "id": 65134, "text": "Common office address: Sina Headquarters Building, Building 8, No. 8 West District, West District, Wandong Road, Northwest, Haidian District, Beijing", "label": ["Important", "Contact Information"], "rewrite": "Common office address: Sina headquarters Building, Building 8, No. 8 West District, Wangdong Road, Northwest, Haidian District, Beijing."}
{"task": "rw_81.jsonl", "id": 65135, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
