{"task": "rw_84.jsonl", "id": 65558, "text": "Xiaohongshu user privacy policy", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65559, "text": "Xiaohongshu user privacy policy (concise version)", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65560, "text": "Update date: April 30, 2022", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65561, "text": "Effective date: May 01, 2022", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65562, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65563, "text": "Xiaohongshu (hereinafter referred to as \"we\") respects and protects the personal information and privacy of all Xiaohongshu users.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65564, "text": "In order to provide you with more accurate, personalized services and more secure Internet environment, we are based\"Personal Information Security Specifications\" and other relevant laws and regulations and technical specifications clearly clarify the principles of collecting/use/external information, and further explain the relevant rights on your personal information.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65565, "text": "This policy is closely related to the/or services you use. You are downloading, installation, starting, browsing, registering, logging in, and using our products and/or services (hereinafter collectively referred to \"using our products and/or services\") At the time, we will process and protect your personal information in accordance with the agreement of this policy.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65566, "text": "We try to explain the technical vocabulary involved in this policy in a concise expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65567, "text": "There is a major relationship with your rights (possibly) in this policy. We have used bold fonts to distinguish it. Please focus on it.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65568, "text": "Xiaohongshu specifically mentioned the attention of minors under the age of 18 (especially children under the age of 14) and their guardians. We have made it clear that the special chapters of the minor protection (prompt with the rough body), please read it carefully.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65569, "text": "Before using/continue to use our products and services, read carefully and fully understand this policy, and make appropriate choices in accordance with the guidance of this policy when needed.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65570, "text": "If you do not agree with the content of this policy, it may cause our products and/or services to be unable to run normally, or to achieve the service effect we are going to achieve, you should immediately stop access/use our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65571, "text": "If you use or continue to use the products and/or services we provide, you all say that you fully understand and agree with all the contents of the \"Little Red Book User Privacy Policy\" (including the updated version).", "label": ["Policy Change", "Important"], "rewrite": "Using or continuing to use products and/or services, it means that you fully understand and agree with all the contents of the \"Little Red Book User Privacy Policy\" (including the updated version)."}
{"task": "rw_84.jsonl", "id": 65572, "text": "about Us", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65573, "text": "The operators of the Xiaohongshu website and APP are Xingyin Information Technology (Shanghai) Co., Ltd. and their affiliated companies.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65574, "text": "The registered address is Room 4D67, No. 1611 Cao'an Highway, Jiading District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65575, "text": "Table of contents", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65576, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65577, "text": "2. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65578, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65579, "text": "4. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65580, "text": "5. How do you log out your account", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65581, "text": "6. Special description of products and/or services related to third parties", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65582, "text": "7. How do we use cookies and other similar technologies", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65583, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65584, "text": "Nine, how do we update privacy policies", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65585, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65586, "text": "Eleven, others", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65587, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65588, "text": "You understand and agree:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65589, "text": "Xiaohongshu is a lifestyle platform for young people. Xiaohongshu uses the mission of \"sharing and discovering the world\" as \"Inspire Lives\". Users can record life through short videos, graphics and other forms, share lifestyle, and form based on interests.interactive.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65590, "text": "We will explain to you in this policy to explain the scope of personal information, collecting purposes, collection methods, and refusing to provide personal information that may be caused by the results of each function.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65591, "text": "Please know that when you refuse to provide the corresponding information you do, you can still use other functions of the Little Red Book APP.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65592, "text": "We will follow the principles of legitimate, legal, and necessary. For the following goals described in this policy, collect and use personal information that you actively provide or use our products and/or services during the use of our service.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will follow the principles of legitimate, legal, and necessary, and collect and use personal information that you actively provide or use products and/or services."}
{"task": "rw_84.jsonl", "id": 65593, "text": "If we want to use your personal information for other purposes that are not stated in this policy, or use the information that has been collected for other purposes based on specific purposes, we will inform you in a reasonable way, and recruit again before useYour consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you want to use your personal information for other purposes or purposes that are not stated in this policy, it will be informed in a reasonable way and re -obtain consent before use."}
{"task": "rw_84.jsonl", "id": 65594, "text": "You can check the details through [I-Settings-Personal Information Collection List].", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65595, "text": "Account registration and login", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65596, "text": "1.1. When you register and log in, if you use one -click login function, based on our cooperation with communication operators, we will collect your [mobile phone number and network operator information] to provide you with fast login loginServe;", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your [mobile phone number and network operator information] in order to provide you with a fast login service."}
{"task": "rw_84.jsonl", "id": 65597, "text": "At the same time, in order to help you complete the registration process, we will also collect you, [Interest], thinking that you provide the initial service of Xiaohongshu.", "label": ["Important", "First Party Collection Information"], "rewrite": "To help you complete the registration, we will also collect your [interest], thinking that you provide the initial service of Xiaohongshu."}
{"task": "rw_84.jsonl", "id": 65598, "text": "1.2. If you log in with a third -party account, in order to meet the requirements of the online real -name system, before you use the functions and services that are published, commenting, and other requirements for real -name authentication, we will collect separately for your mobile phone number to complete the real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "Before you use the functions and services that are published, commenting, and other real -name authentication, you will collect another mobile phone number to complete the real -name authentication."}
{"task": "rw_84.jsonl", "id": 65599, "text": "Please provide such information after careful consideration. If you refuse to provide it, you may not be able to use the corresponding functions normally.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Please provide such information after careful consideration. If you refuse to provide it, you may not be able to use the corresponding functions normally."}
{"task": "rw_84.jsonl", "id": 65600, "text": "1.3., You can also choose to fill in or change your avatar, name, gender, birthday, occupation, region, school, school, profile, and wearing information to improve your information, but if you do not provide such informationYou use this product and related services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to fill in or change the avatar, name, gender, birthday, occupation, region, school, profile, wearing information to improve information, and not providing such information will not affect the use of this product and related services."}
{"task": "rw_84.jsonl", "id": 65601, "text": "1.4. If you successfully register the Xiaohongshu account, we will display your name, avatar, area, profile information in the Xiahongshu application and website.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you successfully register for Xiaohongshu account, you will display your name, avatar, area, and profile information on the website."}
{"task": "rw_84.jsonl", "id": 65602, "text": "1.5. When using the \"Little Red Book\" client application and related websites, the account you registered on the \"Little Red Book\" client application can be logged in to the \"Little Red Book Video Edition\", The specified name is performed on the above name, the following is referred to as the \"Little Red Book Video Edition\") and other different versions of client applications and obtained the related functions of the video version of the Little Red Book, but some use the third -party account to registerExcept for the situation.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65603, "text": "If you log in to the account and use the video version of the Little Red Book, you should also be restricted by the \"Little Red Book Video Edition\" user service agreement, the \"\" Little Red Book Video Edition \"privacy policy and related agreement terms.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65604, "text": "Provide you with products and/or services", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65605, "text": "2.1. Information browsing, publishing, likes, collection, sharing functions.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65606, "text": "2.1.1. In order to provide you with the core information display service and recommend notes and related information that may be interested in, we will collect your personal information, your browsing records (your attention, browsing), and click operationsRecords (interests, click, search, likes, collection, sharing, review, release records and related behaviors).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your personal information, your browsing records (your attention, browsing), and click -through operation records (interest, click, search, like, collect, share, comment, release records and related behaviors)."}
{"task": "rw_84.jsonl", "id": 65607, "text": "If you want to close the recommendations we make to you based on relevant information, you can follow Article 2.14 of this policy.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65608, "text": "2.1.2. When you use publishing and editing content functions, we will ask you to authorize storage (album, media and other files), camera (camera), microphone (recording) permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask you to authorize storage (album, media and other files), camera (camera), and microphone (recording) permissions."}
{"task": "rw_84.jsonl", "id": 65609, "text": "If you refuse to authorize, you will not be able to use the corresponding function, but it will not affect other functions of your normally use Xiahongshu.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you refuse to authorize, you will not be able to use the corresponding function, but it will not affect your normal use of other functions."}
{"task": "rw_84.jsonl", "id": 65610, "text": "In order to improve the upload speed, rich release function and optimization experience of the video, before you click \"Release Notes\", we will temporarily load the video you edited to the server.", "label": ["Data Retention", "Important"], "rewrite": "Before you click \"Release Notes\", we will temporarily load your edited videos to the server."}
{"task": "rw_84.jsonl", "id": 65611, "text": "If you quit the editor page or not publish notes for other reasons, we will immediately delete relevant videos.", "label": ["Data Retention", "Important"], "rewrite": "If you exit the editor page or not publish notes for other reasons, we will immediately delete the relevant videos."}
{"task": "rw_84.jsonl", "id": 65612, "text": "You can turn off this feature through [Me-Settings-General Settings-Do not allow release when publishing].", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off this feature through [Me-Settings-General Settings-Do not allow release when publishing]."}
{"task": "rw_84.jsonl", "id": 65613, "text": "2.1.3. When you use publishing, comments, likes, collections, and sharing functions, the text, photos, videos, audio, reviews, likes, collection, and sharing record information you publish will be stored in our server becauseStorage is necessary to implement this function.", "label": ["Data Retention", "Important"], "rewrite": "Published text, photos, videos, audio, reviews, likes, collection, sharing record information will be stored in our server."}
{"task": "rw_84.jsonl", "id": 65614, "text": "We will store it in an encrypted manner, and you can delete this information at any time.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will store it in an encrypted manner, and you can delete information at any time."}
{"task": "rw_84.jsonl", "id": 65615, "text": "2.2. Security operation and risk control verification.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65616, "text": "In order to ensure the safe operation of software and services, prevent your personal information from being illegally obtained, and more accurately prevent fraud and protect account security, we will collect your device information [including equipment models, equipment names, SIM card serial numbers, equipment, equipment, equipmentDevice hardware address (MAC address), login IP address, method of accessing networks, network quality data, mobile network information (including operator name), product version number, and software usage record information. If you do not agree with us to collect the aforementioned information,It may not be able to complete risk control verification.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your device information [including: device model, device name, SIM card serial number, the unique identifier of the device (including: IMEI, IMSI, Androidid, IDFA, OAID)]File), browser type and settings, language settings, sensors, operating systems and application versions, network device hardware addresses (MAC address), login IP address, access network method, network quality data, mobile network information (including operational operations (including operationsBusiness name), product version number and software usage record information. If you do not agree with us to collect the aforementioned information, you may not be able to complete risk control verification."}
{"task": "rw_84.jsonl", "id": 65617, "text": "Please understand that in order to dynamically detect whether your account is abnormal login, every time you switch Xiaohongshu to the background or restart the program, we may read again, and we will control the frequency of reading within a reasonable range.", "label": ["Important", "First Party Collection Information"], "rewrite": "Every time you switch Xiaohongshu to the background or restart the program, you may read the account again, and the reading frequency will be controlled within a reasonable range."}
{"task": "rw_84.jsonl", "id": 65618, "text": "In order to maintain network security and ensure a good ecology, the belonging information corresponding to your IP address will be displayed in your personal data page, notes publishing page and comments.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The regional information corresponding to your IP address will be displayed in your personal data page, notes publishing page and comments."}
{"task": "rw_84.jsonl", "id": 65619, "text": "Display in the province (district, city), and overseas display to the country (region). The information is based on data of network operators.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Display in the province (district, city), and overseas display to the country (region). The information is based on data of network operators."}
{"task": "rw_84.jsonl", "id": 65620, "text": "2.3. Search function.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65621, "text": "When you use the small red book search function, we will collect your query keywords, reading records and access time, review and interactive records.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the small red book search function, you will collect the keywords, reading records and access time, review and interactive records of your query."}
{"task": "rw_84.jsonl", "id": 65622, "text": "Collecting this information can provide you with the content you need and that you may be more interested in, and at the same time can improve our products and services.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65623, "text": "2.4. Positioning function.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65624, "text": "When you open the equipment positioning function and use the relevant services provided by the Little Red Book based on the geographical location (including content recommendation, content release, shopping editing receiving information, data editing)Regarding your geographical information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you open the device positioning function and use the relevant services provided by the Little Red Book based on the geographical location, you may obtain the geographical location information after the pop -up window."}
{"task": "rw_84.jsonl", "id": 65625, "text": "Geographical location information is a personal sensitive information. If you refuse to provide the information, you will not be able to use the relevant services provided by the above -mentioned location, but it does not affect other functions of your normally using Xiahongshu.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide geographical information, you will not be able to use the relevant services provided by the location, but do not affect the normal use of other functions."}
{"task": "rw_84.jsonl", "id": 65626, "text": "2.5. Interactive function and service.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65627, "text": "2.5.1. When you pay attention to your interesting account, browsing, comments, likes, collections, and sharing content, we will collect the accounts and the aforementioned information you pay attention to, and show you the content you follow the account publishing;", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the accounts and related information you are concerned about and show you the content you follow the account publishing."}
{"task": "rw_84.jsonl", "id": 65628, "text": "At the same time, the content you like or collection will be displayed to your fans. You can set the collection content only by yourself. You can open it in [I]-[Favorites]-[Favorite Album].", "label": ["Important", "Edit/Control"], "rewrite": "The content you like or collection will be displayed to the fans. You can set the collection content only by yourself, and you can only see it in [I]-[Favorites]-[Favorite Album]."}
{"task": "rw_84.jsonl", "id": 65629, "text": "2.5.2. When you use a recommended communication recorder function or you actively discover your friends, after obtaining your consent, we will collect your address book information to show you the friends in the communication record.You can see you use the Little Red Book service.", "label": ["Important", "First Party Collection Information"], "rewrite": "After obtaining the consent, we will collect your address book information to show you friends in the communication record."}
{"task": "rw_84.jsonl", "id": 65630, "text": "If you don't want to be recommended, you can choose to close in the upper left corner- [Settings]-[Privacy Settings]-[Don't recommend me to someone you may know].", "label": ["Important", "Edit/Control"], "rewrite": "If you don't want to be recommended, you can choose to close in the upper left corner- [Settings]-[Privacy Settings]-[Don't recommend me to someone you may know]."}
{"task": "rw_84.jsonl", "id": 65631, "text": "The address book information is a personal sensitive information. Rejection of the information will only make you unable to use the above features, but it does not affect other functions of your normally using Xiaohongshu and related services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide address book information only makes you unable to use your friends recommendation, but does not affect your normal use of other functions."}
{"task": "rw_84.jsonl", "id": 65632, "text": "2.5.3. When you buy a product or service, if you need to edit the receiving information, we may ask you to ask you to recording the power.Information, but does not affect the use of other functions.", "label": ["Permission Acquisition", "Important", "Risk"], "rewrite": "Edit receipt information may request communication recording rights, and refuse to provide provision only to edit the receipt information through the address book, but does not affect the use of other functions."}
{"task": "rw_84.jsonl", "id": 65633, "text": "2.5.4. When you choose to use a code to add friends, we may ask you to ask the camera (camera) permissions. The camera (camera) permissions are sensitive permissions. Recommendation will only make you unable to add friends through the code scanning channel. NoAffects the use of other functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Sweeping a friend may request the camera (camera) permissions, and refuse to provide it that it will only make you unable to add friends through the code scanning channel, and will not affect the use of other functions."}
{"task": "rw_84.jsonl", "id": 65634, "text": "2.6. Buy, query, and use virtual property.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65635, "text": "In order to facilitate you to query virtual property and minimize the possible risks, [wallet] will record your recharge, balance and usage.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65636, "text": "2.7. Identity authentication function and account number recovered.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65637, "text": "2.7.1. When you apply for identity authentication function as a certified user, we may collect your identity information, including your real name, identity document number or photo, facial recognition information to prove your personal identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may collect your identity information, including your real name, ID number or photo, facial recognition information to prove your personal identity."}
{"task": "rw_84.jsonl", "id": 65638, "text": "If you refuse to provide it, it will not affect the normal use of other functions of Xiaohongshu.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide identity information, it will not affect the normal use of other functions of Xiaohongshu."}
{"task": "rw_84.jsonl", "id": 65639, "text": "2.7.2. When you use your account to retrieve your function, we may collect your identity information, including your real name, ID number or photo, facial recognition information, to prove your identity, so that you can find your small recovery smallRed book account.", "label": ["Important", "First Party Collection Information"], "rewrite": "Will collect your identity information to confirm your identity, so that you can retrieve Xiaohongshu account."}
{"task": "rw_84.jsonl", "id": 65640, "text": "If you refuse to provide it, it will not affect the normal use of other functions of Xiaohongshu.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide identity information, it will not affect the normal use of other functions of Xiaohongshu."}
{"task": "rw_84.jsonl", "id": 65641, "text": "2.7.3. When you apply for a live broadcast function, according to the requirements of laws and regulations, we may collect your identity information, including your real name, identity document number or photo, facial recognition information to confirm your personal identityEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "When applying for a live broadcast function, you will collect your identity information to prove your identity."}
{"task": "rw_84.jsonl", "id": 65642, "text": "If you refuse to provide it, it will not affect the normal use of other functions of Xiaohongshu.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide identity information, it will not affect the normal use of other functions of Xiaohongshu."}
{"task": "rw_84.jsonl", "id": 65643, "text": "2.7.4. When you apply for product cooperation function, according to the requirements of laws and regulations, we may collect your identity information, including your real name, ID number or photo, facial recognition information, to prove your personal identityItems", "label": ["Important", "First Party Collection Information"], "rewrite": "When applying for product cooperation functions, you may collect your identity information to prove your identity."}
{"task": "rw_84.jsonl", "id": 65644, "text": "To help you complete product cooperation smoothly, we may collect your mobile phone number or WeChat signal.", "label": ["Important", "First Party Collection Information"], "rewrite": "To help you complete product cooperation smoothly, your mobile phone number or WeChat may be collected."}
{"task": "rw_84.jsonl", "id": 65645, "text": "If you refuse to provide it, it will not affect the normal use of other functions of Xiaohongshu.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number or WeChat signal, it will not affect the normal use of other functions of Xiaohongshu."}
{"task": "rw_84.jsonl", "id": 65646, "text": "2.7.5. When you apply for brand cooperation function, in order to verify your personal identity and determine whether you meet the admission conditions of the brand cooperation function, we may collect your real name, ID number or photo, Xiaohongshu, Xiaohongshu, Xiaohongshu, Xiaohongshu, Xiaohongshu, XiaohongshuAccount information, occupation, education, and income details information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When applying for brand cooperation function, you will collect your real name, ID number or photo, Xiaohongshu account information, occupation, education, and income details."}
{"task": "rw_84.jsonl", "id": 65647, "text": "If you refuse to provide it, it will not affect the normal use of other functions of Xiaohongshu.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide personal information, it will not affect the normal use of other functions of Xiaohongshu."}
{"task": "rw_84.jsonl", "id": 65648, "text": "2.8. Product purchase function.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65649, "text": "You can order goods/services in Xiaohong Book Mall.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65650, "text": "Transaction amount, payment method, consignee name, address, contact number, logistics information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When placing an order transaction, you will collect trading product/service information, order number, order time, transaction amount, payment method, the name of the consignee, address, contact phone number, logistics information."}
{"task": "rw_84.jsonl", "id": 65651, "text": "For some special types of goods and services, you also need to provide other information necessary for the product or service, such as you need to provide your real name, ID number, and front and back photos of your ID when cross -border transactions are involved in cross -border transactions to complete customs clearance.", "label": ["Important", "First Party Collection Information"], "rewrite": "For some special types of goods and services, you also need to provide other information necessary for the product or service."}
{"task": "rw_84.jsonl", "id": 65652, "text": "2.9. When you apply for digital collections, we may collect your identity information, including your real name, ID number or photo, and facial recognition information to prove your personal identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you apply for a digital collection function, we may collect your identity information to prove your personal identity."}
{"task": "rw_84.jsonl", "id": 65653, "text": "2.10. Customer service and after -sales service functions.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65654, "text": "When you contact our customer service or propose our product and/or service after -sales application, our system may record the communication records between you and customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our system may record the communication records between you and customer service."}
{"task": "rw_84.jsonl", "id": 65655, "text": "For your account and system security, we may need to provide relevant personal information to match the personal information you provided before to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may need you to provide relevant personal information with the personal information provided before to verify your user identity."}
{"task": "rw_84.jsonl", "id": 65656, "text": "After the verification is successful, we may collect your communication information with us (account information, order information, pictures/videos/text information and related information you provided to prove the facts), your contact information, and your communication with usRecords, including online communication records and telephone recording, in order to solve problems and improve our products and/or services for you as soon as possible.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your communication information and your contact information to solve problems and improve services."}
{"task": "rw_84.jsonl", "id": 65657, "text": "At the same time, we may take the initiative to contact you by phone, SMS, in -site letters, and related methods to communicate the problems you generated during our products and services.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65658, "text": "In order to ensure the service experience and processing service disputes, the call information between you and customer service may be recorded.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65659, "text": "The collection and use of the above information are as follows:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65660, "text": "2.10.1. When you use a small red book service to have disputes with the platform or merchant, we can retrieve and use recording information as a reference for resolving disputes.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may retrieve and use recording information as a reference for resolving disputes."}
{"task": "rw_84.jsonl", "id": 65661, "text": "2.10.2. In order to provide you with customer service and after -sales service, we may store your call recording in a third -party customer service system. We will ensure that third parties cannot access your call recording through agreement constraints and other methods;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We may store your call recording in a third -party customer service system, and will ensure that third parties cannot access your call recording through agreement constraints and other methods."}
{"task": "rw_84.jsonl", "id": 65662, "text": "Except for the following circumstances, the platform will not provide the recording to anyone (including the master of the call, the name of the call): a.", "label": ["Important", "Risk"], "rewrite": "Except for the following circumstances, the platform will not provide the recording to anyone (including the call master, the call side): a. The authority has the right to retrieve it according to legal procedures."}
{"task": "rw_84.jsonl", "id": 65663, "text": "b. The recording of the legal documents issued by the judicial organs was retrieved according to law.", "label": ["Important", "Risk"], "rewrite": "When the recording party holds the legal documents issued by the judiciary according to law, the platform will provide recording."}
{"task": "rw_84.jsonl", "id": 65664, "text": "2.11. Payment function.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65665, "text": "You can buy goods/services and Xiaohongshu membership services in Xiaohongshu.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65666, "text": "Payment may be required during the process of using this feature. During the payment process, we may collect your third -party payment account (Alipay account, WeChat account, UnionPay account and related account).", "label": ["Important", "First Party Collection Information"], "rewrite": "During the payment process, your third -party payment account may be collected (Alipay account, WeChat account, UnionPay account and related account)."}
{"task": "rw_84.jsonl", "id": 65667, "text": "2.12. Pre -filling function.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65668, "text": "When you fill in the form or order information on the Xiaohong Book platform, save time to help you, we will help you with the names, gender (such as), mobile phone number, region (if) provided by youAutomatically fill in form information.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65669, "text": "2.13. Skin measurement and makeup function.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65670, "text": "When you use the skin measurement or makeup test function provided by Xiaohongshu, we may need to collect your storage (album, media and other files), camera (camera) permissions or facial information after the pop -up window is obtained by pop -up windowI think you provide this service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Collect your storage (album, media, and other files), camera (camera) permissions or facial information through pop -ups to obtain a separate consent to provide skin measurement or makeup test function."}
{"task": "rw_84.jsonl", "id": 65671, "text": "But we will not store your facial feature information after providing skin measurement and makeup testing services.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We will not store your facial feature information after providing skin measurement and makeup services."}
{"task": "rw_84.jsonl", "id": 65672, "text": "If you refuse to provide the aforementioned feature information, you will not be able to experience our skin measurement and makeup function, but it will not affect the normal use of other functions of Xiaohongshu.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the aforementioned feature information, you will not be able to experience the skin measurement and makeup function, but it will not affect the normal use of other functions."}
{"task": "rw_84.jsonl", "id": 65673, "text": "Please note that because the above -mentioned facial feature information is directly related to your personal and property security, you need to consider it carefully when you provide us.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65674, "text": "We will only collect your above facial feature information based on the purpose of providing you with skin measurement and makeup service, and the processing of personal information will only affect the results of the skin measurement and makeup function you experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "Based on the purpose of providing skin measurement and makeup service, collect your above facial feature information."}
{"task": "rw_84.jsonl", "id": 65675, "text": "2.14. To ensure that you can maintain instant communication with the background server when using the Little Red Book platform, and you can receive personalized content push in time.Xiaohongshu or its related company mobile client software, II) uses a third -party message push service to generate the uniqueness of the identifier ID for you to distinguish your device, III) read the mobile phone status to judge the small red book softwareIn the front desk or backstage, to improve the timeliness of the push service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We will be i) Get and call the boot broadcast right for starting a small red book or a mobile client software for a related company, II) uses a third -party message push service to generate identifier ID for youstate."}
{"task": "rw_84.jsonl", "id": 65676, "text": "2.15. To show you personalized content or ensure that you can know more suitable content, we may collect records of search/play/display recommendation content on your Little Red Book platform, audio and video playback, orUse your personal data information (such as gender, birthday).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is possible that you can collect records of search/play/display recommendation content on the Xiaohong Book platform, audio and video playback records, or use personal data information (such as gender, birthday)."}
{"task": "rw_84.jsonl", "id": 65677, "text": "If you are not interested in the push content or want to reduce certain information push, you can press the content of the note and click \"Not interested\".", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "When you are not interested in the push content or want to reduce the push, you can press the content of the notes and click \"Not interested\"."}
{"task": "rw_84.jsonl", "id": 65678, "text": "You can also choose to close the push information, you can go to [I]-click the upper left corner- [Settings]-[Privacy Settings]-[Personalized options] Close the personalized recommendation mechanism.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can choose to close the push information, and you can go to [I]-click on the upper left corner- [Settings]-[Privacy Settings]-[Personalized Options] Close the personalized recommendation mechanism."}
{"task": "rw_84.jsonl", "id": 65679, "text": "2.16. To provide you with more convenient and more in line with your personalized needs, the product information display, search and push service, we will, according to your, equipment information (including the device information and mobile application list information described in Article 2.2), and youWhen using the small red book client, browse the use of information, purchase records, extract your preference characteristics, and use the indirect portrait portrait based on the characteristic label output to display, push information and possible commercial advertisements (please youUnderstand that separate equipment information cannot identify the identity information of a specific natural person.", "label": ["Important", "Usage"], "rewrite": "We will use your device information and use the small red book client to use information and purchase records, purchase records, extract the preference features, and based on featured label output indirect crowd portraits."}
{"task": "rw_84.jsonl", "id": 65680, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will make such personal information anonymous processing).", "label": ["Important", "Data Security", "Usage"], "rewrite": "During the combination of use, non -personal information will be regarded as personal information. Except for obtaining your authorization or other provisions of laws and regulations, this type of personal information will be anonymous."}
{"task": "rw_84.jsonl", "id": 65681, "text": "For your contact information (telephone, mailbox and other contact information) provided in the process of using our products or services, we may provide you with SMS and telephones in the operation.Function or activities and related commercial information.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65682, "text": "We strive to ensure your browsing experience.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65683, "text": "If you don't want to accept the commercial advertisement we send to you, you can reply or close the withdrawal or other ways provided by SMS prompts, or you can contact us directly.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65684, "text": "2.17.In the case of you sharing or sharing information and participating in activities, we need to access your shear plates and read the passwords, sharing codes, and links contained in it, thinking that you can achieve jumping, sharing, activity linkage functions or services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You need to access your shear board to read the passwords, sharing codes, and links to achieve the function or service of jumping, sharing, and activities for you."}
{"task": "rw_84.jsonl", "id": 65685, "text": "2.18.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65686, "text": "In the process of providing the service, we will call your main equipment rights.", "label": ["Permission Acquisition", "Important"], "rewrite": "The summary of your main equipment rights will be called as follows:"}
{"task": "rw_84.jsonl", "id": 65687, "text": "You can choose to close part or all permissions in the setting function of the device.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can choose to close part or all permissions in the setting function of the device."}
{"task": "rw_84.jsonl", "id": 65688, "text": "Among different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or instructions:", "label": ["Important", "Edit/Control"], "rewrite": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance."}
{"task": "rw_84.jsonl", "id": 65689, "text": "Device permissions corresponding business function scenarios indicate whether it can be closed", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65690, "text": "Microphone (recording), 1. Content release, 2. live broadcast, 3. message and chat, 1. Recording when publishing content, 2. Turn on the live broadcast, send voice messages when chatting with other users, send voice messages, go to the mall to the mall,When the online customer service releases short video content, it can be recorded. Yes, it can only affect the corresponding function after closing, and it does not affect other functions of the APP.", "label": ["Important", "Edit/Control"], "rewrite": "The microphone (recording) can be turned off. After closing, it only affects the corresponding function, and does not affect other functions of the app."}
{"task": "rw_84.jsonl", "id": 65691, "text": "Address, 1. Discover or recommend friends, 2. Edit the receipt information during shopping, 1. Discover or recommend friends in the communication records (including message push forms), 2. When users buy goods or services, edit the receipt information, edit the receipt information, andYes, it only affects the corresponding function after closing, and does not affect other functions of the app", "label": ["Important", "Edit/Control"], "rewrite": "Communication recording permissions can be closed. After closed, it only affects the corresponding function, and does not affect other functions of the APP."}
{"task": "rw_84.jsonl", "id": 65692, "text": "Notification, system notification, APP -related message push, you can, only affect the corresponding function after closing, does not affect other functions of the APP", "label": ["Important", "Edit/Control"], "rewrite": "The notification permissions can be closed. After closing, it only affects the corresponding function, and does not affect other functions of the app."}
{"task": "rw_84.jsonl", "id": 65693, "text": "Network permissions, Internet access functions, open Internet access functions, real -time reading and update, you can, the app content after closure cannot be read and updated in real time, and the app cannot be used normally", "label": ["Important", "Edit/Control"], "rewrite": "The network permissions can be closed. After the closure, the app content cannot be read and updated in real time, and the APP cannot be used normally."}
{"task": "rw_84.jsonl", "id": 65694, "text": "Camera (camera), 1. Live, 2. Content notes, 3. Skin measurement, makeup test function, 4. Sweep, news, 6. registered certification, 7.AR shooting function, 1. Start the live broadcast, do it when the live broadcast is performed.Shooting, 2. Posted the content when publishing, 3. Use skin measurement and makeup testing function, 4. Add friends or activity related QR code scanning, 5. When chatting with other usersTake shooting during authentication, 7. When using AR shooting function, shoot, can, only affect the corresponding function after closing, does not affect other functions of the APP", "label": ["Important", "Edit/Control"], "rewrite": "The camera (camera) permissions can be closed. After closed, it only affects the corresponding function, and does not affect other functions of the APP."}
{"task": "rw_84.jsonl", "id": 65695, "text": "Calendar, 1., live broadcast activity reminder, 2. Chat activities reminds, reminder live broadcast and chat activities, can, only affect the corresponding function after closing, does not affect other functions of the app", "label": ["Important", "Edit/Control"], "rewrite": "The permissions of the calendar can be closed. After the closure, it only affects the corresponding function, and does not affect other functions of the APP."}
{"task": "rw_84.jsonl", "id": 65696, "text": "Suspension windows, 1. Live, 2. Chat, suspend the live broadcast and chat screen on other content, yes, it can only affect the corresponding functions after closing, not affect other functions of the APP", "label": ["Important", "Edit/Control"], "rewrite": "The authority of the suspended window can be closed. After closing, it only affects the corresponding function, and does not affect other functions of the APP."}
{"task": "rw_84.jsonl", "id": 65697, "text": "Geographical location, 1. content recommendation, 2. content release, 3. Edit receipt information during shopping, 4. Data editing, 5. Security operation and risk control verification, 1. Recommended content according to the user's location, such as nearby functions, 2 functions, 2. When the user releases the content, positioning the area, such as the user uses positioning stickers, publishing positioning labels, and using markup functions. 3. When the user purchases goods or services, edit and receive information, 4. Personal page editing place, 5. This policy of this policy, this policyArticle 2.2 description, can, only affect the corresponding function after closing, does not affect other functions of the app", "label": ["Edit/Control", "Important"], "rewrite": "Geographical location permissions can be closed. After closing, it only affects the corresponding function, and does not affect other functions of the app."}
{"task": "rw_84.jsonl", "id": 65698, "text": "Storage (album, media and other documents), 1. Registration certification, 2. Content release, content preservation, live broadcast, 5. skin test, 6. message, share, 8. data editing, data editing, data editing, editing, editing9. Feedback of Opinions, 10. Sweep, 11. Safety operation and risk control verification, 1. Upload photos or videos when registering and certification, 2. Read the content of the album and media content, and store it, 3. Log informationRecords, information cache, live broadcast: upload photos, download live content, watch local videos 5. When using skin measurement and makeup testing functions, 6. News: Read album content when communicating with the mall online customer service, 7.Screenshot sharing, 8. Read the album content when editing information selects the avatar picture, 9. Read the album content when using the \"feedback feedback\" function, 10. Add a friend or event related QR code scanning when scanningSafety operation and risk control verification, can, only affect the corresponding function after closing, does not affect other functions of the APP", "label": ["Important", "Edit/Control"], "rewrite": "The permissions of storage (album, media and other files) can be closed. After closing, it only affects the corresponding function, and does not affect other functions of the app."}
{"task": "rw_84.jsonl", "id": 65699, "text": "Phone status (including equipment information and operating status), 1.App safe operation and risk control verification, 2. content recommendation, 3. display and other functional optimization, 1. description of Article 2.2 of this policy, 2. Article 2.15 of this policy Article 2.15Description, 3. Display and other functions optimization, can, only affect the corresponding function after closing, does not affect other functions of the app", "label": ["Important", "Edit/Control"], "rewrite": "Power status (including equipment information and operating status) can be closed. After closing, it only affects the corresponding function, and does not affect other functions of the app."}
{"task": "rw_84.jsonl", "id": 65700, "text": "We may get your personal information from the third party indirectly", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65701, "text": "If you log in with an account on a third -party platform, after you are bound by your clear authorization account, the third -party platform will synchronize the avatars, nicknames, regions (if), gender (if.)And friends information (for Weibo platform), so that you can log in and use Xiaohongshu directly.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you are clearly bound by the authorized account, the third -party platform will synchronize the avatars, nicknames, regions (if.), Gender (such as), and friends information (for Weibo platform)."}
{"task": "rw_84.jsonl", "id": 65702, "text": "If you don't want to be recommended to Weibo friends, you can choose to close in [I]-[Settings]-[Privacy]-[Don't recommend me to Weibo friends].", "label": ["Edit/Control", "First Party Collection Information", "Important"], "rewrite": "If you don't want to be recommended to Weibo friends, you can choose to close in [I]-[Settings]-[Privacy]-[Don't recommend me to Weibo friends]."}
{"task": "rw_84.jsonl", "id": 65703, "text": "Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65704, "text": "According to the provisions of relevant laws and regulations, in the following circumstances, we can collect and use some necessary personal information without obtaining your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, you can collect and use some necessary personal information without the consent of authorization:"}
{"task": "rw_84.jsonl", "id": 65705, "text": "(1) For contracts for the establishment and fulfilling the individual as a party, or to implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law, in accordance with the law;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and fulfilling the required contracts, or to implement the personal information necessary for human resource management in accordance with the labor rules and regulations and collective contracts, no consent is required."}
{"task": "rw_84.jsonl", "id": 65706, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and fulfilling the personal information necessary for legal duties or the required obligations of the legal obligation does not need to solicit consent."}
{"task": "rw_84.jsonl", "id": 65707, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information of the health and health of natural persons and protecting the personal information necessary for the health of natural persons and protecting natural persons without soliciting consent."}
{"task": "rw_84.jsonl", "id": 65708, "text": "(4) Implement news reports and public opinion supervision for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_84.jsonl", "id": 65709, "text": "(5) Treatment of personal information of individuals or other legal disclosure within a reasonable scope in accordance with the \"Personal Information Protection Law\";", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In accordance with the \"Personal Information Protection Law\", it is not required to deal with disclosure of personal information within a reasonable range."}
{"task": "rw_84.jsonl", "id": 65710, "text": "(6) Other circumstances stipulated in laws and regulations", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_84.jsonl", "id": 65711, "text": "2. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65712, "text": "shared:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65713, "text": "For your personal information, we will not share with any company, organization and individual, unless there is the following or more situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Do not share personal information with any company, organization and individual, unless there is the following or more situations:"}
{"task": "rw_84.jsonl", "id": 65714, "text": "(1), you have been authorized in advance;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you have been authorized in advance, you will share personal information."}
{"task": "rw_84.jsonl", "id": 65715, "text": "(2), you put it on your own;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you put it on your own, you will share personal information."}
{"task": "rw_84.jsonl", "id": 65716, "text": "(3), necessary sharing with business partners:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For business cooperation, share personal information."}
{"task": "rw_84.jsonl", "id": 65717, "text": "You understand and know that in order to provide you with more complete and high -quality products and services, we will authorize business partners to provide you with some services.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65718, "text": "In this case, we may share some of your personal information with your partners to provide better customer service and user experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In this case, we may share some of your personal information with your partners."}
{"task": "rw_84.jsonl", "id": 65719, "text": "Please note that we will only share your personal information for legal, correct, necessary, specific, and clear purposes, and we will only share the necessary personal information that provides services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information that provides services."}
{"task": "rw_84.jsonl", "id": 65720, "text": "We will evaluate and process security for the output form, circulation, and use of information data to protect data security.", "label": ["Important", "Data Security"], "rewrite": "Safety assessment and processing of the output, circulation, and use of information data to protect data security."}
{"task": "rw_84.jsonl", "id": 65721, "text": "At the same time, we will strictly supervise and manage partners. Once we find that there are acts of dealing with personal information illegal, we will immediately stop cooperation and investigate their legal responsibilities.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Strict supervision and management of partners, once a behavior of dealing with personal information in violation of regulations is found, they will immediately stop cooperation and investigate legal responsibilities."}
{"task": "rw_84.jsonl", "id": 65722, "text": "At present, our partners include the following types. For details, please refer to the \"Third Party Information Sharing List\":", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our partners include the following types. For details, please refer to the \"Third -Party Information Sharing List\"."}
{"task": "rw_84.jsonl", "id": 65723, "text": "A. The third -party merchant of the platform: To help you realize the purchase of products or services or provide you with after -sales service, the platform's third -party merchants will share your orders and transaction -related information with us.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The platform's third -party merchants will share your orders and transaction -related information with us."}
{"task": "rw_84.jsonl", "id": 65724, "text": "B., third -party logistics service provider: When you successfully place an order, if the product needs to be distributed third -party, we will complete the delivery and distribution of goods to you in accordance with third -party distribution.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the goods need a third -party distribution, third -party logistics companies will know the relevant distribution information during the delivery and delivery session."}
{"task": "rw_84.jsonl", "id": 65725, "text": "Third -party logistics companies will inevitably learn about your related distribution information within the delivery and distribution session.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65726, "text": "We promise you that we will ensure your personal information security with the greatest efforts. We will strictly require third -party logistics companies to keep your personal information confidential and only learn and use only for distribution. We must not leak or do any other use.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will strictly require third -party logistics companies to keep personal information confidential, and shall not leak out or do any other purpose."}
{"task": "rw_84.jsonl", "id": 65727, "text": "C. Advertising and statistical analysis partners: To help make advertising or decision -making suggestions, increase the effective touch rate of advertising, further understand the needs of user needs, we may be entrusted with us to conduct information promotion and advertising partners, or statistical analysis categories, or statistical analysis categories.Partners share the identified device information or statistical information, which is difficult or unable to associate with your true identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Partners who may be entrusted with information promotion and advertising, or statistical analysis partners shared the identified device information or statistical information."}
{"task": "rw_84.jsonl", "id": 65728, "text": "Please know that for your information security, we are currently only cooperating with partners who have signed strict data security confidentiality agreements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We currently cooperate with partners who have signed strict data security confidentiality agreements."}
{"task": "rw_84.jsonl", "id": 65729, "text": "D. Content review service provider: In order to ensure that the content posted on the Internet information platform is safe, we may share the content information you posted on the platform with the entrusted third -party content audit service provider.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May share the content information you posted on the platform with the entrusted third -party content audit service provider."}
{"task": "rw_84.jsonl", "id": 65730, "text": "E., real -name authentication audit service provider: When you conduct real -name authentication or use the recovery account function, we will share your personal information from a third -party audit service provider so that you can recover your account smoothly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the real -name authentication or use the account function, the personal information will be shared with a third -party review service provider, so that you can recover the account smoothly."}
{"task": "rw_84.jsonl", "id": 65731, "text": "F., service provider of skin measurement function: The specific skin measurement function is provided by a third -party service provider in cooperating with Xiaohongshu. When you use this function, we will share with third -party service providers.Personal information so that you can experience this function smoothly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use your skin measurement function, you will share your personal information you provide to the platform with a third -party service provider."}
{"task": "rw_84.jsonl", "id": 65732, "text": "G., third -party applet: When you use a third -party mini -program, without your consent, we will not share your personal information with these developers and operators.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use a third -party mini -program, you will not share your personal information with these developers and operators without consent."}
{"task": "rw_84.jsonl", "id": 65733, "text": "When you use a mini -program, the applet may use the relevant system authority you authorize, and you can withdraw these authorization in the corresponding mini -program.", "label": ["Permission Acquisition", "Edit/Control", "Important"], "rewrite": "The mini program uses the relevant system authorized by your authorization, which can withdraw these authorization in the corresponding mini -program."}
{"task": "rw_84.jsonl", "id": 65734, "text": "H., Digital Collection Technical Service Provider: When you use digital collection functions, we will share your personal information provided by your third -party technical service provider so that you can experience the function smoothly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When using the digital collection function, you will share your personal information with a third -party technical service provider."}
{"task": "rw_84.jsonl", "id": 65735, "text": "I., other business partners: entrust us to promote related partners in promotion and advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Portal information may be shared with partners who entrust us to promote and advertise."}
{"task": "rw_84.jsonl", "id": 65736, "text": "You have authorized us to share the indirect user portraits formed by the partners who entrust us to promote and advertise.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You have authorized us to share indirect user portraits formed by the collection of related information with partners for advertising or decision -making suggestions."}
{"task": "rw_84.jsonl", "id": 65737, "text": "But we promise: without your consent, we will not share with them to recognize your identity personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your consent, we will not share personal information that can recognize your identity with them."}
{"task": "rw_84.jsonl", "id": 65738, "text": "J., cooperative third -party SDK service provider: When you use the functions provided by third parties in the Little Red Book APP, we may access the software development package (SDK) provided by a third party to achieve related functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use the functions provided by a third party in the Xiaohongshu APP, you may access the software development package (SDK) provided by a third party to achieve related functions."}
{"task": "rw_84.jsonl", "id": 65739, "text": "At this time, third -party SDK service providers may collect your relevant personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party SDK service providers may collect your relevant personal information."}
{"task": "rw_84.jsonl", "id": 65740, "text": "We will fulfill their prudential obligations and strictly monitor the aforementioned third -party SDK to protect personal information security:", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Strict security monitoring of the aforementioned third -party SDK to protect personal information security."}
{"task": "rw_84.jsonl", "id": 65741, "text": "a., One -click login function: In order to provide you with an account login -one -click login function, third -party service providers may obtain your necessary device information, network -related information, geographical location, storage (album, media and other documents)(Including collected in the background state) information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "In order to provide an account one -click login function, third -party service providers may obtain information about your necessary device information, network -related information, geographical location, storage (album, media and other documents) (including collected in the background state)."}
{"task": "rw_84.jsonl", "id": 65742, "text": "b., Third -party account login function: In order to provide you with the function of third -party account login, third -party service providers may obtain your necessary device information, network -related information, geographical location, storage (album, media and other documents) (Including collected in the background state) information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party service providers may obtain information about your necessary device information, network -related information, geographical location, storage (album, media and other documents) (including collected in the background state)."}
{"task": "rw_84.jsonl", "id": 65743, "text": "c., Message Push Service: To provide you with message push, third -party push service providers may get your push SDK version number, necessary device information, mobile phone status information, geographical location information, network -related information, storage (album, media, media, media, media, mediaAnd other files) (including collected in the background state) information to push the information that you may be more interested in;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The third -party push service chamber collects your push SDK version number, necessary device information, mobile phone status information, geographical location information, network -related information, storage (album, media and other documents)Message push."}
{"task": "rw_84.jsonl", "id": 65744, "text": "d., Geographical Location Service: In order to provide you with geographical location services (content recommendation, content release, editing receiving information and data editing during shopping), third -party geographical location service providers will collect your equipment information and geographical location information in order to be able to move towards it.You push the nearby content;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "The third -party geographical location service provider will collect your equipment information and geographical location information in order to push nearby content."}
{"task": "rw_84.jsonl", "id": 65745, "text": "e., Cloud Storage Service: To provide you with cloud storage services (pictures you uploaded to Xiaohongshu, audio and video content will be stored in the cloud and related scenarios), third -party service providers may collect your device information, network -related network -related networks, network -related network -related networks, network -related network -related networks, network -related networks related to the network.Information, operator information;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party service providers may collect your equipment information, network -related information, and operator information."}
{"task": "rw_84.jsonl", "id": 65746, "text": "f., Account Security Service: In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement, third -party security service providers may collect your necessary device information, network -related information, andOperator information, log information, storage (album, media and other documents) (including collected in the background state) information to provide account security services;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party security service providers may collect information on your necessary device information, network -related information, operator information, log information, storage (album, media and other documents) (including collected in the background state) to provide account security services."}
{"task": "rw_84.jsonl", "id": 65747, "text": "g., Payment Service: To ensure that you can buy goods/services and virtual products on the platform, third -party payment service providers may collect your equipment information, network information, operator information to achieve smooth completion of payment and ensure payment security;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party payment service providers may collect your equipment information, network information, and operator information for successful payment."}
{"task": "rw_84.jsonl", "id": 65748, "text": "h., live service: In order to ensure the smooth use of the live broadcast function of the platform, third -party service providers may collect your equipment information, network -related information, push SDK version number, operator information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Third -party service providers may collect your equipment information, network -related information, push SDK version number, and operator information for providing live services."}
{"task": "rw_84.jsonl", "id": 65749, "text": "(4) When you choose to participate in marketing activities organized by us and our related parties or on the platform, you may need to provide you with name, gender, communication address, contact information, and bank account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you choose to participate in marketing activities organized by us and third -party, you will collect your name, gender, communication address, contact information, and bank account information."}
{"task": "rw_84.jsonl", "id": 65750, "text": "This information may involve sensitive personal information and refuse to provide it that may affect your participation in related activities, but it will not affect other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide name, gender, communication address, contact information, bank account information may affect your participation in related activities, but it will not affect other functions."}
{"task": "rw_84.jsonl", "id": 65751, "text": "Only after your consent can we share this information with related parties or third parties to ensure that you can get consistent services in the event, or entrust a third party to honor you in time.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only after your consent can we share this information with related parties or third parties."}
{"task": "rw_84.jsonl", "id": 65752, "text": "(5) It is necessary to share with our affiliated companies: we may share your personal information with our affiliates.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with our affiliates."}
{"task": "rw_84.jsonl", "id": 65753, "text": "We will only share the necessary personal information, and this sharing of the purpose of sharing the purpose of this policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information, and this sharing of the purpose of sharing the purpose of this policy."}
{"task": "rw_84.jsonl", "id": 65754, "text": "If related companies want to change the purpose of the processing of personal information, you will once again obtain your authorization and consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If related companies want to change the purpose of personal information, it will once again obtain your authorization and consent."}
{"task": "rw_84.jsonl", "id": 65755, "text": "(6) Log in and use the video version of Xiaohongshu: After you authorize the Xiaohongshu account and related information of the already held to synchronize it to the video version of Xiaohongshu, you will use the same account to use the same account at the same timeRelated services and functions of video version.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65756, "text": "(7), you can share your personal information or other information based on the small red book platform (including unspecified objects), but the information leakage, use and related situations caused by your shared behavior, with the small situation, and the small with the small situation, with the small with the small situation, and the small with the small situation, with the small with the small situation, and the small with the small situation, with the small with the small situation.The Red Book has nothing to do, and Xiaohongshu does not assume legal responsibility.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can share personal information or other information based on the Xiaohong Book Platform, but the information leakage, use and related situations caused by sharing have nothing to do with Xiaohongshu, and Xiaohongshu does not assume legal responsibility."}
{"task": "rw_84.jsonl", "id": 65757, "text": "transfer:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65758, "text": "Transfer refers to transferring control of your personal information to other companies, organizations or individuals.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65759, "text": "Unless you get your clear consent, we will not transfer your personal information to any company, organization or individual.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless we get clear consent, we will not transfer your personal information to any company, organization or individual."}
{"task": "rw_84.jsonl", "id": 65760, "text": "But except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Unless obtaining clear consent, we will not transfer your personal information to any company, organization or individual, except the following situations: except:"}
{"task": "rw_84.jsonl", "id": 65761, "text": "(1), you have obtained your consent in advance;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you have obtained your consent in advance and transfer your personal information, you don't need to solicit consent."}
{"task": "rw_84.jsonl", "id": 65762, "text": "(2), you put it on your own;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you propose to transfer your personal information yourself, you don't need to ask for consent."}
{"task": "rw_84.jsonl", "id": 65763, "text": "(3) If the company is merged, separated, dissolved, and declared bankruptcy, it may involve the transfer of personal information. In this case, we will inform you of the name or name and contact information of the receiver and ask for the new holding you.Information companies and organizations continue to be constrained by this policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The company's merger, separation, dissolution, and declaration of bankruptcy may involve personal information transfer. It will inform you of the name or name and contact information of the receiver, and require the new personal information to hold the subject to continue to be subject to this policy."}
{"task": "rw_84.jsonl", "id": 65764, "text": "If the receiver changes the purpose of personal information processing and method of processing, we will ask it to re -obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the purpose of personal information processing and method of processing, we will ask it to re -obtain your explicit consent."}
{"task": "rw_84.jsonl", "id": 65765, "text": "(4) Situation stipulated in other laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65766, "text": "Public disclosure:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65767, "text": "Public disclosure refers to the act of publishing information to society or unspecified people.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65768, "text": "In principle, we will not disclose your personal information publicly.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65769, "text": "But except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In principle, we will not disclose your personal information publicly, except for the following situations:"}
{"task": "rw_84.jsonl", "id": 65770, "text": "(1) Show the necessary desensitization information due to the announcement of the account in the account and the notice of punishment;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When the account is published and the punishment notice is published, the necessary desensitization information is required to publicize the necessary desensitization information."}
{"task": "rw_84.jsonl", "id": 65771, "text": "(2) After getting your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After obtaining your explicit consent, personal information will be disclosed."}
{"task": "rw_84.jsonl", "id": 65772, "text": "An exception of sharing, transfer, and public disclosure of personal information authorization consent", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65773, "text": "According to the relevant laws and regulations, in the following circumstances, we may share, transfer, and publicly disclose your personal information: without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, and publicly disclose your personal information if we obtain your authorization consent in advance:"}
{"task": "rw_84.jsonl", "id": 65774, "text": "(1) For contracts for establishing and fulfilling the individual as a party, or in accordance with the labor rules and regulations formulated in accordance with the law, and the collective contract signed in accordance with the law, human resource management must be implemented;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, public disclosure of conclusion, performance of contracts, or the implementation of personal information necessary for human resource management, without asking for consent."}
{"task": "rw_84.jsonl", "id": 65775, "text": "(2) In order to fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, and public disclosure are not required to solicit with the personal information of the statutory duties or the personal information necessary for the legal voluntary office."}
{"task": "rw_84.jsonl", "id": 65776, "text": "(3) In order to cope with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share, transfer, and publicly disclose personal information that should be required to respond to emergencies, or protect the health of life, health and property security, and no consent."}
{"task": "rw_84.jsonl", "id": 65777, "text": "(4) In order to implement news reports and supervision of public opinion for public interests, handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_84.jsonl", "id": 65778, "text": "(5) In accordance with the \"Personal Information Protection Law\", deal with personal information that individuals are disclosed or other legally disclosed within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In accordance with the \"Personal Information Protection Law\", disclose personal information within a reasonable scope without soliciting consent."}
{"task": "rw_84.jsonl", "id": 65779, "text": "(6), other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Shared, transferred, and disclose personal information under other circumstances stipulated in laws and regulations without asking for consent."}
{"task": "rw_84.jsonl", "id": 65780, "text": "Please understand that in accordance with the current laws and regulatory requirements, sharing and transferred personal information processed by anonymous processing, and ensure that the data receiver cannot restore and re -identify the subject of personal information, no need to notify you and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If shared and transferred personal information processing by anonymous processing, and ensure that it is impossible to restore and re -identify the subject of personal information, there is no need to notify and obtain consent."}
{"task": "rw_84.jsonl", "id": 65781, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65782, "text": "storage:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65783, "text": "Storage location: We will store personal information obtained from the People's Republic of China in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information obtained from the People's Republic of China will be stored in the people's Republic of China."}
{"task": "rw_84.jsonl", "id": 65784, "text": "In the following circumstances, we will ensure that after fulfilling the obligations stipulated in the law, provide your personal information to overseas entities:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, it will ensure that after fulfilling the obligations stipulated in the law, you will provide your personal information to overseas entities:"}
{"task": "rw_84.jsonl", "id": 65785, "text": "(1) Applicable laws are clearly stipulated;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If the applicable laws are clearly stipulated and personal information is provided abroad."}
{"task": "rw_84.jsonl", "id": 65786, "text": "(2) Get your clear authorization;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If you get your clear authorization, provide personal information to your overseas."}
{"task": "rw_84.jsonl", "id": 65787, "text": "(3) You actively actively conduct cross -border transactions such as the Internet.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If you conduct cross -border transactions through the Internet and provide personal information to overseas."}
{"task": "rw_84.jsonl", "id": 65788, "text": "In response to the above situations, we will ensure that your personal information is protected at a degree of not lower than the extent prescribed by this policy.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65789, "text": "Storage time: We promise to store your personal information within the reasonable and necessary period in accordance with the law.", "label": ["Data Retention", "Important"], "rewrite": "We promise to store your personal information within a reasonable and necessary period in accordance with the law."}
{"task": "rw_84.jsonl", "id": 65790, "text": "After exceeding the above period, we will delete your personal information or do anonymous processing of your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the above period, we will delete your personal information or do anonymous processing of your personal information."}
{"task": "rw_84.jsonl", "id": 65791, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one -one service, and delete or anonymous processing of your personal information.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "If the operation is stopped, you will stop collecting your personal information and notify you in time, and delete or processes the personal information you hold."}
{"task": "rw_84.jsonl", "id": 65792, "text": "Protect:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65793, "text": "In order to protect your personal information security, we will strive to take various security measures that meet industry standards to protect your personal information to maximize your personal information being damaged, stolen, leaked, non -authorized access, use, disclosure, and changes.risks of.", "label": ["Important", "Data Security"], "rewrite": "We will strive to take security measures to protect personal information and minimize your personal information being damaged, stolen, leaked, non -authorized access, use, disclosure, and changes."}
{"task": "rw_84.jsonl", "id": 65794, "text": "We will actively establish a data classification hierarchy, data security management specifications, and data security development specifications to manage the storage and use of personal information, and ensure that personal information that has not been related to the services provided by us is not collected.", "label": ["Important", "Data Security"], "rewrite": "The storage and use of personal information will be actively established to actively establish a data classification and hierarchical system, data security management specifications, and data security development specifications."}
{"task": "rw_84.jsonl", "id": 65795, "text": "Your account has a security protection function, please keep your account and password information properly.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65796, "text": "Xiaohongshu will ensure that your information is not lost and non -abused and altered by backup of other server, encrypting user passwords and related security measures.", "label": ["Important", "Data Security"], "rewrite": "Xiaohongshu will ensure that your information is not lost and non -abused and altered by backup of other server, encrypting user passwords and related security measures."}
{"task": "rw_84.jsonl", "id": 65797, "text": "Although there are aforementioned security measures, you should also pay attention to the \"perfect security measures\" on the information network.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65798, "text": "In order to prevent safety accidents, we have formulated a proper early warning mechanism and emergency plan in accordance with the provisions of laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "In order to prevent safety accidents, we have formulated a proper early warning mechanism and emergency plan in accordance with the provisions of laws and regulations."}
{"task": "rw_84.jsonl", "id": 65799, "text": "If a security incident is confirmed, we will choose the relevant situation in time to inform you by email, letter, telephone, push notification, and related methods. When we are difficult to inform the subject of personal information one by one, we will publish a reasonable and effective manner in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "If a security incident is confirmed, we will inform you the relevant situation in a timely manner that it is difficult to inform the individual information one by one, and we will publish a reasonable and effective way to publish an announcement."}
{"task": "rw_84.jsonl", "id": 65800, "text": "At the same time, we will also actively report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities, and closely cooperate with the work of government agencies.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities, and closely cooperate with the work of government agencies."}
{"task": "rw_84.jsonl", "id": 65801, "text": "When our products or services stop operating, we will stop the activities of continuing to collect personal information in time.", "label": ["Important", "Cessation of Operations"], "rewrite": "When our products or services stop operating, we will stop the activities of continuing to collect personal information in time."}
{"task": "rw_84.jsonl", "id": 65802, "text": "In the above changes, we will notify you in push notifications, announcements and related forms, and delete your personal information or perform anonymous processing within a reasonable period (so -called \"anonymous processing\" refers to the technical processing of personal information.The process of making the subject of personal information cannot be recognized, and the processing information cannot be restored.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "In the above changes, we will notify you in push notifications, announcements and related forms, and delete your personal information or perform anonymous processing within a reasonable period."}
{"task": "rw_84.jsonl", "id": 65803, "text": "The information obtained by personal information after anonymous processing does not belong to personal information.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65804, "text": "", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65805, "text": "4. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65806, "text": "We attach great importance to and do our best to protect your rights to your personal information.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65807, "text": "Autonomous decision to receive information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65808, "text": "In the follow -up, you will display the account information you actively choose to follow. You can choose to pay attention or cancel your attention as needed.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65809, "text": "Personal information copy access, acquisition, correction and deletion related information", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65810, "text": "Through the design of the interactive interface, we provide you with channels that can be accessed, acquired, corrected, and deleted related personal information. You can set it in the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "Provide you with a channel that can access, obtain, correct and delete relevant personal information. You can set it in the following ways:"}
{"task": "rw_84.jsonl", "id": 65811, "text": "(1), access, obtain, and correct your personal information through [Me-Edit Information], including avatars, nicknames, gender, resident place, college and admission time, birthday, personal introduction;", "label": ["Important", "Edit/Control"], "rewrite": "Visit, obtain, and correct your personal information through [Me-Edit Information], including avatar, nickname, gender, resident place, college and admission time, birthday, personal introduction."}
{"task": "rw_84.jsonl", "id": 65812, "text": "(2), set, access, obtain, and correct account information through [I-Settings-Account and Security], including mobile phone numbers (only once a month), login password, binding third-party platform account (including WeChat, Weibo and QQ account);", "label": ["Important", "Edit/Control"], "rewrite": "Through the [I-Settings-Account and Security] setting, accessing, acquiring, and corrected account information, including mobile phone numbers (can only be changed once a month), login password, third-party platform account number (including WeChat, Weibo, andQQ account)."}
{"task": "rw_84.jsonl", "id": 65813, "text": "(3), through the [I-Settings-Privacy] settings, accessing, acquisition, correction of privacy information, including comments settings,@settings, address book recommendation settings, Weibo recommendation settings, location information settings, and blacklist settings;", "label": ["Important", "Edit/Control"], "rewrite": "Through [I-Settings-Privacy], setting, accessing, acquisition, correction of privacy information, including comments settings,@settings, address book recommendation settings, Weibo recommendation settings, location information settings, and blacklist settings."}
{"task": "rw_84.jsonl", "id": 65814, "text": "(4), access, obtain, correct, and delete relevant information through [I-Notes/Favorites/Praise].", "label": ["Important", "Edit/Control"], "rewrite": "Visit, get, correct, and delete relevant information through [Me-Notes/Favorites/Praise]."}
{"task": "rw_84.jsonl", "id": 65815, "text": "In addition to the above, there are one of the following situations, we should actively delete your personal information, and you also have the right to ask us to delete:", "label": ["Important", "Edit/Control"], "rewrite": "In addition to the above, there are one of the following situations, we should actively delete your personal information, and you also have the right to ask us to delete:"}
{"task": "rw_84.jsonl", "id": 65816, "text": "(1) The purpose of the treatment has been achieved, unable to achieve or to achieve the purpose of treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65817, "text": "(2) We have stopped providing products or services, or the storage period has expired;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65818, "text": "(3) You have clearly withdrew the consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65819, "text": "(4) If you have enough reasons to think that we violate laws, administrative regulations or deal with your personal information;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65820, "text": "(5) Other circumstances stipulated in laws and administrative regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65821, "text": "Change or withdraw the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65822, "text": "You can change or withdraw the scope of authorization through [I-Settings-Notification Settings/Privacy/Universal], including: 1) Binding of WeChat accounts, Weibo accounts and QQ accounts;", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of authorization through [I-Settings-Notification Settings/Privacy/Universal], including: 1) Binding of WeChat accounts, Weibo accounts and QQ accounts."}
{"task": "rw_84.jsonl", "id": 65823, "text": "2) Interactive, private message, community content, and mall notification;", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of authorization through [I-Settings-Notification Settings/Privacy/Universal], including: interaction, private message, community content, and mall notification."}
{"task": "rw_84.jsonl", "id": 65824, "text": "3) Comment settings,@settings, address book recommendation settings, Weibo recommendation settings, location information settings, and blacklist settings;", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the authorization scope of or withdrawing or withdrawing the authorization scope of the authorization through [I-Settings-Notification Settings/Privacy/Universal], including: comment settings,@settings, address book recommendation settings, Weibo recommendation settings, location information settings, and blacklist settings."}
{"task": "rw_84.jsonl", "id": 65825, "text": "4) System default font acquisition and use settings.", "label": ["Important", "Edit/Control"], "rewrite": "You can change or withdraw the scope of authorization through [I-Settings-Notification Settings/Privacy/Universal], including the acquisition and use settings of the default font of the system."}
{"task": "rw_84.jsonl", "id": 65826, "text": "You can also change or withdraw your microphone (recording), address book, notification, network, camera (camera), calendar, suspension windows, geographical location, camera (camera), storage (album, media and other other through the operating system changeFiles), the authorization of the phone status authority, the functions of different device models may be different. We will collect personal information based on the settings of your change or withdrawal authorization. If you withdraw authorization, we will no longer collect information related to these permissions, But please note that this will cause some functions or all functions to be unavailable.", "label": ["Important", "Edit/Control"], "rewrite": "You can also change or withdraw your microphone (recording), address book, notification, network, camera (camera), calendar, suspension windows, geographical location, camera (camera), storage (album, media and other other through the operating system changeFile), authorization of phone status permissions.We will collect personal information based on your settings. If you withdraw authorization, you will no longer collect information related to these permissions, but this will cause some functions or all functions to be unavailable."}
{"task": "rw_84.jsonl", "id": 65827, "text": "At the same time, your decision to change or withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "The decision you change or withdraw authorization will not affect our personal information processing based on your previous authorization."}
{"task": "rw_84.jsonl", "id": 65828, "text": "Eligible personal information transfer right", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65829, "text": "If you need to transfer your personal information to other platforms, enterprises or organizations, you can contact us through the way disclosed by this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65830, "text": "We will review your request. Under the conditions stipulated by my country's network information department, we will provide you with a way to transfer the corresponding personal information.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65831, "text": "Automatic decision -making information system", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65832, "text": "In some business functions, we may make decisions based on the non -artificial automatic decision mechanism, including the information system and algorithm.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65833, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65834, "text": "In the case of meeting relevant laws, your close relatives can exercise the rights of your relevant personal information to check, copy, correct, delete, etc.", "label": ["Important", "Edit/Control"], "rewrite": "Your close relatives can exercise the above rights to check, copy, correct, delete the above personal information."}
{"task": "rw_84.jsonl", "id": 65835, "text": "You have other arrangements.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65836, "text": "Contact us to manage", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65837, "text": "For the consideration of security and identification, you may not be able to access it by yourself through the interactive interface of the small red book, more correct or delete certain information (information after real -name authentication, part of your use records and related information);", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You may not be able to access it by yourself, more correct or delete certain information through the little red book interaction interface (information after real -name authentication, part of your use records and related information)."}
{"task": "rw_84.jsonl", "id": 65838, "text": "If you really need to access, modify or delete this type of information according to law, please send your question to the designated contact mailbox through the contact information provided by Article 10 of this policy. We will review the involved as soon as possible as soon as possible.The question and reply to your user identity in time.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If you are indeed necessary to access, modify or delete this kind of information according to law, please send your question to the designated contact mailbox through the contact information provided by Article 10 of this policy."}
{"task": "rw_84.jsonl", "id": 65839, "text": "5. How do you log out your account", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65840, "text": "You can use [I-Settings-Help and customer service-community problem-how to cancel accounts] or [I-Settings-Account and Security-Logging up account], select [Apply for cancellation account] under the condition of meeting the account cancellation to cancel youAccount number;", "label": ["Important", "Edit/Control"], "rewrite": "You can use [I-Settings-Help and customer service-community problem-how to cancel accounts] or [I-Settings-Account and Security-Logging up account], select [Apply for cancellation account] under the condition of meeting the account cancellation to cancel youAccount."}
{"task": "rw_84.jsonl", "id": 65841, "text": "We will deal with you within seven working days after receiving your cancellation application and verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65842, "text": "After the account cancellation, in addition to the law clearly stipulated that the personal information we reserved (such as information related to the transaction in Xiaohongshu), your personal information will be removed from Xiaohongshu.", "label": ["Important", "Edit/Control"], "rewrite": "After the account cancellation, in addition to the law clearly stipulated that the personal information we reserved (such as information related to the transaction in Xiaohongshu), your personal information will be removed from Xiaohongshu."}
{"task": "rw_84.jsonl", "id": 65843, "text": "6. Special description of products and/or services related to third parties", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65844, "text": "The Xiaohongshu may include the information and/or services provided by third -party products and services or links to third parties. Before using the third -party product and/or service, you need to jump to the corresponding applet or third partypage.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65845, "text": "If you use the third -party service (including any personal information you provided to the third party), you must be subject to the third -party service terms and privacy policies (not this policy). You need to read its terms carefully and decide whether to accept it yourself.Essence", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65846, "text": "Please protect your personal information properly and provide them with others.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65847, "text": "This policy is only applicable to the collection, preservation, use, sharing, and disclosure information we collected, and it is not applicable to the service provided by any third party or the information usage rules of the third party. The behavior of third parties uses your information to be responsible for itself.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65848, "text": "7. How do we use cookies and other similar technologies", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65849, "text": "1. Use of cookies", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65850, "text": "(1) In the case of receiving cookies, Xiaohongshu will set or use cookies on your computer and related mobile devices so that you can log in or use the small red book platform service or function that depends on Cookies.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the case of receiving cookies, Xiaohongshu will set or use cookies to log in or use related services or functions."}
{"task": "rw_84.jsonl", "id": 65851, "text": "Xiaohongshu uses cookies to provide you with more thoughtful personalized services, including promotion services.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65852, "text": "(2), you have the right to choose to accept or refuse to accept Cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to choose to accept or refuse to accept cookies."}
{"task": "rw_84.jsonl", "id": 65853, "text": "You can refuse to accept Cookies by modifying the browser settings or setting in a mobile device.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse to accept Cookies by modifying the browser settings or setting in a mobile device."}
{"task": "rw_84.jsonl", "id": 65854, "text": "But if you choose to refuse to accept Cookies, you may not be able to log in or use the small red book platform service or function that depends on Cookies.", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to accept Cookies, you may not be able to log in or use the small red book service or function that depends on Cookies."}
{"task": "rw_84.jsonl", "id": 65855, "text": "(3) The relevant information obtained through the cookies set by Xiaohongshu will apply this policy.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65856, "text": "8. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65857, "text": "Please read the following clauses below (especially children who are under the age of 14) to read carefully with the guardian, and the guardian will make a decision whether to accept or reject the policy after fully understanding: after fully understanding:", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65858, "text": "If a user is a minor under the age of 18 (especially children who are under the age of fourteen years old), they should read this agreement and use the Xiaohongshu related services under the consent of the guardian's guardianship, guidance, and obtaining the consent of the guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "If a user is a minor under the age of 18, he should read this agreement and use the Xiaohongshu related services under the consent of the guardian's monitoring, guidance and obtaining the consent of the guardian."}
{"task": "rw_84.jsonl", "id": 65859, "text": "We attach importance to the protection of personal information of minors. When filling in personal information, minor users should strengthen personal protection awareness and treat them with caution. Please use Xiaohongshu related services correctly during the guidance of the guardian.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65860, "text": "We will protect the confidentiality and security of the user's user information in accordance with relevant national laws and regulations and the provisions of this policy.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65861, "text": "If we find that we collect personal information of minors without getting the consent of the parents or the legal guardian who can be confirmed in advance, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we find the personal information of minors without obtaining the consent of our parents or legal guardians in advance, we will try to delete relevant data as soon as possible."}
{"task": "rw_84.jsonl", "id": 65862, "text": "At the same time, we have established rules for collection and use of minor information to protect personal information security for children and adolescents. You can learn more about more specific content by reading the \"Little Red Book Children/Youth Personal Information Protection Rules\".", "label": ["Specific Audiences", "Important"], "rewrite": "We have established rules for collection and use of minor information to protect personal information security for children and adolescents."}
{"task": "rw_84.jsonl", "id": 65863, "text": "If you are the guardian of the minor, when you use our service or the user information you provide to us when you are monitored, please pleaseWe contact.", "label": ["Specific Audiences", "Important"], "rewrite": "When the guardian of the minor has any questions about using services or the user information provided by minors, please contact us in a timely manner based on the contact information provided by Article 10 of this policy."}
{"task": "rw_84.jsonl", "id": 65864, "text": "Nine, how do we update privacy policies", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65865, "text": "In order to provide you with better services, we will update the terms of this policy according to the update of the product and the relevant requirements of laws and regulations. These updates will constitute a part of the cost.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65866, "text": "Without your clear consent, we will not reduce the rights you should enjoy based on the current policy.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65867, "text": "In the event of this policy update, we will notify you through the APP client or other reasonable ways, so that you can understand the latest version of this policy in time.", "label": ["Policy Change", "Important"], "rewrite": "In case of this policy update, you will notify you through the APP client or other reasonable methods, so that you can understand the latest version of this policy in time."}
{"task": "rw_84.jsonl", "id": 65868, "text": "Ten, how to contact us", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65869, "text": "If you have any complaints, suggestions, questions, questions, or if you have any questions about this policy, you can contact us through the following ways. We will review the issues involved as soon as possible and verify your user identity.A reply within a working day: shuduizhang@xiaohongshu.com.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following ways: shuduizhang@xiaohongshu.com."}
{"task": "rw_84.jsonl", "id": 65870, "text": "Eleven, others", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65871, "text": "Any controversy caused by this policy and our personal information, you can sue to the Huangpu District People's Court, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65872, "text": "If you think our personal information processing behavior harms your legitimate rights and interests, you can also report it to relevant government departments.", "label": [], "rewrite": []}
{"task": "rw_84.jsonl", "id": 65873, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
