{"task": "rw_87.jsonl", "id": 66622, "text": "Film and Television Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66623, "text": "Updated in this version: September 02, 2022", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66624, "text": "Effective time of this version: September 02, 2022", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66625, "text": "respected user:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66626, "text": "I sincerely thank you for choosing film and television products!", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66627, "text": "This product adds the following functions: \"One -click login of this machine number\" function. This function is provided by the friendly League SDK integrated by this product. The You alliance SDK may collect your personal information (IMEI/Mac/AndroidID/IDFA/Openudid/Guid/SIM, Card, IMSI,/geographical location), process information during operation), please carefully read the privacy policy of the Friendship League before using this function, details link: https: // www.umeng.com/policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "Youmeng SDK may collect your personal information (IMEI/MAC/Android ID/Idfa/Openudid/Guid/SIM card IMSI/geographical location), and process information during operation."}
{"task": "rw_87.jsonl", "id": 66628, "text": "In order to better show you and explain our privacy rules and your rights, and to provide you with more comprehensive personal information protection measures, we have formulated the \"Film and Television Privacy Policy\" (hereinafter referred to as this policy).You elaborate your control of personal information, display enhanced notification methods (core) privacy clauses and give you the right to choose whether to authorize consent.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66629, "text": "Please read this policy before using/continue to use the film and television product and service before the service and service.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66630, "text": "This product has added the following functions:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66631, "text": "The \"click Novel SDK\" function, this function is provided by the click -through novel SDK integrated by this product. Clicking SDK may collect your personal information, including [IMEI, MAC, mobile phone and storage permissions]. Please use this featureRead the service agreement and privacy policy of the novel SDK carefully.", "label": ["Important", "First Party Collection Information"], "rewrite": "Clicking SDK may collect your personal information, including [IMEI, MAC, mobile phone and storage permissions]."}
{"task": "rw_87.jsonl", "id": 66632, "text": "The \"one -click login of this machine number\" function provides authentication services by the friendly League SDK integrated by this product. Friends SDK may collect your personal information, read carefully and fully understand the full text before equipment/or service.Use/continue to use after content.", "label": ["Important", "First Party Collection Information"], "rewrite": "Youmeng SDK may collect your personal information, read the full text carefully before using equipment/or service, and use it after agreeing with all the content."}
{"task": "rw_87.jsonl", "id": 66633, "text": "Before you accept this \"Privacy Policies\", we will prompt a prominent position on the homepage of the film and television product and/or service or send a message to you or notify you in other ways to let you continue to use the film and television Daquan You can check this privacy policy in time before products and/or services.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66634, "text": "preface", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66635, "text": "We attach great importance to and protect your privacy and personal information, and we will also perform our obligations in this policy carefully.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66636, "text": "This Policy is closely related to the products and/or services of Movies and TV you use. ”), we will process and protect your personal information in accordance with the provisions of this policy, therefore, please read carefully and fully understand the full text of this policy, and follow the guidelines of this policy to make the choices you think are appropriate.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66637, "text": "The relevant technical vocabulary involved in this policy, we try to explain to you with concise expressions in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66638, "text": "We have reminded you here that there is a major relationship with your rights and interests (possibilities) in this policy. We have used bold fonts to remind you. Please pay attention to the focus.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66639, "text": "And the two sides agreed that they did not belong to Article 497 of the Civil Code. The provision of the provision of the format clause unreasonable exemption or reducing its responsibilities, aggravating each other's responsibilities, restricting the other's main rights, and eliminating the main rights of the other party \", that is, you and meFang Jun recognizes the legality and effectiveness of this type of clause, and you will not claim that the clauses in the agreement are illegal or invalid on the grounds that our failed obligations are not fulfilled.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66640, "text": "You should use our products and/or services after careful understanding and fully understanding this \"Privacy Policy\". If you do not agree with the content of this policy, it may cause the film and television products and/or servicesThe service effect we intend to achieve, you should immediately stop visiting/use our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66641, "text": "You use or continue to use the behavior and/or service behavior provided by us, saying that you fully understand and agree with all the contents of this policy (including the updated version).", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66642, "text": "The terms under this agreement can be revised/changed at any time, and you should check regularly.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66643, "text": "Once the agreement clause is revised/changed, we will update on this page and will notify you separately.", "label": ["Policy Change", "Important"], "rewrite": "Once the agreement clause is revised/changed, we will update on this page and will notify you separately."}
{"task": "rw_87.jsonl", "id": 66644, "text": "Once the revised/changed protocol is released, the original agreement is released.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66645, "text": "You have the right not to accept the amendment/change protocol, but it may cause you to stop using the product and/or service, or it cannot achieve the service effect that we plan to achieve.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66646, "text": "You can check the latest film and television privacy policy on this page at any time.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66647, "text": "If you have any violation of this agreement, we have the right to restrict, suspend or terminate you at any time in accordance with the violation of the situation, and have the right to investigate your relevant responsibilities.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66648, "text": "If you are a minor under the age of 18, read this agreement and other above agreements with the guardian of the guardian, and get the consent of your parents or legal guardians in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18, please read this agreement and other agreements accompanied by the guardian, and obtain the consent of the legal guardian in advance."}
{"task": "rw_87.jsonl", "id": 66649, "text": "If you are the guardian of minors, when you have questions about the personal information of the minors you monitor, please contact us by email: yonghuyinsibaohu@jinshangtechnology.com.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "When the guardian of the minor has questions about the personal information of the minor, please contact us by e -mail: yonghuyinsibaohu@jinshangtechnology.com."}
{"task": "rw_87.jsonl", "id": 66650, "text": "If you are reading any doubts or other related matters, you can ask us through the email: yonghuyinsibaohu@jinshangtechnology.com, we will answer your answers in a timely manner.", "label": ["Important", "Contact Information"], "rewrite": "Email: yonghuyinsibaohu@jinshangtechnology.com asked us."}
{"task": "rw_87.jsonl", "id": 66651, "text": "This \"Privacy Policy\": It will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66652, "text": "1. Definition scope and related words", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66653, "text": "2. The way we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66654, "text": "3. We use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66655, "text": "4. The way we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66656, "text": "5. You have the right to control your personal information", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66657, "text": "6. The way we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66658, "text": "7. Minor protection", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66659, "text": "8. Update of this privacy policy", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66660, "text": "9. Contact us", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66661, "text": "10. This privacy policy interpretation and dispute resolution", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66662, "text": "Specific clauses of this privacy policy:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66663, "text": "1. Definition of applicable scope and related words", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66664, "text": "(1) Scope of application", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66665, "text": "This privacy policy is suitable for registered login and browsing users of film and television products and/or services.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66666, "text": "But please note that this policy is not applicable to the following situations:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66667, "text": "(1) Information collected by a third -party service (including any third -party website) directly provided by the third party through the film and television product and/or service;", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66668, "text": "(2) Information collected by other companies and institutions that advertise services that provide advertising services in film and television products and/or services;", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66669, "text": "(3) Film and Television Daquan products and/or services may include or linked information and/or third -party services provided by third parties (including any third -party website).The information has nothing to do with/or services.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66670, "text": "We remind you kindly that when you use third -party information and/or services, you should pay attention to and read the relevant user agreements and privacy policies you displayed in the third direction, and provide your personal information properly and carefully.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66671, "text": "This privacy policy is only applicable to your personal information collected by us, and it is not applicable to the collection of your personal information of any third party, as well as any third -party service or third -party information use rules.The behavior of third -party collection, storage, and use of your personal information does not bear any responsibility;", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66672, "text": "(4) Other non -film and television Daquan you are always provided by the products and/or service content.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66673, "text": "(2) Related word meaning", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66674, "text": "(1) Film and Television Daquan Products and/or Services: Film and Television Daquan (hereinafter referred to as \"Film and Television\") is a content aggregate software that provides a platform for users and media to show their high -quality content.Android, iPad, etc.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66675, "text": "(2) Users: It refers to the download and installation and startup, and use this product to call it more \"you\" in this agreement.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66676, "text": "(3) Personal information: Refers to the various information that can be recorded alone or with other information to identify specific natural persons or reflects the activity of specific natural persons alone or with other information.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66677, "text": "Facial features), network identity identification information (including account names, account nicknames, IP addresses, and the answers to the aforementioned password, password, password protection), personal property information (including virtual property information such as transactions, consumption records, coupons, and other virtual property),Bank account account, address book information, personal Internet records (including website browsing records, software usage records, click records), personal common equipment information (including hardware models, size, equipment MAC address, operating system type, software list, unique device recognition code(Such as IMEI/Android ID, SIM card IMSI information, process information during operation, etc. describing information about the basic situation of personal equipment in the individual), personal location information (including accurate positioning information).", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66678, "text": "(4) Personal sensitive information: Refers to personal information that once leaked, illegally provided or abuses the security of people's body and property, and it is easy to lead to personal information such as personal reputation, physical and mental health, or discriminatory treatment.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66679, "text": "Personal sensitive information involved in this agreement includes your property information (including virtual property information such as transactions, consumption records, coupons and other virtual property), bank account number, personal biometric information (including fingerprints, facial features), personal identity identification information (including identity identityPersonal information, network identification information (including system accounts, mailbox addresses, and the answers to the aforementioned related codes, password protection answers), other information (including address book information, other information, other information, other information, and other information (including address book information, and other information, other information,Personal phone number, mobile phone number, accurate positioning information, delivery address, web browsing record).", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66680, "text": "You agree that your personal sensitive information is processed according to the purpose and method described in this agreement.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66681, "text": "Compared with other personal information, personal sensitive information may have a greater impact on your personal rights.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66682, "text": "We are here to remind you that you need to provide us with your personal sensitive information after careful consideration.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66683, "text": "(5) Removal/anonymous processing: Refers to the technical processing of personal information, so that the subject of the personal information cannot be recognized, and the information after processing cannot be restored.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66684, "text": "(6) Delete: Refers to removing personal information in a system involved in daily business functions, so that it keeps them from being retrieved and accessible.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66685, "text": "(7) Children: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66686, "text": "2. The way we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66687, "text": "When you use film and television products and/or services, we need/may need to collect and use some of your personal information. The types of personal information that we collect and use include two types: two types: two types:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66688, "text": "The first: the core function of film and television Daquan products and/or services: This type of information is an essential information for the normal operation of products and/or services. You must authorize us to collect it;", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66689, "text": "If you refuse to provide it, you will not be able to use our products and/or services normally;", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66690, "text": "The second: additional function may need to be collected: This information is the information required for non -core functions. You can choose whether to authorize us to collect it.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66691, "text": "If you refuse to provide it, it will cause the additional function to be unable to achieve or to achieve the effect that we intend to achieve, but it will not affect your normal use of core functions.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66692, "text": "Special reminding you: Our pursuit of continuous improvement of products and services, so we will continue to improve film and television products and services, including technology, which means that we may often launch new business functions, and may need to collect new individuals.Information or change of personal information usage purpose or method.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66693, "text": "If a function or product/service that needs to collect your personal information cannot be explained in this privacy policy, we will explain to you by updating this policy, page prompts, pop -ups, interactive processes and other methods to explain the information.The purpose, content, method and scope of the collection, and provide you with the method of self -selection consent, and collect it after obtaining your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will explain to you separately the purpose, content, usage and scope of the collection of the information, and provide the way of self -selection consent, and collect it after obtaining your consent."}
{"task": "rw_87.jsonl", "id": 66694, "text": "In the process, if you have any doubts or related matters, you can tell us through email or user feedback, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66695, "text": "Specific business function scenarios include:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66696, "text": "(1) Video display and playback function (core function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66697, "text": "This product provides you with video display and playback services. In this process, we need to obtain the permissions of the read -write mobile phone storage to ensure the cache and playback of the foundation, and collect some of your information, such as the equipment model, equipment name, equipment, equipmentThe unique identifier (IMEI), browser type and settings, language settings, operating systems and application versions, login IP address, MAC address, Android, ID, network quality and data, mobile network information, mobile network information (including operations (including operationBusiness name), product version number, log information (such as operation logs, service logs), process information during operation, etc.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The operating system and application version, login IP address, MAC address, Android ID, access to the network, network quality data, mobile network information (including operator name), product version number, log information (such as operation logs, service logs, service logs), Process information during operation, etc."}
{"task": "rw_87.jsonl", "id": 66698, "text": "We collected this information to provide you with our core video display and playback services to identify users and ensure product operation safety.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66699, "text": "If you refuse to provide you who may not use our products and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide relevant information, it may cause you to be unable to use our products and services."}
{"task": "rw_87.jsonl", "id": 66700, "text": "(2) Video and advertising recommendation functions (core functions)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66701, "text": "When you use video and advertising recommendations, we need to collect some of your products and/or services in the film and television collection, such as: the videos you watch, the words you searched (including voice information), browsing content and content and content and browsThe number of advertisements and the number of interaction with them, the objects of your like/sharing/review/interaction, etc., we collect this information to recommend videos and advertising content that you may be more interested in real -time, such as::::::::::It is recommended that you like TV series, movies, variety shows, advertising, etc. that you may like.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using video and advertising recommendation functions, you need to collect the following information, such as: the videos you watch, the words you searched (including voice information), the number of browsing content and advertisements, and the number of interaction with them, your like/sharing/sharing/sharing/Comment/interaction objects, etc."}
{"task": "rw_87.jsonl", "id": 66702, "text": "(3) E -book display and reading function (core function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66703, "text": "This product provides you with electronic book display and reading services. In this process, we need to obtain the permissions of read -write mobile phone storage to ensure the cache and read of the foundation, and collect some of your information, such as: device models, equipment names, Equipment unique identifier (IMEI), browser type and settings, language settings, operating systems and application versions, login IP address, method of accessing networks, network quality data, mobile network information (including operator name), product products, productsVersion number, log information (such as operation logs, service logs), etc.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When providing electronic book display and reading services, we need to obtain the permissions of the read -write mobile phone storage and collect some of your information, such as: device model, equipment name, equipment unique identifier (IMEI), browser type and settings, language, languageSettings, operating systems and application versions, login IP addresses, methods of accessing networks, network quality data, mobile network information (including operator name), product version number, log information (such as operation logs, service logs), etc."}
{"task": "rw_87.jsonl", "id": 66704, "text": "We collected this information to provide you with the core electronic book display and reading services to us. If you refuse to provide the functions and/or services that may not be able to use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our collection of relevant information is to provide our core electronic book display and reading services. If you refuse to provide functions and/or services that may not be able to use this product."}
{"task": "rw_87.jsonl", "id": 66705, "text": "(4) E -book and advertising recommendation function (core function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66706, "text": "When you use e -books and advertising recommendations, we need to collect some information in your process of using this product, such as: your reading history, bookshelf, your search history (including words, words and voice information), browsingThe number of contents and advertisements and the number of interaction with them, the objects you like/share/comment/interactive, etc., we collect this information to recommend more high -quality e -books and advertisement content that you may be more interested in in real timeEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "You like/share/comment/interaction objects, etc."}
{"task": "rw_87.jsonl", "id": 66707, "text": "(5) Search function (core function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66708, "text": "When you use the search function, we need to collect some of your information, such as: search words (including voice information), browsing records, and the number of interaction with them.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the search function, we need to collect some of your information, such as: search words (including voice information), browsing records, and the number of interaction with them."}
{"task": "rw_87.jsonl", "id": 66709, "text": "We collect this information to provide you with the content you need and the services that may be more interested in, and at the same time, you can also improve the products and services of film and television.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66710, "text": "(6) Registration and login function (core function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66711, "text": "When you use the registration function, you need to complete a series of registration procedures according to our guidelines.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66712, "text": "In the process, you need to provide us with information that identifies your user identity alone or combined with your user identity, such as: mobile phone number, verification code matching results, nicknames, avatars, etc., and create account UID and passwords.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide some information that is individually or combined with identification of user identity, such as: mobile phone number, verification code matching results, nicknames, avatars, etc., and create account UID and passwords."}
{"task": "rw_87.jsonl", "id": 66713, "text": "Our collection of this information is used to complete the registration procedure, provide registered services for you continuously and stable, and protect your registration account.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66714, "text": "You should know that the matching result of the mobile phone number and the verification code belongs to your personal sensitive information. We collected this type of information to meet the requirements of relevant laws and regulations.Careful considerations are carefully provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "The result of the matching of the mobile phone number and the verification code of our side is to meet the requirements of relevant laws and regulations. If it refuses to provide it, it may cause you to be unable to use this function."}
{"task": "rw_87.jsonl", "id": 66715, "text": "At the same time, you can also fill in or supplement your gender, birthday, personality signature and other information during the registration or subsequent process. If you fail to fill in or change or change this kind of information, it may affect (including inability to obtain)We provide you with more personalized services, but it will not affect the normal use of the registration function.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66716, "text": "When you log in with a third -party account, you will authorize us to obtain the public information (avatar, nickname, and other information you authorize) registered on the third -party platform, so that you can log in and use this product and/or service.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66717, "text": "When you use \"one -click login of this machine number\", this function provides authentication services by the friendly League SDK integrated by this product. Friend League SDK needs to collect the international mobile device identification code (IMEI) and iOS advertising symbols (IDFA) of your equipment, Mobile phone number and other necessary fields.", "label": ["Important", "First Party Collection Information"], "rewrite": "Youmeng SDK needs to collect necessary fields such as international mobile device recognition codes (IMEI), iOS advertising logo (IDFA), and mobile phone numbers."}
{"task": "rw_87.jsonl", "id": 66718, "text": "For your information security, we have agreed to strict data security and confidentiality obligations with the Friends SDK service provider, and the Friend League SDK Service Chamber of Commerce strictly abides by our data privacy and security requirements.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We have agreed to strict data security and confidentiality obligations with the You alliance SDK service provider, and the Friend League SDK Service Chamber of Commerce strictly abides by our data privacy and security requirements."}
{"task": "rw_87.jsonl", "id": 66719, "text": "Unless you get your consent, we will not share your other personal information with them.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Unless you get your consent, we will not share your other personal information with them."}
{"task": "rw_87.jsonl", "id": 66720, "text": "Regarding the privacy policy of Youmeng, please visit the You alliance website: https://www.umeng.com/policy.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66721, "text": "(7) User feedback function (core function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66722, "text": "When you feedback to us, for your account number and system security, we need you to provide relevant personal information to match your personal information provided before to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "For your account and system security, we need to provide you with relevant personal information to match your personal information to verify your user identity."}
{"task": "rw_87.jsonl", "id": 66723, "text": "After the verification is successful, we may need to collect your communication information with us (such as: account information, pictures/videos/e -book/text information, etc.), your contact information, and in order to keepEvidence's communication records with us, including online communication records, QQ group chat records, emails, telephone recording, etc. to solve the problems and improve our products and/or services for you as soon as possible.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may need to collect your communication information, your contact information, and your communication records with us."}
{"task": "rw_87.jsonl", "id": 66724, "text": "(8) Safe account security function (core function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66725, "text": "We need to collect some of your information to ensure your account number and system security when using the product and/or service of the film and television, and assist in improving the security and reliability of the product and/service of the film and television., Film and Television Daquan products, social behavior, such as: your account login land, commonly used equipment information, login IP address, product version number, language mode, browsing records, transaction information, network usage habits, service failure information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the following information guarantee accounts and system security: your account login land, commonly used equipment information, login IP address, product version number, language mode, browsing records, transaction information, network usage habits, service failure information."}
{"task": "rw_87.jsonl", "id": 66726, "text": "We will comprehensively judge your account, account and transaction risk, authentication, customer service, testing and prevention of security incidents, fraud monitoring, archiving and backup purposes based on the above information, and adopt necessary records, audits, analysis, disposal, disposal, and disposal in accordance with the law.Measures, once we detect or suspected account security risks, we will use relevant information for security verification and risk exclusion to ensure the security of the products and services you provideEvil.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will comprehensively judge your account, account and transaction risks, authentication, customer service, testing and prevention of security events, fraud monitoring, archiving and backup purposes, and take necessary records, audit, analysis, and disposal measures in accordance with the law."}
{"task": "rw_87.jsonl", "id": 66727, "text": "At the same time, when account or system security issues occur, we will collect this information to optimize the products and services of film and television.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66728, "text": "(9) Local video recommendation function (additional function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66729, "text": "Android version: When you use local video recommendation functions, we need to obtain your general location information to provide you with localized video programs. If you refuse to provideYou use other functions of products and/or services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using local video recommendation functions, we need to obtain your general location information. If you refuse to provide it, you will not be able to obtain this service, but it does not affect other functions of your normal use of products and/or services."}
{"task": "rw_87.jsonl", "id": 66730, "text": "iOS version: When you use the \"same city\" function, we need to obtain your approximate location information to provide you with localized video programs. If you refuse to provide it, you will not be able to get this service, but it will not affectYou use other functions of products and/or services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"same city\" function, we need to obtain your approximate location information to provide you with localized video programs."}
{"task": "rw_87.jsonl", "id": 66731, "text": "(10) Take photos and other functions (additional functions)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66732, "text": "When you use shooting (storage) photos, videos and other functions, we need to obtain your album (photo) access right.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you use shooting (storage) photos, videos and other functions, we need to obtain your album (photo) access right."}
{"task": "rw_87.jsonl", "id": 66733, "text": "If you refuse to provide it, it will make you unable to use this function, such as unable to customize your personal avatar, but does not affect other functions of your normal use of products and/or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide album access rights, it will make you unable to use this function."}
{"task": "rw_87.jsonl", "id": 66734, "text": "At the same time, you can also open/cancel the permissions through the relevant function settings at any time. The path is: System-Settings-Authorized Management-Application permissions Management-Film and Television-Camera, check the dismissal of the corresponding camera.", "label": ["Important", "Edit/Control"], "rewrite": "You can also open/cancel the permissions through the relevant function settings at any time. The path is: system-setting-authorization management-application permission management-film and television collection-camera, check the cancellation of the corresponding function of the author."}
{"task": "rw_87.jsonl", "id": 66735, "text": "If you turn on this permissions, you deepen that you can authorize us to access, obtain, collect, and use your personal information;", "label": ["Edit/Control", "Important"], "rewrite": "If you turn on the album access permissions, you deepen that you authorize us to access, obtain, collect, and use your personal information."}
{"task": "rw_87.jsonl", "id": 66736, "text": "When you cancel the authorization, we will no longer collect the information, and we will no longer provide you with the above -mentioned services;", "label": ["Edit/Control", "Important"], "rewrite": "When you cancel the authorization of the authorized album, we will no longer collect the information, and we can no longer provide you with the above -mentioned services."}
{"task": "rw_87.jsonl", "id": 66737, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of personal information based on your previous authorization.", "label": ["Data Retention", "Important", "Edit/Control"], "rewrite": "Unless you delete personal information in accordance with the law, cancellation will not affect the processing and storage of our personal information based on previous authorization."}
{"task": "rw_87.jsonl", "id": 66738, "text": "(10) Your personal information (additional features) of indirectly collected from the external third party (additional function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66739, "text": "You know, the personal information you provided to the external third party, or your personal information collected by the external third party, we cannot obtain it, let alone use unconventional methods (suchGet your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The personal information you provided to the external third party, or your personal information collected by the external third party, we cannot obtain it, and will not use unconventional methods (such as malicious intervention in the other series APP data) to obtain your software program to obtain your software program to obtain youpersonal information."}
{"task": "rw_87.jsonl", "id": 66740, "text": "If your personal information needs to be collected indirectly (such as sharing, etc.) due to the need for business development, and we will directly or unite us to provide you with products or services, our (or third parties) will be before the collectionThe source, type, purpose, method, and business functions of your personal information that shared your personal information, the scope of business functions, the scope of authorization consent (if the use method and scope exceeds the scope of the original authorized scope of the third party, we will recruit you again.Authorized consent), this scene includes when you directly log in to the product and/or service of the video and television Daquan through a third -party account, our account information (including avatars and nicknames) obtained from the third party;", "label": ["Important", "First Party Collection Information"], "rewrite": "Our (or third party) will explicitly indicate the source, type, use purpose, method, and business functions, and scope of authorization for the shared personal information before collecting (if the method and scope of use exceeds the scope of the original authorization of the third party, the scope of the third party, andWe will get your authorization consent again)."}
{"task": "rw_87.jsonl", "id": 66741, "text": "When the product/service of the film and television Daquan is provided by business partners or provided by us and business partners, in order to smoothly develop the necessary/reasonable business, some of your information and other parties collected by some business partners indirectly collected from some other parties, other parties, other parties, other parties, other parties, other parties, other parties, and other parties.Our information provided by our products to/or services, such as avatars, virtual IDs, nicknames.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "For the smooth development of necessary/reasonable business, we indirectly collect some information from some business partners and other information provided by our products, such as avatars, virtual IDs, and nicknames."}
{"task": "rw_87.jsonl", "id": 66742, "text": "In addition, before indirectly collecting your personal information, we clearly request the third party to collect personal information in writing in writing (such as agreement, commitment letter), and inform you that the information content that is shared will be told youIf you involve sensitive information, you need to re -confirm it before providing us. At the level of the agreement, the third party promises the legality and compliance of the source of personal information.Clarify the other party to bear the corresponding legal liability;", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Before the indirect collection of, we clearly requested that the third party had obtained the consent and informs you the information content of the shared information. If the sensitive information involves providing us, it must be confirmed again by your use."}
{"task": "rw_87.jsonl", "id": 66743, "text": "At the same time, our professional security team conducts security reinforcement of personal information (including sensitive information reporting, sensitive information encryption storage, access permissions control, etc.).", "label": ["Important", "Data Security"], "rewrite": "Our professional security team conducts security reinforcement of personal information (including sensitive information reporting, sensitive information encryption storage, access permissions control, etc.)."}
{"task": "rw_87.jsonl", "id": 66744, "text": "We will not use our personal information to protect the personal information obtained indirectly than our personal information and measures.", "label": ["Important", "Data Security"], "rewrite": "We will not use the personal information obtained by indirectly obtained personal information obtained from our own personal information."}
{"task": "rw_87.jsonl", "id": 66745, "text": "(11) Personalized recommendation function/directional push (additional function)", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66746, "text": "In order to provide you with better and more suitable products and/or services, so that you have better products and/or service experiences, or other uses you agree with. Under the premise of compliance with relevant laws and regulations, we mayThe personal information collected by your or our products with or/or the service that you authorize to us or/or the service is used alone or combined with other information to be used alone in order to facilitate you to youProvide personalized recommendation services/directional push, including my direction you provide relevant personalized information, and share information with our partners with our partners when you obtain your consent so that they will send you information about their products and services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may use personal information provided or collected by me to use it alone or combined with other information in a collection, analysis or personalized manner in order to provide personalized recommendation services/directional push."}
{"task": "rw_87.jsonl", "id": 66747, "text": "We may collect information on your search records when using film and television products and/or services, watch history, collect records, watch the length of viewing, your bias network behavior, interest preference and other information to form a user portrait to help us know you better.How to access and use film and television products and/or services, maintenance and improvement of film and television products and/or services, or respond to you in other aspects.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect information on your search and records when using film and television products and/or services, watch history, collect records, watch the length of view, your preference network behavior, interest preference and other information to form user portraits."}
{"task": "rw_87.jsonl", "id": 66748, "text": "If you refuse to provide it, it will cause the additional function to be unable to achieve or to achieve the effect that we intend to achieve, but it will not affect your normal use of the core function of this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide relevant information, it will cause the additional function to be unable to achieve or to achieve the effect that we want to achieve, but it does not affect your normal use of the core function of this product."}
{"task": "rw_87.jsonl", "id": 66749, "text": "We provide you with the exit mechanism of related personalized push: If you want us to stop personalized push, you can set the page through the relevant function settings.Personalized recommendation.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "If you want us to stop personalized push, you can set the page through the relevant function. The path is: at my-settings-personalized recommendation office, you can open/close personalized recommendation."}
{"task": "rw_87.jsonl", "id": 66750, "text": "After closing, Daquan will no longer recommend content based on your hobbies.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66751, "text": "At the same time, we may collect some other reasonable purposes when you use the film and television product and/or services, for example: the relevant information we got when the questionnaire response, the interaction between your partners and our partners, etc.It is used for research and development and improvement, comprehensive statistics, data analysis or processing, etc., allowing you to participate in investigations on film and television products/services, other uses or other reasonable uses you agree with or authorized.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may collect information when you use film and television products and/or services for other reasonable uses."}
{"task": "rw_87.jsonl", "id": 66752, "text": "(Twelve) Others", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66753, "text": "As described above, if a function or product/service that needs to collect your personal information is not explained in this privacy policy, or the purpose that we claim when we are over and collecting your personal information are directly or reasonableBefore using personal information after the association, we will explain to you by updating this privacy policy, page prompts, pop -ups, message notifications, or other ways to facilitate you to know, and provide you with the way you choose to consent, and in the way, and in the way, and in the way, it is in the way, and it is in the way, and it is in the way.Requires your consent and collect and use it.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If a function is not explained in this privacy policy, or if we use personal information after we exceed the reasonable range, we will explain to you separately and provide you with the way of self -choice.Collect and use after consent."}
{"task": "rw_87.jsonl", "id": 66754, "text": "Exception:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66755, "text": "In addition, you fully understand and agree. Under the following circumstances, we collect and use your personal information without your authorization consent, and we may not respond to the requests that you have proposed corrections/modifications, delete, withdraw consent, and obtain information.The", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Under the following circumstances, we collect and use your personal information without your authorization consent, and we may not respond to the request to correct the correction/modification, delete, withdraw, withdraw, and ask for information:"}
{"task": "rw_87.jsonl", "id": 66756, "text": "(1) Related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and using personal information related to national security and national defense security does not need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66757, "text": "(2) Related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Personal information related to the use of public safety, public health, and major public interests does not need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66758, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Direct related personal information such as collecting and useing directly related to crime investigation, prosecution, trial, and judgment execution does not need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66759, "text": "Or in accordance with the requirements of laws and regulations, administrative organs or public prosecution laws, etc.;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In accordance with the requirements of laws and regulations, administrative organs or public prosecution laws, etc., they do not need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66760, "text": "(4) Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to get your consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting, using major legitimate rights and interests, but it is difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_87.jsonl", "id": 66761, "text": "(5) The collected information is collected by your own or from legal public channels (such as legal news reports, government information disclosure and other channels);", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected information is collected by your own or from legal and disclosed channels, without asking for consent."}
{"task": "rw_87.jsonl", "id": 66762, "text": "(6) The necessary for signing and fulfilling related agreements or other written documents with you;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is not necessary to solicit consent when collecting, using signing and fulfilling personal information necessary for related agreements or other written documents."}
{"task": "rw_87.jsonl", "id": 66763, "text": "(7) We have sufficient evidence that you have subjective malicious or abuse of rights (for example, your request will endanger public safety and the legitimate rights and interests of others, or your request exceeds the scope of general technical means and commercial costs);", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "We have sufficient evidence that you have subjective malice or abuse of rights, and you do not need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66764, "text": "(8) The collected personal information has been anonymous/de -identified;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If the collected personal information has been anonymized/de -identified, no consent is required."}
{"task": "rw_87.jsonl", "id": 66765, "text": "；", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66766, "text": "(9) The necessary and stable operations for maintaining our products and/or services, such as: discover, dispose of products and/or services failure;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the safe and stable operation of maintaining products/or services, there is no need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66767, "text": "(10) The use of academic research, such as statistical or academic research for scientific research institutions;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information for academic research, there is no need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66768, "text": "(11) Based on social public interests, etc.;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information based on public interests, you do not need to solicit consent."}
{"task": "rw_87.jsonl", "id": 66769, "text": "(12) Situations stipulated in other laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and using personal information under other laws and regulations and other provisions do not need to solicit with consent."}
{"task": "rw_87.jsonl", "id": 66770, "text": "Third, we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66771, "text": "(1) About Cookie and similar technologies", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66772, "text": "Cookie contains small files containing string. When you log in and use the film and television product/service content, it is sent and stored in your mobile device or other devices (usually encrypted).", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66773, "text": "Similar cookies are other technologies that can be used as similar to cookies, such as: Web Beacon, Proxy, embedded script, etc.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66774, "text": "At present, we mainly use Cookie to collect your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We mainly use cookies to collect your personal information."}
{"task": "rw_87.jsonl", "id": 66775, "text": "You know and agree that with the development of technology and the further improvement of film and television products and services, we may also use similar Cookie technology.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66776, "text": "(2) How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66777, "text": "When you use film and television products and/or services, we may use cookies and similar technologies to collect some of your personal information, such as: your habit of visiting the website, your login information, etc.It is for your need to use the film and television product and/or service, simplify your repeated operation steps (such as registration, login), facilitate your viewing history (such as video viewing history), and provide you with the service content that meets your personal needs.Content with you may be more interested in, protect your information and account security, improve film and television products and services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use cookies and similar technologies to collect some of your personal information, such as: your habit of accessing the website, your login information, etc., Cookie and similar technologies collect this kind of information for your use of film and television products and/or services.Necess, simplify your repeated operation steps (such as registration, login), facilitate your viewing history (such as video viewing history), provide you with the service content that matches your personal needs and the content you may be more interested in, and protect youInformation and account security, improving film and television products and services."}
{"task": "rw_87.jsonl", "id": 66778, "text": "We promise to use cookies and similar technologies within the scope of the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66779, "text": "If your browser allows, you can reject Cookie and/or similar technologies through the settings of your browser to manage, (part/all);", "label": ["Important", "Edit/Control"], "rewrite": "You can reject Cookie and/or similar technologies through browser settings."}
{"task": "rw_87.jsonl", "id": 66780, "text": "Or delete cookies and/or similar technologies that have been stored in your mobile device or other devices, so that we cannot track your personal information all or partially.", "label": ["Edit/Control", "Important"], "rewrite": "You can delete cookies and/or similar technologies that have been stored in mobile devices or other devices, so that we cannot track your personal information all or partially."}
{"task": "rw_87.jsonl", "id": 66781, "text": "If you need to learn more about how to change the browser settings in detail, please check the relevant setting page of your browser you use.", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66782, "text": "You understand and know that film and television products/services can only be achieved by using Cookie or similar technologies. If you refuse to use or delete, you may not be able to use our related products and/or services that cannot be used by film and television or unable to pass the film and television or television.Daquan products and/or services obtain the best service experience, and may also have a certain impact on your information protection and account security.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Film and television products/services can only be realized by using cookies or similar technologies. If you refuse to use or delete, we may not be able to use our related products and/or services or not to obtain the best service experience."}
{"task": "rw_87.jsonl", "id": 66783, "text": "4. The way we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66784, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66785, "text": "Your personal information is an important basis and component of our products and/or services for you. For your personal information, we only collect and use in the purpose and scope of the privacy policy or in accordance with the requirements of laws and regulations., And strictly keep secret, will not share your personal information with third -party companies, organizations and individuals, unless there is the following or more situations:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We only collect and use personal information in accordance with the requirements of the privacy policy or in accordance with the requirements of the laws and regulations, and strictly keep confidential, and will not share your personal information unless there is the following or more situations:"}
{"task": "rw_87.jsonl", "id": 66786, "text": "A, you make a request yourself", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you make a request yourself, you will share personal information."}
{"task": "rw_87.jsonl", "id": 66787, "text": "b, have obtained your clear authorization consent in advance", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If your clear authorization consent has been obtained in advance, personal information will be shared."}
{"task": "rw_87.jsonl", "id": 66788, "text": "C's necessary sharing within the film and television Daquan", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66789, "text": "For example: In order to facilitate our unified account system based on film and television, it provides you with consistent services and facilitates your unified management, personalized recommendations, guarantee system and account security. Your personal information may conduct necessary sharing within the film and television DaquanItems", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be necessary to share within the film and television Daquan."}
{"task": "rw_87.jsonl", "id": 66790, "text": "In order to give you a consistency and personalized service experience experience in film and television products and/or services, the relevant personal information that reflects your movie habits and hobbies may be shared with our affiliated companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Relevant personal information that reflects your movie habits and hobbies may be shared with our affiliated companies."}
{"task": "rw_87.jsonl", "id": 66791, "text": "We will take the same security measures as affiliated companies to ensure your personal information security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will take the same security measures as affiliated companies to ensure your personal information security."}
{"task": "rw_87.jsonl", "id": 66792, "text": "D and some business partners necessary sharing", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66793, "text": "You understand and know that some of our services will be provided by business partners or jointly provided with our business partners. For the smooth development of the necessary/reasonable business and fulfill our obligations in relevant user agreements or this privacy policyTo exercise our rights, we may need to share some of your information from some business partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may need to share some of your information from some business partners."}
{"task": "rw_87.jsonl", "id": 66794, "text": "But we promise that we will only share your necessary personal information. If we share your personal sensitive information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "But we will only share your necessary personal information. If we share your personal sensitive information or change the purpose of the use and processing of personal information, we will solicit your authorization consent again."}
{"task": "rw_87.jsonl", "id": 66795, "text": "Our business partners and their permissions include:", "label": ["Permission Acquisition", "Important"], "rewrite": "Our business partners and their permissions include:"}
{"task": "rw_87.jsonl", "id": 66796, "text": "Play class:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66797, "text": "1.PP video SDK: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Our business partners and their permissions include: mobile phone/phone permissions, positioning permissions."}
{"task": "rw_87.jsonl", "id": 66798, "text": "2. Play SDK popular: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the popular player played SDK permissions: mobile phone/phone permissions, positioning permissions."}
{"task": "rw_87.jsonl", "id": 66799, "text": "3. Tencent X5: mobile phone/phone permissions, storage permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Get Tencent X5 permissions: mobile phone/phone permissions, storage permissions."}
{"task": "rw_87.jsonl", "id": 66800, "text": "4. Headline short video API: Get IMEI permissions, IMSI permissions, system installation application permissions, MAC address permissions, mobile phone number permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Get IMEI permissions, IMSI permissions, application permissions for system installation, MAC address permissions, and mobile phone number permissions."}
{"task": "rw_87.jsonl", "id": 66801, "text": "5. Kuaishou short video SDK: mobile phone/telephone permissions, system installation application permissions, location information (including obtaining base station positioning information)", "label": ["Permission Acquisition", "Important"], "rewrite": "Get mobile phone/phone permissions, application permissions for system installation, location information (including obtaining base station positioning information)."}
{"task": "rw_87.jsonl", "id": 66802, "text": "Reasons for obtaining permissions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66803, "text": "1. Mobile phone/telephone authority (IMEI authority, IMSI authority, MAC address authority, mobile phone number authority): Obtain the user's device identification, and uniquely identify the user through the device identification", "label": ["Permission Acquisition", "Important"], "rewrite": "Get user device logo and use the device logo to uniquely identify the user."}
{"task": "rw_87.jsonl", "id": 66804, "text": "2. Positioning permissions: By obtaining location information, accurate video content distribution is distributed", "label": ["Permission Acquisition", "Important"], "rewrite": "By obtaining location information, it is distributed for accurate video content."}
{"task": "rw_87.jsonl", "id": 66805, "text": "3. Storage permissions: It is used to save the equipment and other related information, so that the statistical results (such as the number of new users) are more accurate", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the storage permissions and save related information such as equipment, so that the statistical results (such as the number of new users) are more accurate."}
{"task": "rw_87.jsonl", "id": 66806, "text": "4. System installation application: In order to better accurately put advertisements", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66807, "text": "Advertising:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66808, "text": "1. Wide -point SDK: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Wide -point SDK: Get mobile phone/phone permissions, positioning permissions."}
{"task": "rw_87.jsonl", "id": 66809, "text": "2. Baidu Alliance SDK: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Baidu Alliance SDK: Get mobile phone/phone permissions and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66810, "text": "3. Pangolon SDK: Get IMEI permissions, IMSI permissions, system installation application permissions, MAC address permissions, mobile phone number permissions, positioning permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Pangolon SDK: Get IMEI permissions, IMSI permissions, application permissions for system installation, MAC address permissions, mobile phone number permissions, and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66811, "text": "4.vivo Advertising Alliance SDK: Mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "vivo advertising alliance SDK: Get mobile phone/phone permissions and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66812, "text": "5.OPPO Advertising Alliance SDK: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "OPPO Advertising Alliance SDK: Get mobile phone/phone permissions and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66813, "text": "6. Mi League SDK: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Mi League SDK: Get mobile phone/phone permissions, positioning permissions."}
{"task": "rw_87.jsonl", "id": 66814, "text": "7. Jingdong Advertising API: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Jingdong Advertising API: Get mobile phone/phone permissions and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66815, "text": "8. Iqiyi Advertising API: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "IQiyi Advertising API: Get mobile phone/telephone permissions and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66816, "text": "9. Fancy, API: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Fancy API: Get mobile phone/phone permissions and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66817, "text": "Reasons for obtaining permissions:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66818, "text": "1. Mobile phone/phone permission (IMEI permission, IMSI permission, MAC address permission, mobile phone number permission): The permission is used to allow the SDK to obtain the user ID. For single media users, if the permission is allowed, target advertisements will be delivered", "label": ["Permission Acquisition", "Important"], "rewrite": "Mobile phone/telephone permissions (IMEI permissions, IMSI permissions, MAC address permissions, mobile phone number permissions): permissions are used to allow SDK to obtain user logos. For users of single media, they allow obtaining permissions and place targeted advertising."}
{"task": "rw_87.jsonl", "id": 66819, "text": "2. Positioning permissions: By obtaining location information, accurately put advertising for advertising", "label": ["Permission Acquisition", "Important"], "rewrite": "Positioning permissions: Create advertisements by obtaining location information."}
{"task": "rw_87.jsonl", "id": 66820, "text": "3. Application permissions installed by the system: In order to better accurately invest advertisements", "label": ["Permission Acquisition", "Important"], "rewrite": "Application permissions installed by the system: In order to better precise advertisements."}
{"task": "rw_87.jsonl", "id": 66821, "text": "Statistics:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66822, "text": "1. Friend League Mobile statistics SDK: \"IMEI/MAC/Android ID/Idfa/Openudid/Guid/SIM card IMSI/geographical location), storage permissions, process information in operation\" \"", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66823, "text": "2. Tencent BUGLYSDK: mobile phone/phone permissions, positioning permissions, storage permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Tencent Buglysdk: mobile phone/phone permissions, positioning permissions, storage permissions."}
{"task": "rw_87.jsonl", "id": 66824, "text": "3.Talkingdatasdk: mobile phone/phone permissions, positioning permissions, storage permissions, MAC address permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "TalkingDatasdk: Get mobile phone/phone permissions, positioning permissions, storage permissions, MAC address permissions."}
{"task": "rw_87.jsonl", "id": 66825, "text": "Reasons for obtaining permissions:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66826, "text": "1. Mobile phone/telephone authority (IMEI authority, MAC address, ANDROID, ID authority): Obtain the IMEI authority and MAC address authority of the user device, and uniquely identify the user through the IMEI and MAC address;", "label": ["Permission Acquisition", "Important"], "rewrite": "Mobile phone/phone permissions (IMEI permissions, MAC address, Android ID permissions): obtain IMEI permissions, MAC address permissions for user devices, and use the unique identifier user through IMEI and MAC addresses."}
{"task": "rw_87.jsonl", "id": 66827, "text": "Obtaining Android, ID is used for data statistics and collapse statistics, which is convenient for subsequent performance optimization, and obtains no more than 3 times during a single use process.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get the Android ID for data statistics and collapse statistics, which is convenient for subsequent performance optimization, and obtains no more than 3 times during the single use process."}
{"task": "rw_87.jsonl", "id": 66828, "text": "2. Positioning permissions: By obtaining location information, correction of the regional distribution data of users to make report data more accurate", "label": ["Permission Acquisition", "Important"], "rewrite": "Positioning permissions: By obtaining location information, the regional distribution data of users can be corrected to make report data more accurate."}
{"task": "rw_87.jsonl", "id": 66829, "text": "3. Storage permissions: It is used to save the equipment and other related information, so that the statistical results (such as the number of new users) are more accurate", "label": ["Permission Acquisition", "Important"], "rewrite": "Storage permissions: It is used to save related information such as equipment, so that statistical results (such as adding users) are more accurate."}
{"task": "rw_87.jsonl", "id": 66830, "text": "Push:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66831, "text": "1. Push platform SDK: mobile phone/phone permissions, positioning permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "SDK push platform SDK: Get mobile phone/phone permissions and positioning permissions."}
{"task": "rw_87.jsonl", "id": 66832, "text": "Reasons for obtaining permissions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66833, "text": "1. Mobile phone/telephone authority: obtain the IMEI of the user's device, and uniquely identify the user through the IMEI", "label": ["Permission Acquisition", "Important"], "rewrite": "Mobile phone/phone permissions: obtain IMEI for user devices, and identify unique users through IMEI."}
{"task": "rw_87.jsonl", "id": 66834, "text": "2. Positioning permissions: By obtaining location information, it is used to correct the regional distribution data of the user and do precise push", "label": ["Permission Acquisition", "Important"], "rewrite": "Positioning permissions: By obtaining location information, it is used to correct the regional distribution data of users and make precise push."}
{"task": "rw_87.jsonl", "id": 66835, "text": "novel:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66836, "text": "1. Click novel SDK: mobile phone/phone permissions", "label": ["Permission Acquisition", "Important"], "rewrite": "Click Novel SDK: Get mobile phone/phone permissions."}
{"task": "rw_87.jsonl", "id": 66837, "text": "Reasons for obtaining permissions:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66838, "text": "1. Mobile phone/telephone authority: Obtain the IMEI of the user's device, and use the IMEI to identify the uniqueness of the user.", "label": ["Permission Acquisition", "Important"], "rewrite": "Mobile phone/phone permissions: obtain IMEI for user devices, and identify the uniqueness of the user through IMEI."}
{"task": "rw_87.jsonl", "id": 66839, "text": "2. MAC address: device information", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66840, "text": "3. Mobile phone/telephone permissions: Permissions are used to allow the SDK to obtain user IDs. For single-media users, those who are allowed to obtain permissions can serve targeted advertisements", "label": ["Permission Acquisition", "Important"], "rewrite": "Mobile phone/phone permissions: permissions are used to allow SDK to obtain user logos. For users of single media, those who allow permissions to obtain permissions will be placed on targeted ads."}
{"task": "rw_87.jsonl", "id": 66841, "text": "position:", "label": [], "rewrite": []}
{"task": "rw_87.jsonl", "id": 66842, "text": "1., use SDK name: Gaode open platform positioning SDK", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Use SDK name: Gaode open platform positioning SDK."}
{"task": "rw_87.jsonl", "id": 66843, "text": "Third party name: Gaode Software Co., Ltd.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Third party name: Gaode Software Co., Ltd.."}
{"task": "rw_87.jsonl", "id": 66844, "text": "Purpose: By obtaining location information, it is used to correct the regional distribution data of users, and obtains not more than twice during the single use process.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Purpose: By obtaining location information, it is used to correct the regional distribution data of users, and obtains not more than twice during the single use process."}
{"task": "rw_87.jsonl", "id": 66845, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
