{"task": "rw_83.jsonl", "id": 65391, "text": "Tencent Video Privacy Protection Guide", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65392, "text": "Update date: September 27, 2020", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65393, "text": "Effective date: September 27, 2020", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65394, "text": "1. The information we collect", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65395, "text": "Tencent Video is an online video media platform developed and operated by Tencent Group (hereinafter referred to as \"us\"). In the process of using Tencent video service, we will collect the initiative to provide or because of the service provided by the service as follows, because of the service use serviceThe information generated to provide you with services, optimization of our services, and ensuring your account security:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65396, "text": "When you register for Tencent Video Service, we will collect your device MAC address and unique device recognition code to identify users who are Tencent Video.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your device MAC address and unique device recognition code to identify you as a Tencent video."}
{"task": "rw_83.jsonl", "id": 65397, "text": "If you log in to Tencent video with QQ or WeChat associated, we will collect the unique logo, avatar, and nickname of your QQ or WeChat to save your login information so that you can synchronize your data when logging in with different devices.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the unique logo, avatar, and nickname of your QQ or WeChat to save login information."}
{"task": "rw_83.jsonl", "id": 65398, "text": "When you use Tencent video services, we will collect your video playback record so that you can view your viewing history.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65399, "text": "We will also collect the videos and channel information you added in the order and subscription function, so that you can play the video you are interested in more easily and quickly and visit the content you subscribe.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect video and channel information added to the ordering and subscription functions to play videos and access the subscription content."}
{"task": "rw_83.jsonl", "id": 65400, "text": "Your viewing history, watching orders, and subscribing information will be stored in our server so that you can use the above features when logging in through multiple terminals, you can also delete this information at any client at any time.", "label": ["Data Retention", "Important"], "rewrite": "Watching history, watching orders, and subscribing information will be stored in the server so that you can use the above functions when logging in through multiple terminals, you can delete information at any time."}
{"task": "rw_83.jsonl", "id": 65401, "text": "In order to ensure your normal use of our services, maintain the normal operation of our service, improve and optimize your service experience and ensure your account security, we will collect your device model, operating system, unique device identifier, login IP address, login IP address, login, login IP address,Operation logs and other information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information about your device model, operating system, unique device identifier, login IP address, operation log and other information."}
{"task": "rw_83.jsonl", "id": 65402, "text": "We or our third -party partners may collect your information through cookies or similar technologies, including your device information, browsing information, and clicking information, and store these information as a log information to remember your identity and analysisYou use our service situation and optimize advertising.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect equipment information, browse information, click on information, and store such information as log information for analysis of usage."}
{"task": "rw_83.jsonl", "id": 65403, "text": "You can use the browser to set the use of refusal or management of cookies or similar technologies.", "label": ["Important", "Edit/Control"], "rewrite": "You can use the browser to set the use of refusal or management of cookies or similar technologies."}
{"task": "rw_83.jsonl", "id": 65404, "text": "At the same time, we will also use a third -party SDK to achieve the above collection and use. Among them, if you use Xiaomi, Meizu, Huawei, OPPO, vivo mobile phones, the above -mentioned mobile phone manufacturer push connected by Tencent Video, SDK needs to collect the unique identification information of the mobile phone (For example, IMEI), and parameters of your mobile phone model, system type, system version, device screen size and other parameters may be collected to achieve information such as promotional activities, video content and other information;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect parameters such as mobile phone unique identification information (such as IMEI), mobile phone models, system types, system versions, device screen size and other parameters to implement information such as promotion activities and video content."}
{"task": "rw_83.jsonl", "id": 65405, "text": "We will also use the SDK of the Iri Consultation Group for playback statistics. The SDK may collect parameters such as the unique identification information (such as IMEI) and video playback records, system versions, and mobile phone models to complete the above statistics.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect parameters such as mobile phone unique identification information (such as IMEI) and video playback records, system versions, mobile phone models and other parameters to complete play statistics."}
{"task": "rw_83.jsonl", "id": 65406, "text": "When you use the Doki community function, we will collect your uploaded videos, photos, posts, comments, likes, and like information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your uploaded videos, photos, posts, comments, likes."}
{"task": "rw_83.jsonl", "id": 65407, "text": "We will store it in an encrypted manner, and you can delete this information at any time.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will store personal information in an encrypted manner, and you can delete this information at any time."}
{"task": "rw_83.jsonl", "id": 65408, "text": "In addition, when you upload videos using the Doki community:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65409, "text": "After obtaining your consent, we will record your geographical location information to identify the geographical location of the video.", "label": ["Important", "First Party Collection Information"], "rewrite": "After obtaining consent, record the geographical location information to identify the geographical location of the video."}
{"task": "rw_83.jsonl", "id": 65410, "text": "Geographical location information is a sensitive information. Refusing to provide this information does not affect other functions of your normally use Doki community. You can also close your geographical location information at any time;", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide geographical information information does not affect other functions of the normal use of the Doki community, you can turn off geographical location information at any time."}
{"task": "rw_83.jsonl", "id": 65411, "text": "We will also collect your mobile phone number for verifying your user information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number for verifying your user information."}
{"task": "rw_83.jsonl", "id": 65412, "text": "The mobile phone number is a sensitive information. The collection of the mobile phone number is to meet the online real -name system requirements of relevant laws and regulations.", "label": ["Important", "First Party Collection Information"], "rewrite": "The sensitive information of collecting mobile phone numbers is to meet the real -name system requirements of relevant laws and regulations."}
{"task": "rw_83.jsonl", "id": 65413, "text": "If you refuse to provide a mobile phone number, it will only make you unable to upload videos in the Doki community, but it will not affect other functions of your use of Tencent Video normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number, you will not upload videos in the Doki community, but it will not affect your normal use of other functions."}
{"task": "rw_83.jsonl", "id": 65414, "text": "When you become a VIP member of Tencent Video, you can choose to fill in your birthday, mobile phone number, and delivery address according to your own needs. We will push you to enjoy special discount activities, provide birthday benefits, issue gifts, and send goods based on this information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can fill in your birthday, mobile phone number, and receiving address according to your own needs."}
{"task": "rw_83.jsonl", "id": 65415, "text": "You can provide us with your name and ID number for real -name authentication. Real -name authentication can help protect account security and participate in exclusive preferential activities.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect name and ID number for real -name authentication."}
{"task": "rw_83.jsonl", "id": 65416, "text": "This information is sensitive information, and refusal to provide this information does not affect other services you use your use of Tencent Video normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "The name and ID number information is sensitive information, and refuses to provide other services that do not affect normal use."}
{"task": "rw_83.jsonl", "id": 65417, "text": "In addition, you can authorize to share your WeChat or QQ friends list with us, and we will recommend activities to you according to your friend information.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can authorize to share WeChat or QQ friends list for recommendation activities."}
{"task": "rw_83.jsonl", "id": 65418, "text": "When you log in to Tencent Video with QQ or WeChat affiliate and use VIP membership -related functions, if you use a close payment function to help your friends open members and use VIP membership page to view content recommendation, we may collect you and show you to you because of the necessary collection and show you to youFriends information of WeChat or QQ.", "label": ["Important", "First Party Collection Information"], "rewrite": "It may be collected and displayed by friends of WeChat or QQ for providing VIP membership services."}
{"task": "rw_83.jsonl", "id": 65419, "text": "When you use the game community function, we may collect your mobile phone number for you to send you text messages to remind you when you are online.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number for sending SMS reminders."}
{"task": "rw_83.jsonl", "id": 65420, "text": "The mobile phone number is a sensitive information. If you refuse to provide the mobile phone number, it will only make you unable to receive the text message reminder of the appointment game online, but it will not affect other services you use Tencent videos normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number, you will not be able to receive SMS reminders, but it will not affect the normal use of other services."}
{"task": "rw_83.jsonl", "id": 65421, "text": "When you use the mall function, we will collect your delivery address and mobile phone number to send you a product and SMS notifying your order progress to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the delivery address and mobile phone number for the progress of the order and SMS notification order."}
{"task": "rw_83.jsonl", "id": 65422, "text": "This information is a sensitive information. If you refuse to provide this information, you will not be able to buy goods in the mall, but it will not affect other services that you use Tencent Video normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide mobile phone numbers and delivery addresses, you will not be able to buy goods, but other services will not affect normal use."}
{"task": "rw_83.jsonl", "id": 65423, "text": "When you use the Faceid feature device (such as iPhone X), the eye protection laboratory function of Tencent Video will use TrueDepth APIS. When watching the distance between the video and the screen, it is prompted to protect the eyes and help users develop well.The habit of watching the movie.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65424, "text": "TrueDepth, APIS only obtains the location of the face in the world coordinate system for real -time calculation of the distance from the eyes to the screen. We will neither store the information with third parties.", "label": ["Important", "Data Security"], "rewrite": "The collector's face in the world coordinate system is used to calculate the distance from the eyes to the screen in real time. It will neither store the information with third parties."}
{"task": "rw_83.jsonl", "id": 65425, "text": "You can terminate the use of the distance information at any time through the function switch of the eye protection laboratory.", "label": ["Important", "Edit/Control"], "rewrite": "The function switch of the eye protection laboratory can be terminated at any time."}
{"task": "rw_83.jsonl", "id": 65426, "text": "When you choose to turn on TrueDepth, APIS function and watch the video, this function will judge the distance, and it will not be collected or saved during the use of any other information that \"use to support judgment distance\", such as face -related information informationwait.", "label": ["Important", "First Party Collection Information"], "rewrite": "Do not collect or save any other information \"used to support judgment\" during use."}
{"task": "rw_83.jsonl", "id": 65427, "text": "In addition, according to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, we may collect and use your relevant personal information without asking your authorization consent:"}
{"task": "rw_83.jsonl", "id": 65428, "text": "Directly related to national interests such as national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national interests such as national security and national defense security does not need to solicit consent."}
{"task": "rw_83.jsonl", "id": 65429, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to major public interests does not need to solicit consent."}
{"task": "rw_83.jsonl", "id": 65430, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgments without asking for consent."}
{"task": "rw_83.jsonl", "id": 65431, "text": "Out of maintaining major legitimate rights and interests such as life, property, and reputation of you or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_83.jsonl", "id": 65432, "text": "The personal information collected is publicly disclosed to the public by itself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made to the public by itself without asking for consent."}
{"task": "rw_83.jsonl", "id": 65433, "text": "Collect personal information from the legal public information, such as legal news reports, government information disclosure and other channels;;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_83.jsonl", "id": 65434, "text": "The required signing and fulfillment of the contract must be signed according to your request;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the signing and performing the contract without soliciting consent."}
{"task": "rw_83.jsonl", "id": 65435, "text": "The necessary and stable operation of the products or services provided by maintaining the products or services, such as discovering and disposing of products or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products or services, there is no need to solicit consent."}
{"task": "rw_83.jsonl", "id": 65436, "text": "It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for legal news reports does not need to ask for consent."}
{"task": "rw_83.jsonl", "id": 65437, "text": "When it is necessary to carry out statistics or academic research in public interests, and the results of academic research or descriptions are provided, the personal information contained in the results is identified by", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and carrying out the necessary personal information necessary for public interests or academic research, without asking for consent."}
{"task": "rw_83.jsonl", "id": 65438, "text": "Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_83.jsonl", "id": 65439, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and the information is collected, the content, scope and purpose of the information collection will be explained to obtain consent."}
{"task": "rw_83.jsonl", "id": 65440, "text": "Please note that we will not take the initiative to obtain your personal information from a third party outside Tencent Group.", "label": ["Important", "First Party Collection Information"], "rewrite": "At present, we will not take the initiative to collect personal information from a third party outside Tencent Group."}
{"task": "rw_83.jsonl", "id": 65441, "text": "If the business development needs to indirectly obtain your personal information from a third party, we will tell you the source, type, and scope of use of personal information before acquisition.The scope of authorization consent when providing personal information, and we will obtain your authorization consent before dealing with such personal information;", "label": ["Important", "First Party Collection Information", "Data Security"], "rewrite": "If a third party is required to obtain personal information indirectly in the future, the source, type, and scope of use of personal information will be notified before obtaining. If the processing activity exceeds the scope of the original authorization consent, the authorization consent will be obtained before processing."}
{"task": "rw_83.jsonl", "id": 65442, "text": "In addition, we will also strictly abide by the provisions of relevant laws and regulations, and require a third party to ensure the legality of the information provided.", "label": ["Important", "First Party Collection Information"], "rewrite": "The legitimacy of third parties will be required to protect the information provided by it."}
{"task": "rw_83.jsonl", "id": 65443, "text": "2. Storage of information", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65444, "text": "2.1 Method and period of information storage", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65445, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "It will store information through security methods, including local storage (such as using APP for data cache), database and server logs."}
{"task": "rw_83.jsonl", "id": 65446, "text": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "It will only store personal information within the time necessary for the service purpose or under the conditions stipulated by laws and regulations."}
{"task": "rw_83.jsonl", "id": 65447, "text": "You can choose to delete the viewing history, watching orders, and subscribing to the personal information provided and generated when you use Tencent video services. If you choose to delete the above information, we will also delete the corresponding personal information accordingly.", "label": ["Important", "Edit/Control"], "rewrite": "You can choose to delete the personal information provided when using the service. If you choose to delete, we will also delete the corresponding personal information."}
{"task": "rw_83.jsonl", "id": 65448, "text": "2.2 The area where information storage", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65449, "text": "We will store personal information collected in China in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected in the country will be stored in China."}
{"task": "rw_83.jsonl", "id": 65450, "text": "At present, we will not transmit or store your personal information cross -border.", "label": ["Data Retention", "Important"], "rewrite": "At present, we will not transmit or store your personal information cross -border."}
{"task": "rw_83.jsonl", "id": 65451, "text": "If you need to transmit or store cross -border in the future, we will inform you that the purpose of the information outbound, receiving party, security guarantee measures and security risks, and obtain your consent.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "In the future, if you need to transmit or store cross -border transmission in the future, you will inform you of the purpose, receiver, security guarantee measures and security risks of information outbound, and obtain consent."}
{"task": "rw_83.jsonl", "id": 65452, "text": "2.3 Notice of the product or service stopping operation", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65453, "text": "When our products or services stop operation, we will notify you in the form of push notifications, announcements, etc., and delete your personal information or perform anonymous processing within a reasonable period.", "label": ["Important", "Cessation of Operations"], "rewrite": "When operating is stopped, you will notify you and delete personal information or anonymous processing within a reasonable period."}
{"task": "rw_83.jsonl", "id": 65454, "text": "3. Information security", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65455, "text": "3.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65456, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65457, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "Use multi -directional security protection measures to ensure that the protection of user personal information is at a reasonable level of security."}
{"task": "rw_83.jsonl", "id": 65458, "text": "In addition, we have passed the evaluation and filing of the national network security level protection (level 3).", "label": ["Important", "Data Security"], "rewrite": "We have also passed the evaluation and filing of national network security level protection (level three)."}
{"task": "rw_83.jsonl", "id": 65459, "text": "We use industry -leading technical protection measures.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65460, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc."}
{"task": "rw_83.jsonl", "id": 65461, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65462, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "We will complete some information encryption work locally to consolidate security transmission."}
{"task": "rw_83.jsonl", "id": 65463, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "We will understand the application information and running process information installed by your device to prevent malicious procedures."}
{"task": "rw_83.jsonl", "id": 65464, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a special management system, process and organization that guarantees personal information security."}
{"task": "rw_83.jsonl", "id": 65465, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel of access information, require them to comply with confidentiality obligations and audit, and personnel who violate obligations will be punished in accordance with regulations."}
{"task": "rw_83.jsonl", "id": 65466, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "The management system, process and organization will be reviewed to prevent unauthorized personnel from accessing, using or disclosing users' information on unauthorized personnel."}
{"task": "rw_83.jsonl", "id": 65467, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65468, "text": "3.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65469, "text": "If personal information leakage, damage, loss and other security incidents occur, we will start emergency plans to prevent the expansion of security events.", "label": ["Important", "Data Security"], "rewrite": "If personal information leakage, damage, loss and other security incidents occur, emergency plans will be initiated to prevent the expansion of security incidents."}
{"task": "rw_83.jsonl", "id": 65470, "text": "After the safety event occurs, we will timely inform you the basic situation of the security incident in the form of push notifications and emails, the disposal measures and remedial measures we are about to adopt or we have taken, and our proposal to your response.", "label": ["Important", "Data Security"], "rewrite": "After the security incident occurs, you will inform you in a timely manner, handling measures, and remedial measures, and response suggestions."}
{"task": "rw_83.jsonl", "id": 65471, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to inform one by one, warnings will be issued through announcement and other methods."}
{"task": "rw_83.jsonl", "id": 65472, "text": "4. How do we use information", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65473, "text": "We strictly abide by the provisions of laws and regulations and the agreement with users, and in accordance with the information used in accordance with the guidelines of this privacy protection, to provide you with better services.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65474, "text": "4.1 Information use rules", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65475, "text": "We will use the collected information according to the following rules:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65476, "text": "We will provide you with various functions and services based on the information we collect, including video viewing services, VIP member services, DOKI community functions, game community functions, mall functions;", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65477, "text": "We will provide you with personalized services based on the characteristics of your browsing preferences, habits, location information, etc., including the indirect crowd portrait based on characteristic labels and recommend the content and activities you may be interested in, show you more correlation with youAdvertising or other promotion content, optimize the experience of personalized services, and evaluate and improve the effects of advertising and other promotion activities;", "label": ["Important", "Usage"], "rewrite": "It will provide you with personalized services based on your browsing preferences, habits, location information and other characteristics."}
{"task": "rw_83.jsonl", "id": 65478, "text": "We will analyze the operation of our products based on the frequency and situation of Tencent video, fault information, performance information, etc., to ensure the security of the service, optimize our products, and improve our service quality.", "label": ["Important", "Usage"], "rewrite": "Analyze the operation of the product based on the frequency and situation of Tencent video, fault information, performance information, etc."}
{"task": "rw_83.jsonl", "id": 65479, "text": "We will not combine the information we store in the analysis software with the personal identity information you provide.", "label": ["Important", "Data Security", "Usage"], "rewrite": "We will not combine the information stored in the analysis software with the personal identity information you provide."}
{"task": "rw_83.jsonl", "id": 65480, "text": "4.2 Rules for directional push activities", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65481, "text": "We will push directed in accordance with the following rules and provide you with a corresponding exit mechanism:", "label": ["Important", "Usage"], "rewrite": "Will be pushed in accordance with the following rules, and provide you with a corresponding exit mechanism:"}
{"task": "rw_83.jsonl", "id": 65482, "text": "We will provide you with personalized promotion content based on the characteristics of your viewing records and browsing preferences, such as recommending you to videos that meet your preferences (the words \"Recommend for you\").", "label": ["Important", "Usage"], "rewrite": "It will provide you with personalized promotion content based on the characteristics of your viewing records and browsing preferences."}
{"task": "rw_83.jsonl", "id": 65483, "text": "You can reducing the correlation with you by deleting viewing history to reduce the recommendation content.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can reducing the correlation with you by deleting viewing history to reduce the recommendation content."}
{"task": "rw_83.jsonl", "id": 65484, "text": "We will show you advertisements based on the characteristics of your viewing records and browsing preferences (the word \"advertisement\" is listed).", "label": ["Important", "Usage"], "rewrite": "We will show you advertisements based on the characteristics of your viewing records and browsing preferences."}
{"task": "rw_83.jsonl", "id": 65485, "text": "You can exit such personalized advertising push through a special control panel page.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can exit such personalized advertising push through a special control panel page."}
{"task": "rw_83.jsonl", "id": 65486, "text": "4.3 The way to obtain consent after notifying the purpose of the change", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65487, "text": "We will use the collected information in the purpose covered by the guidance of privacy protection.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65488, "text": "If we use your personal information, which exceeds the purpose and scope of direct or reasonable correlation with the purpose of the time of collection, we will tell you and obtain your explicit consent again before using your personal information.", "label": ["Important", "Data Security", "Usage"], "rewrite": "If we use personal information, we have exceeded the scope of reasonable scope, and we will tell and obtain consent again before using personal information."}
{"task": "rw_83.jsonl", "id": 65489, "text": "5. Provide outside", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65490, "text": "At present, we will not take the initiative to share or transfer your personal information until the third party. If there are other sharing or transfer your personal information or you need us to share or transfer your personal information to a third party situation, we will directly or confirm itThe third party obtains your explicit consent of the above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not take the initiative to share or transfer personal information to third parties. If there is a sharing or transfer situation, we will confirm that the third party obtains your explicit consent."}
{"task": "rw_83.jsonl", "id": 65491, "text": "In order to improve your user experience, such as optimizing advertising effects, we need to share information that has been anonymous or de -identified to third -party partners, etc., and requires them to strictly abide by our measures and requirements on data privacy protection, including DananIt is not limited to processing according to the data protection agreement, commitment letter and related data processing policies to avoid identifying personal identity and ensuring privacy security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "In order to enhance the user experience, it is necessary to share the information that has been anonymous or de -identified with third -party partners, and requires them to strictly abide by measures and requirements for data privacy protection."}
{"task": "rw_83.jsonl", "id": 65492, "text": "We will not share with partners to identify information that can be used to identify your personal identity (such as your name or email address), unless you clearly authorize.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It will not share with your partners to identify information that can be used to identify your personal identity unless you clearly authorize."}
{"task": "rw_83.jsonl", "id": 65493, "text": "We will not publicly disclose the personal information collected to the outside world. If we must disclose it publicly, we will tell you the purpose of the public disclosure, the type of disclosure information, and the possible sensitive information that may be involved, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you do not publicly disclose the collected personal information, if you must disclose it publicly, you will inform the disclosure, the type of disclosure information, and the sensitive information that may be involved, and obtain the consent."}
{"task": "rw_83.jsonl", "id": 65494, "text": "With the sustainable development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new control in accordance with laws and regulations and not lower than the standards required by the privacy protection guidelines.Continue to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may conduct transactions such as mergers, acquisitions, and asset transfer, and we will inform you of relevant situations and continue to protect personal information."}
{"task": "rw_83.jsonl", "id": 65495, "text": "In addition, in accordance with relevant laws and regulations and national standards, in the following situations, we may share, transfer, and openly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, or openly disclose personal information without obtaining authorization and consent in advance:"}
{"task": "rw_83.jsonl", "id": 65496, "text": "Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that shared, transferred, and publicly related to national security and national defense security did not need to solicit consent."}
{"task": "rw_83.jsonl", "id": 65497, "text": "Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information directly related to sharing, transfer, public information directly related to public safety, public health, and major public interests does not need to ask for consent."}
{"task": "rw_83.jsonl", "id": 65498, "text": "Directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Direct related personal information such as sharing, transfer, openness, and criminal investigation, prosecution, trial and judgment execution does not need to solicit consent."}
{"task": "rw_83.jsonl", "id": 65499, "text": "It is difficult to obtain the major legitimate rights and interests of the life and property of the subject of personal information or other individuals; it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing and maintaining major legitimate rights and interests but difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_83.jsonl", "id": 65500, "text": "The subject of personal information disclose personal information to the public by themselves;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the subject of personal information disclose personal information to the public by itself, no consent is required."}
{"task": "rw_83.jsonl", "id": 65501, "text": "Collect personal information from legal public information, such as legal news reports, government information disclosure and other channels.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_83.jsonl", "id": 65502, "text": "6. Your rights", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65503, "text": "During your use of Tencent Video, in order to make you more conveniently inquire about access, delete, and correct your personal information, while ensuring your consent and the right to cancel your account of your personal information, we provide you with the corresponding product design in the product design.Operation settings, you can refer to the following guidelines for operation.", "label": ["Important", "Edit/Control"], "rewrite": "In order to more conveniently query access, delete, correct personal information, while ensuring your right to withdraw consent and cancel the account, you provide corresponding operation settings in product design."}
{"task": "rw_83.jsonl", "id": 65504, "text": "In addition, we have set up a complaint report channel, and your opinions will be dealt with in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65505, "text": "6.1 Visit personal information", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65506, "text": "Visit the basic information of WeChat, QQ number, avatar, nickname, etc.: 1), after entering Tencent Video, click \"Personal Center\"; 2), click on the avatar bar; 3) to query information and access.", "label": ["Important", "Edit/Control"], "rewrite": "Visit the basic information of WeChat, QQ number, avatar, nickname, etc.: 1) After entering Tencent Video, click \"Personal Center\"; 2) Click on the avatar bar; 3) For information query access."}
{"task": "rw_83.jsonl", "id": 65507, "text": "Visit the history, my list, my subscription information: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"Watch History\", \"My Watch List\", \"My Subscribe\", respectively.Inquiry.", "label": ["Important", "Edit/Control"], "rewrite": "Visit the history, my list, my subscription information: 1) After entering Tencent video, click \"Personal Center\"; 2) click \"Watch History\", \"My Watch List\", \"My Subscribe\" for inquiryEssence"}
{"task": "rw_83.jsonl", "id": 65508, "text": "Visit mobile phone binding and real -name authentication information: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"My VIP Member\"; 3), click the VIP help service center column and select \"More\";4), click \"Binding Mobile Phone\" and \"Real -name Certification\" respectively.", "label": ["Important", "Edit/Control"], "rewrite": "Visit mobile phone binding and real -name authentication information: 1) After entering Tencent video, click \"Personal Center\"; 2) click \"My VIP Member\"; 3) Click the VIP to help the service center column \"more\"; 4)Click \"Binding Mobile Phone\" and \"Real -name Certification\" for query."}
{"task": "rw_83.jsonl", "id": 65509, "text": "Visit the receiving address, mobile phone number information: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"Grassage Mall\"; 3), click \"Mine\";\"; 5), conduct information query access.", "label": ["Important", "Edit/Control"], "rewrite": "Visit the receiving address and mobile phone number information: 1) After entering Tencent video, click \"Personal Center\"; 2) click \"Caojing Mall\"; 3) click \"My\"; 4) Click \"Receive Address\"; 5)Information query access."}
{"task": "rw_83.jsonl", "id": 65510, "text": "6.2 Delete personal information", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65511, "text": "Delete viewing history: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"Watch History\"; 3), click \"Edit\"; 4), check the videos you want to delete, or click \"All Selected Selection\"; 5), click\" Delete \".", "label": ["Important", "Edit/Control"], "rewrite": "Delete viewing history: 1) After entering Tencent Video, click \"Personal Center\"; 2) Click \"Watch History\"; 3) Click \"Edit\"; 4) Check the videos you want to delete, or click \"All Selected\"; 5)Click \"Delete\"."}
{"task": "rw_83.jsonl", "id": 65512, "text": "Delete the list:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65513, "text": "1), after entering Tencent video, click \"Personal Center\" 2), click \"My Watch List\"; 3), click \"Edit\"; 4), check the list of watches you want to delete, or click \"All Selected\";5), click \"Delete\".", "label": ["Important", "Edit/Control"], "rewrite": "Delete the list: 1) After entering Tencent Video, click \"Personal Center\" 2) Click \"My Watch Flies\"; 3) Click \"Edit\"; 4) Check the list that I want to delete, or click \"All Selected\";5) Click \"Delete\"."}
{"task": "rw_83.jsonl", "id": 65514, "text": "Delete the receiving address and mobile phone number:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65515, "text": "1), after entering Tencent video, click \"Personal Center\"; 2), click \"Grassage Mall\"; 3), click \"My\"; 4), click \"Received the Power address\"; 5), move left to the leftI hope to delete the delivery address and mobile phone number; 6), click \"Delete\".", "label": ["Edit/Control", "Important"], "rewrite": "Delete the receiving address and mobile phone number: 1) After entering Tencent Video, click \"Personal Center\"; 2) click \"Grassage Mall\"; 3) click \"My\"; 4) Click \"Receive Address\"; 5) Towards the direction;The left -handed removal address and mobile phone number; 6) Click \"Delete\"."}
{"task": "rw_83.jsonl", "id": 65516, "text": "Delete posts, comments, and videos:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65517, "text": "1) After entering Tencent video, visit posts, comments, videos; 2), click \"\" icon; 3), click \"Delete\".", "label": ["Important", "Edit/Control"], "rewrite": "Delete posts, comments, videos: 1) After entering Tencent Video, visit posts, comments, videos; 2) Click \"\" icon; 3) Click \"Delete\"."}
{"task": "rw_83.jsonl", "id": 65518, "text": "6.3 Correct personal information", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65519, "text": "Change your avatar and nickname:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65520, "text": "1), since you use related accounts WeChat or QQ to log in to Tencent Video, changing your avatar and nicknames need to be operated on WeChat or QQ: 2), click \"I\", click \"Settings\"; 4), 4), 4), 4),), 4), 4), 4), 4), and 4), 4), and 4), 4), 4), 4), 4), 4), and 4), 4), and 4), 4), 4), and 4), 4), 4), and 4).Click on the avatar bar; 5), make the avatar and nickname change operation; or 1), after entering QQ, click on the avatar; 2), click the avatar bar; 3), click \"Edit Information\"; 4), perform the avatar and nickname change operation operation operationEssence", "label": ["Important", "Edit/Control"], "rewrite": "Change the avatar and nickname: 1) Since you use related account WeChat or QQ login Tencent video, you need to operate on WeChat or QQ on WeChat: 2) After entering WeChat, click \"I\"; 3) Click \"Settings\"; 4) Click on the avatar bar; 5) the avatar and nickname change operation; or 1) After entering QQ, click on the avatar; 2) click on the avatar bar; 3) click \"Edit Information\"; 4) for the avatar and nickname change operation."}
{"task": "rw_83.jsonl", "id": 65521, "text": "Change the binding mobile phone: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"My VIP Member\"; 3), click VIP to help the service center column \"more\"; 4), click), click on\"Binding mobile phones\"; 5), click \"Replace\"; 6) for changing operations.", "label": ["Important", "Edit/Control"], "rewrite": "Change the binding mobile phone: 1) After entering Tencent video, click \"Personal Center\"; 2) Click \"My VIP Member\"; 3) Click VIP to help the service center column and select \"More\"; 4) Click \"Binding the mobile phone to bind the mobile phone\"; 5) Click\" Replacement \"; 6) to change the operation."}
{"task": "rw_83.jsonl", "id": 65522, "text": "Change the receiving address and mobile phone number: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"Caojing Mall\"; 3), click \"My\"; 4), click \"Receive address\"; 5), click the receiving address and mobile phone number that needs to be changed; 6) to perform changes.", "label": ["Important", "Edit/Control"], "rewrite": "Change the receiving address and mobile phone number: 1) After entering Tencent Video, click \"Personal Center\"; 2) click \"Grassage Mall\"; 3) Click \"Mine\"; 4) Click \"Receive Address\"; 5) Click onThe receiving address and mobile phone number need to be changed; 6) The change operation is performed."}
{"task": "rw_83.jsonl", "id": 65523, "text": "6.4 Withdrawal consent", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65524, "text": "Withdrawal information, location information, camera, file storage and access, microphone authorization consent: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"Settings\"; 3), click \"Privacy Settings\"; 4), Click on the right switch to close the content to be withdrawn.", "label": ["Important", "Edit/Control"], "rewrite": "Withdrawal information, location information, camera, file storage and access, microphone authorization consent: 1) After entering Tencent video, click \"Personal Center\"; 2) click \"Settings\"; 3) Click \"Privacy Settings\"; 4) Click right to right.The side switch is closed to withdraw the authorization content."}
{"task": "rw_83.jsonl", "id": 65525, "text": "6.5 Exit login", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65526, "text": "Exit the related account login", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65527, "text": "1) After entering Tencent Video, click \"Personal Center\"; 2) Click \"Settings\"; 3) Click WeChat or QQ in the sharing account bar, click \"OK\" to exit login; or 4) Click \"Exit the Account\"; 5) Click) Click)\"sign out\".", "label": ["Important", "Edit/Control"], "rewrite": "Exit the related account login: 1) After entering Tencent Video, click \"Personal Center\"; 2) Click \"Settings\"; 3) Click on WeChat or QQ in the sharing account bar, click \"OK\" to exit login; or 4) Click \"Exit the account account\"; 5) Click\" Exit Login \"."}
{"task": "rw_83.jsonl", "id": 65528, "text": "Note: Tencent video has no independent account. You can use related account WeChat or QQ login Tencent video.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65529, "text": "If you need to cancel the WeChat or QQ account, please cancel on WeChat and QQ based on its guidelines.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to cancel the WeChat or QQ account, please cancel on WeChat and QQ based on its guidelines."}
{"task": "rw_83.jsonl", "id": 65530, "text": "6.6 Complaint report", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65531, "text": "Report video: 1), after entering Tencent video, visit the video; 2), click \"\" icon; 3), click \"Report\"; 4), select the reason for the report; 5), click \"Submit\".", "label": ["Important", "Edit/Control"], "rewrite": "Report video: 1) After entering Tencent video, visit the video; 2) click \"\" icon; 3) click \"Report\"; 4) Select the reason for the report; 5) click \"Submit\"."}
{"task": "rw_83.jsonl", "id": 65532, "text": "Report comment:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65533, "text": "1) After entering Tencent's video, visit the comment; 2), click \"\" icon; 3), click \"Report\";", "label": ["Important", "Edit/Control"], "rewrite": "Report comments: 1) After entering Tencent Video, visit the comment; 2) Click the \"\" icon; 3) Click \"Report\"."}
{"task": "rw_83.jsonl", "id": 65534, "text": "Report barrage:", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65535, "text": "1) After entering Tencent's video, visit the video barrage; 2), click the barrage of the hope to report; 3), click \"Report\".", "label": ["Important", "Edit/Control"], "rewrite": "Report barrage: 1) After entering Tencent Video, visit the video barrage; 2) Click the barrage of the hope to report; 3) Click \"Report\"."}
{"task": "rw_83.jsonl", "id": 65536, "text": "Other complaint reports: 1), after entering Tencent video, click \"Personal Center\"; 2), click \"Help and Feedback\"; 3), click \"Enter your feedback\"; 4), enter the content of your complaint report, click on\"Submit feedback\".", "label": ["Important", "Edit/Control"], "rewrite": "Other complaint reports: 1) After entering Tencent Video, click \"Personal Center\"; 2) Click \"Help and Feedback\"; 3) Click \"Enter your feedback\"; 4) Enter the content of your complaint report, click \"Submit feedback\"Essence"}
{"task": "rw_83.jsonl", "id": 65537, "text": "7. Change", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65538, "text": "We may amend the guidelines for privacy protection in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65539, "text": "When the terms of the guidelines for privacy protection are changed, we will prompt you to prompt you the change of privacy protection guidance after the version update, and explain the effective date after the change.", "label": ["Policy Change", "Important"], "rewrite": "When the terms of the guidelines for privacy protection are changed, the version of the privacy protection guidelines will be prompted when the version is updated, and the effective date is explained."}
{"task": "rw_83.jsonl", "id": 65540, "text": "Please read the content of the privacy protection guidelines carefully, and you continue to use Tencent Video to indicate that you agree to handle your personal information according to the updated privacy protection guidance.", "label": ["Policy Change", "Important"], "rewrite": "You continue to use Tencent Video to express your personal information according to the updated privacy protection guidelines."}
{"task": "rw_83.jsonl", "id": 65541, "text": "8. Minor protection", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65542, "text": "We attach great importance to the protection of personal information of minors.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65543, "text": "In accordance with the provisions of relevant laws and regulations, we must require minors under the age of 14 to obtain the authorization consent of our guardian (such as their parents) before using Tencent Video's service or providing personal information to us;", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 14 should obtain the consent of the guardian before using services or providing personal information."}
{"task": "rw_83.jsonl", "id": 65544, "text": "Minors who have reached the age of 14, who are under eighteen, can obtain the authorization consent or self -authorization consent of their guardian in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors who have reached the age of 14, under the age of eighteen, can obtain the consent of the guardian or the consent of their own authorization in advance."}
{"task": "rw_83.jsonl", "id": 65545, "text": "We only use, provide or need to protect minors, provide or openly disclose the information in the case of laws and regulations, the guardian of minors, or the need to protect minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We only use, provide or need to protect minors, provide or openly disclose the information in the case of laws and regulations, the guardian of minors, or the need to protect minors."}
{"task": "rw_83.jsonl", "id": 65546, "text": "If you are the guardian of the minor, please pay attention to whether the minors you are guarding are used to use Tencent Video after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian of minors, please pay attention to whether the minor uses the service of Tencent Video after obtaining the authorization consent."}
{"task": "rw_83.jsonl", "id": 65547, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the contact information in Section 10.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have any questions about the personal information of the minors you monitor, please contact us through the contact information in Section 10."}
{"task": "rw_83.jsonl", "id": 65548, "text": "9. Others", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65549, "text": "Tencent's \"Privacy Policy\" is a general privacy clause for Tencent's unified application. Among them, the user rights and information security guarantee measures specified in Tencent are applicable to Tencent video users.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65550, "text": "For example, Tencent's \"Privacy Policy\" is inconsistent or contradictory with the guidance of this privacy protection, please refer to the guidelines of this privacy protection.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65551, "text": "10. Contact us", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65552, "text": "When you have other complaints, suggestions, personal information related to minors, or need to delete all access records, please pass, https://kf.qq.com/, contact us.", "label": ["Important", "Contact Information"], "rewrite": "Please contact us through https://kf.qq.com/."}
{"task": "rw_83.jsonl", "id": 65553, "text": "You can also send your question to dataprivacy@tencent.com or send it to the following address:", "label": ["Important", "Contact Information"], "rewrite": "You can also send your question to dataprivacy@tencent.com."}
{"task": "rw_83.jsonl", "id": 65554, "text": "Tencent Building, Ministry of Legal Affairs, Data and Privacy Protection Center (receipt)", "label": ["Important", "Contact Information"], "rewrite": "You can send the problem to the following address: Data and Privacy Protection Center (receipt) of Tencent Building, Tencent Building, Science and Technology of Nanshan District, Shenzhen, Guangdong Province."}
{"task": "rw_83.jsonl", "id": 65555, "text": "Postcode: 518057", "label": ["Important", "Contact Information"], "rewrite": "Postal code: 518057."}
{"task": "rw_83.jsonl", "id": 65556, "text": "We will review the issues involved as soon as possible and reply within 30 days after verifying your user identity.", "label": [], "rewrite": []}
{"task": "rw_83.jsonl", "id": 65557, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
