{"task": "rw_88.jsonl", "id": 66846, "text": "China Postal Savings Bank Electronic Bank Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66847, "text": "Dear customers: We have updated the Privacy Policy of China Postal Savings Bank Electronic Bank.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66848, "text": "The update content of this version is mainly how we collect and use your personal information content.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66849, "text": "Release date of this version: June 22, 2022", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66850, "text": "Effective date: June 22, 2022", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66851, "text": "China Postal Savings Bank Co., Ltd. (\"Own\") knows the importance of personal information to you and will try its best to protect your personal information security.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66852, "text": "We are committed to maintaining your trust in our trip, adhere to the following principles to protect your personal information: the principles of consistent power and responsibility, the principles of clear purpose, the principles of consent, the principles of necessity, the principle of safety, and the principle of openness and transparency.", "label": ["Important", "Data Security"], "rewrite": "Adhere to the following principles to protect your personal information: the principles of consistency and responsibility, the principles of clear purpose, the principle of selection consent, the principles of necessity, the principle of safety, and the principle of openness and transparency."}
{"task": "rw_88.jsonl", "id": 66853, "text": "At the same time, our bank promises to take corresponding security measures in accordance with the law to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66854, "text": "Please read and confirm the \"Privacy Policy of China Postal Savings Bank Electronic Bank\" (referred to as \"Privacy Policy\").", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66855, "text": "This \"Privacy Policy\" is a general use of general privacy clauses used by Chinese Postal Savings Bank mobile banking, personal online banking, and WeChat banking system, which is suitable for all products and services of the above electronic channels.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66856, "text": "Corresponding to specific products (or services), the purpose, method, and scope of the collection and use of your information will be explicitly stated to you through the corresponding product (or service) protocol, authorization letter, etc., and obtain your authorization or consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "The purpose, method, and scope of the collection and use of your information will be explicitly stated to you through the corresponding product (or service) protocols, authorization letters, etc., and obtain your authorization or consent."}
{"task": "rw_88.jsonl", "id": 66857, "text": "The above documents and this \"Privacy Policy\" together constitute the complete privacy policy reached between our bank and you. If the two are inconsistent, the corresponding product (or service) protocol or authorization book shall prevail.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66858, "text": "In order to better protect your personal information, it is recommended that you read and update the updated \"Privacy Policy\", which reminds you to pay attention to the content of the thickened form in this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66859, "text": "If you agree with this policy (click or \"agree\") and confirm the submission, you are deemed that you agree with this policy and agree that our bank will collect, use, store and share your relevant information in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "If you agree and confirm the submission of this policy, you will be deemed to agree to this policy and agree that our bank will collect, use, store and share your relevant information in accordance with this policy."}
{"task": "rw_88.jsonl", "id": 66860, "text": "This \"Privacy Policy\" will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66861, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66862, "text": "2. How does our trip use cookie technology", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66863, "text": "3. How does the bank store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66864, "text": "4. How our bank shares, transfers and publicly discloses your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66865, "text": "V. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66866, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66867, "text": "7. How to change this policy", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66868, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66869, "text": "1. How does our trip collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66870, "text": "Personal information is a variety of information related to the recognized or recognizable natural person recorded in electronics or other methods, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66871, "text": "Personal information includes names, date of birth, certificate number, personal biometric information, communication and communication contact information, address, account information, property status, trajectory trajectory, communication records and content, account password, credit information, accommodation information, health and physiological information, health and physiological information, Trading information, etc.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66872, "text": "Among them, once leaked, illegally provided or abuses the safety of people and property, it is easy to lead to information such as personal reputation, physical and mental health damage or discrimination treatment, etc., mainly include: biometrics, religious beliefs, specific identities, medical care, medical careInformation such as health, financial accounts, trajectory trajectory, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66873, "text": "(1) How does our trip collect your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66874, "text": "In order to provide you with and ensure that your China Postal Savings Bank Electronic Bank (referred to as \"Electronic Bank\", including mobile banking, personal online banking, WeChat banking) account security, in the process of using the electronic banking service, electronic banks will collect youActive input or information generated by using services during the service process, you may need to provide or authorize us to collect personal information required for the corresponding services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Electronic banking will collect information you actively enter or use services during the use of services."}
{"task": "rw_88.jsonl", "id": 66875, "text": "If you refuse to provide, you may not be able to use the corresponding function or service:", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide relevant use information, you may not be able to use the corresponding functions or services."}
{"task": "rw_88.jsonl", "id": 66876, "text": "Please note: If you provide personal information of others, make sure you have obtained the authorization or consent of the relevant personal information subject.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you provide personal information of others, make sure you have obtained the authorization or consent of the relevant personal information subject."}
{"task": "rw_88.jsonl", "id": 66877, "text": "1. Provide you with the personal information you actively provide in core business functions and/or services", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66878, "text": "1.1 Account Management Service", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66879, "text": "(1) When you register an electronic bank account, according to laws and regulations and regulatory requirements, we will collect your mobile phone number, ID information, bank card number, face -brushing authentication information, and verify your bank card password to help you completeElectronic bank registration.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your mobile phone number, ID information, bank card number, face -brushing authentication information, and verify your bank card password to help you complete electronic bank registration."}
{"task": "rw_88.jsonl", "id": 66880, "text": "If you are already a registered customer of China Postal Savings Bank Electronic Bank, you can use the electronic bank to register the mobile phone number/user name/certificate number/card (account) number to log in to the electronic bank directly, we will collect the login information you providedVerify check.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can use the electronic bank to register the mobile phone number/user name/certificate number/card (account) number to log in to the electronic bank directly. We will collect the login information you provide and verify the information to verify the information."}
{"task": "rw_88.jsonl", "id": 66881, "text": "If you refuse to provide this information, you may not be able to register an electronic bank account or we cannot use our services normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide login information, you may not be able to register an electronic bank account or we cannot use our services normally."}
{"task": "rw_88.jsonl", "id": 66882, "text": "(2) In order to allow you to log in to the mobile banking more secure and conveniently, if your device and our mobile banking APP version support fingerprints or facial features, you can choose to open your fingerprint or face login function, and complete it on your device to complete your deviceLogin in fingerprint or facial verification.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66883, "text": "Our bank only receives verification results and does not collect your fingerprint or face information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank only receives verification results and does not collect your fingerprint or face information."}
{"task": "rw_88.jsonl", "id": 66884, "text": "You can open or close this function through mobile banking \"My-Settings-Safety Center-Login Management-Fingerprint/Facial Login\".", "label": ["Important", "Edit/Control"], "rewrite": "You can open or close this function through mobile banking \"My-Settings-Safety Center-Login Management-Fingerprint/Facial Login\"."}
{"task": "rw_88.jsonl", "id": 66885, "text": "(3) When you log in to the mobile banking through a third party, we may obtain the avatars and nicknames that you authorize shared from third parties (WeChat, Alipay, Apple)Binding with our mobile banking APP user, you can log in to and use our bank's products or services through a third -party account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may obtain your avatar and nickname public information from third parties (WeChat, Alipay, Apple), and bind your third -party account with our mobile banking app after this policy."}
{"task": "rw_88.jsonl", "id": 66886, "text": "The binding and login process may need to verify your mobile phone number and face -brushing authentication information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66887, "text": "You can relieve the binding relationship through the mobile banking \"My-Settings-Security Center-Login Management\".", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66888, "text": "(4) When you need to retrieve the login password, we need to verify your identity information, including mobile phone numbers, names, documents, documents, card numbers, card passwords, face -brushing authentication information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66889, "text": "(5) When you use the real -name authentication service provided by the Electronic Bank, we need to provide you with your name, certificate type, document number, bank card number/account number, face -brushing authentication information, and may pass the verification account/card password and other methods.Relevant information is verified by validity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using real -name authentication services, you need to collect your name, certificate type, certificate number, bank card number/account number, and face -brushing authentication information."}
{"task": "rw_88.jsonl", "id": 66890, "text": "If you do not provide the above information, we will not be able to provide you with products or services that need to be used after real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide real -name authentication information, you will not be able to provide you with products or services that you can use after completing real -name authentication."}
{"task": "rw_88.jsonl", "id": 66891, "text": "(6) When you use the electronic bank's sound pattern authentication service, after you turn on the sound pattern authentication function, we will collect your sound pattern information after obtaining your explicit consent. The sound line information will be applied to the account protection settings.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you turn on the soundprint authentication function, we will collect your sound texture information after obtaining the consent, and the sound line information will be applied to the account protection settings."}
{"task": "rw_88.jsonl", "id": 66892, "text": "You can open or turn off this function through the mobile banking \"Mine-Settings-Security Center-Safety Certification-Sound Certification\".", "label": ["Edit/Control", "Important"], "rewrite": "You can open or turn off this function through the mobile banking \"Mine-Settings-Security Center-Safety Certification-Sound Certification\"."}
{"task": "rw_88.jsonl", "id": 66893, "text": "Certificate validity period, ID card photo (quick registration-binding the entrance of other cards to open the entrance to the entrance to open no physical media Ⅱ account), bind account account account, type and account opening agency, geographical location (if you authorize the opening of the positioningThe outlets, if the positioning is not opened, except for some of the virtual theme cards in the application area, it will not affect your use of account opening functions), IP address, and device MAC address for the processing of the business.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your name, gender, nationality, occupation, tax status, residence or work unit address, mobile phone number, certificate number, certificate validity period, ID card photo (quick registration-binding other card entrance to open no physical media ⅡClass accounts), binding account account, type and account opening agency, geographical location, IP address, and equipment MAC address for the processing of the business."}
{"task": "rw_88.jsonl", "id": 66894, "text": "In order to verify your identity, ensure your transaction security and provide convenient and high -quality services, we will collect your facial information after your explicit consent.It will make you unable to use the above features, but it does not affect other functions of your normal use of electronic banks.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank obtains the consent and collects your facial information to complete the face recognition function. If you refuse to provide the information, it will only make you unable to use the above features, but it does not affect the normal use of other functions."}
{"task": "rw_88.jsonl", "id": 66895, "text": "1.2 Transfer remittance service", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66896, "text": "(1) When you use the mobile banking and personal online banking system transfer remittance remittances, code scanning payment, postal remittance (remittance of the site, password remittance), you need to provide the payment party's mobile phone number (only mobile banking only mobile banking only mobile banking only), Name, bank card number/account number, zip code, address information, and may need to provide your name, mobile phone number, certificate type and certificate number, postcode, address, redemption password information, in order to verify the identity and use the above functions paymentServe.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the payment party's mobile phone number (only mobile banking), name, bank card number/account number, postcode, address information, and may need to collect your name, mobile phone number, certificate type and certificate number, postal code, address, redemption, payment paymentPassword information is used to verify identity and use payment services."}
{"task": "rw_88.jsonl", "id": 66897, "text": "In addition, we will collect your related receipt and payment transactions to form a book of the payee so that you can inquire and operate.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will also collect your related receipts and payment transactions to form a recipient's roster for you to inquire and operate."}
{"task": "rw_88.jsonl", "id": 66898, "text": "The implementation of the \"China Postal Savings Bank Electronic Bank Service Agreement\" agreed to sign the bank card when you add a bank card.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66899, "text": "The above information is a personal sensitive information. If you refuse to provide this information, it will only make you unable to use the above features, but it does not affect other functions of your use of electronic banks normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a payment transaction record, it will only make you unable to use the above features, but it does not affect your normal use of other functions."}
{"task": "rw_88.jsonl", "id": 66900, "text": "When you conduct payment management through the electronic banking client, we will verify your trading password for operation and other operations.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66901, "text": "You can modify your trading password through the electronic banking client \"My-Settings-Security Center-Password Management-Trading Password\".", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66902, "text": "To ensure the security of your account funds, you need to verify the original transaction password when you enter the security center to modify the transaction password.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66903, "text": "If you reset the transaction password, you need to verify your mobile phone number, document information, and face -brushing authentication information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66904, "text": "(2) When you use the mobile phone bank system mobile phone number transfer, mobile banking system phone recharge, etc., we only obtain the contact information you clicked from the address book and perform encrypted transmission to prevent malicious interception.", "label": ["Important", "First Party Collection Information"], "rewrite": "We only get the contact information you clicked from the address book and perform encrypted transmission to prevent malicious interception."}
{"task": "rw_88.jsonl", "id": 66905, "text": "The above information is personal sensitive information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66906, "text": "If you do not need to use the above features, you can not provide this information, and it will not affect other functions of your use of electronic banks normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not need to use the function involved in the address book, you do not provide the information, and it will not affect your normal use of other functions."}
{"task": "rw_88.jsonl", "id": 66907, "text": "(3) In order to allow you to use mobile banking transfer services conveniently, if your device and our mobile banking APP version support fingerprints or facial features, you can choose to turn on fingerprint or face transfer.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66908, "text": "When you perform fingerprints or face -to -face transfers, you need to complete your fingerprint or face verification on your device.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66909, "text": "Our bank only receives verification results and does not collect your fingerprint or face information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our bank only receives verification results and does not collect your fingerprint or face information."}
{"task": "rw_88.jsonl", "id": 66910, "text": "You can open or turn off this function through mobile banking \"My-Settings-Security Center-Transfer and Limited Management-Fingerprint/Facial Transfer\".", "label": ["Important", "Edit/Control"], "rewrite": "You can open or turn off this function through mobile banking \"My-Settings-Security Center-Transfer and Limited Management-Fingerprint/Facial Transfer\"."}
{"task": "rw_88.jsonl", "id": 66911, "text": "1.3 Loan Service", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66912, "text": "When you apply for loan -related services, the purpose, method, and scope of our collection and use of your information will be explicitly stated through the corresponding product (or service) agreement, authorization letter, etc., and obtain your authorization or consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "When applying for loan -related services, the purpose, method, and scope of collecting and using your information will be explicitly stated to you through the corresponding product (or service) protocols, authorization letters, etc., and obtain your authorization or consent."}
{"task": "rw_88.jsonl", "id": 66913, "text": "At the same time, you may use SMS verification code, face recognition and other means to verify your identity, and will check with the database and unit that legally retain your information under the premise of you.Makes you unable to use relevant loan services.", "label": ["Important", "First Party Collection Information"], "rewrite": "It may use SMS verification code, face recognition and other means to verify the identity, and will check with the database and unit of legal retaining your information under the premise of being authorized.Use related loan services."}
{"task": "rw_88.jsonl", "id": 66914, "text": "When you use the loan application function, our bank will collect your IP address, MAC address, device ID, device model, and operating system information for preventing fraud.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the loan application function, our bank will collect your IP address, MAC address, device ID, device model, and operating system information for preventing fraud."}
{"task": "rw_88.jsonl", "id": 66915, "text": "If you refuse to provide this information, it will not affect your use of the above features.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide loan application information, it does not affect your use of the above features."}
{"task": "rw_88.jsonl", "id": 66916, "text": "In order to provide you with an online loan intention application service, our WeChat Bank Customer Club service collection uses your personal identity information and location information, and use electronic maps to identify nearby outlets and intent to apply for the necessary review and verificationEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the use of your personal identity information and location information to use electronic maps to identify nearby outlets and intent to apply for the necessary review and verification."}
{"task": "rw_88.jsonl", "id": 66917, "text": "If you refuse to provide location information, it will not affect your use of the above features.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide location information, it will not affect your use of the above features."}
{"task": "rw_88.jsonl", "id": 66918, "text": "1.4 Life Service", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66919, "text": "When you use electronic banks to be embedded in the living service functions such as Electronic Banks, Post -Huihui, Mobile Commercial District and other living services, you need to fill in the consignee's name, the receiving address and mobile phone number information in the order page. At the same timeThe order number, the product or service information you purchased, the amount you should pay and the payment method information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the living service function, you need to fill in the consignee's name, receiving address and mobile phone number information in the order page."}
{"task": "rw_88.jsonl", "id": 66920, "text": "When you book tickets, train tickets, hotels, scenic spots, movie tickets and other businesses, you may also need to be based on national laws and regulations and regulatory requirements or service providers (including ticket sellers, hotels, travel agencies, and its authorized agents,The requirements of basic telecommunications operators, mobile resale operators, etc.) are required to provide your real -name information. These real -name information may include your identity information (such as your ID card, military officer certificate, passport, driver's license, etc.Copy or number), your own photos or videos, names, phone numbers.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to provide your real -name information in accordance with national laws and regulations, regulatory requirements, or service provider requirements."}
{"task": "rw_88.jsonl", "id": 66921, "text": "These orders may include your itinerary and hotel address information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66922, "text": "All the above information constitutes your order information. We will use your order information to perform your identity verification, determine transactions, payment settlement, complete distribution, query orders for you, and provide customer service consultation and after -sales service;", "label": ["Important", "Usage"], "rewrite": "We will use your order information for identity testing, determining transactions, payment settlement, completing delivery, querying orders for you, and providing customer service consultation and after -sales service."}
{"task": "rw_88.jsonl", "id": 66923, "text": "We will also use your order information to determine whether your transaction is abnormal to protect your transaction security.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66924, "text": "After placing an order, you can choose to use the postal savings card or pay for other cards.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66925, "text": "After you place an order and choose to pay or complete the payment online, the fast fresh shopping mall, postal Hui merchant, mobile business district and third -party distribution companies will complete the order of orders for you.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66926, "text": "You agree here that you can use your order information to use your order information to provide you with goods or services.", "label": ["Important", "Usage"], "rewrite": "Speed Fresh Mall, Postal Merchant, third -party distribution companies, and after -sales service can use your order information to provide you with goods or services."}
{"task": "rw_88.jsonl", "id": 66927, "text": "1.5 Digital RMB service", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66928, "text": "(1) When you use digital RMB services, to meet the control requirements of the People's Bank of China for the pilot area of digital RMB, our mobile banking and WeChat banks need to collect your geographical location information when you report your personal wallet white list information.To judge whether you belong to the pilot area, if you belong to the pilot area, you can submit the application for the whitening information. If you are not a pilot area, you cannot submit the white list information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use digital RMB services, our mobile banking and WeChat banks need to collect your geographical location information when you report your personal wallet white list information to determine whether you belong to the pilot area."}
{"task": "rw_88.jsonl", "id": 66929, "text": "(2) When you use your personal wallet service, in order to ensure that personal wallet transactions are handled for you, our mobile banking ATM QR code wallet recharge/withdrawal, digital RMB brush transaction signing/cancellation, digital RMB personal wallet module password heavy passwords heavy passwordSet (real-name wallet), wallet cancellation, four types of wallet upgrades to two types of wallets, sweeping, receiving payment, transfer money-mass transfer service collection and use of your face, personal ID and other information, for verification and verificationYour identity information authenticity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using a personal wallet service, you will collect information such as your face, personal identity documents, etc. to verify and verify your authenticity of your identity information."}
{"task": "rw_88.jsonl", "id": 66930, "text": "(3) When you use the packet digital wallet service, in order to confirm the willingness to open the public wallet, our mobile banking bank is opened to the public digital wallet trailer wallet.Information is used to verify your identity and willingness.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the packet digital wallet service, collect the information of your face, voice, identity documents, and unit certification document information to verify your identity and willingness."}
{"task": "rw_88.jsonl", "id": 66931, "text": "(4) When you use digital renminbi collection products, in order to meet the requirements of the merchant due diligence, our mobile bank will pay the merchant version, online registered merchants and open up digital RMB collection products services. Your location, peopleFace information, which is used to record the location of the merchant. When signing a contract with the currency receipt agreement, the living test is performed, and the face photos are used as the CFCA evidence chain;", "label": ["Important", "First Party Collection Information"], "rewrite": "When using digital RMB collection products, collect your location and face information to record the business location of the merchant."}
{"task": "rw_88.jsonl", "id": 66932, "text": "The existing merchants quickly open the collection and use of digital RMB collection products. Your face information is used for biopotic detection when the currency receipt agreement is signed, and the face photos during the test are used as the CFCA evidence chain.", "label": ["Important", "First Party Collection Information"], "rewrite": "Existing merchants quickly open digital RMB collection products will collect the use of your face information to perform biopotic testing when the currency collection agreement is signed."}
{"task": "rw_88.jsonl", "id": 66933, "text": "1.6 Other services", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66934, "text": "(1) When you use the electronic bank message service, we will collect your account information and transaction information in order to send you account funding changes and related transaction notifications in time;", "label": ["Important", "First Party Collection Information"], "rewrite": "When using electronic banking messages, you will collect your account information and transaction information in order to send you the change of account funds and related transaction notifications to you in time."}
{"task": "rw_88.jsonl", "id": 66935, "text": "We may also collect information from our partners and can share it with the authorized by your authorization to provide you with the corresponding message notifications and other services.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also collect information from our partners and authorize their legal retention and authorize to share use in order to provide you with services such as corresponding message notifications."}
{"task": "rw_88.jsonl", "id": 66936, "text": "(2) When you use the search service provided by electronic banks, we will collect your search keyword information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the search service provided by electronic banks, we will collect your search keyword information."}
{"task": "rw_88.jsonl", "id": 66937, "text": "When searching for keyword information cannot identify your personal identity alone, this information does not belong to your personal information, we can use other purposes;", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66938, "text": "When searching keyword information with your other information can identify your personal identity, we will use your search keyword information as your personal information during the combination period, and protect it.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66939, "text": "(3) When you use the geographical location -based function of life, we will collect your location information, the purpose is to provide you with the corresponding service at your location.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use geographical location -based functions, we will collect your location information."}
{"task": "rw_88.jsonl", "id": 66940, "text": "If you refuse to provide this information, it will not affect your use of the above features.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide geographical information, it will not affect your use of the above functions."}
{"task": "rw_88.jsonl", "id": 66941, "text": "(4) When you use the electronic bank SMS service, our bank will collect your account information and transaction information in order to send you account funding changes and related notices in time;", "label": ["Important", "First Party Collection Information"], "rewrite": "When using electronic banking SMS services, our bank will collect your account information and transaction information in order to send you account funding changes and related notifications to you in time."}
{"task": "rw_88.jsonl", "id": 66942, "text": "Our bank may provide your account information and transaction information to our partner after you consent, so that you can send you account fund changes and related notifications to you in time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our will provide your account information and transaction information to your partners after you explicitly consent, so as to send you account fund changes and related notifications to you in time."}
{"task": "rw_88.jsonl", "id": 66943, "text": "If you choose a mobile phone SMS dynamic password as a security certification tool, our bank will send a mobile phone number dynamic password to your signing mobile phone number for electronic bank transaction verification.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66944, "text": "(5) When you use the commemorative currency reservation function, our bank will collect your name, ID number, and mobile phone number for regulatory agency appointment information to verify and send you a verification results text message.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the commemorative currency reservation function, our bank will collect your name, ID number, and mobile phone number for regulatory agency appointment information verification and sending a verification results text message."}
{"task": "rw_88.jsonl", "id": 66945, "text": "(6) When you use the cash business appointment function, our bank will collect your name, ID number, mobile phone number, and appointment account account for staff to verify the appointment information to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the cash business appointment function, our bank will collect your name, ID number, mobile phone number, and appointment account account for staff to verify the appointment information to you."}
{"task": "rw_88.jsonl", "id": 66946, "text": "(7) When you use the authentication query function, our bank will collect your deposit/passbook printing number, account opening/transaction date, flowing water number, and seal verification code for the electronic seal inspection on the document.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the verification and query function, our bank will collect your deposit/passbook printing number, account opening/transaction date, flowing water number, and seal verification code for electronic seal inspection on the document."}
{"task": "rw_88.jsonl", "id": 66947, "text": "2. Provide you in product and/or services in the product and/or service we take the initiative to collect and use", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66948, "text": "In order to meet the basic requirements of laws and regulations and provide services, to ensure your account security and system operation security, and to prevent telecommunications network fraud more accurately, we may collect the relevant information that you generate in the process of using our service to judge your accountRisk, guarantee us to provide services for you normally, analyze, statistical traffic of our travel system problems, and check it when you choose to send abnormal information to us.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect the relevant information you generated during our service to judge your account risk."}
{"task": "rw_88.jsonl", "id": 66949, "text": "This information includes:", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66950, "text": "2.1 log information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66951, "text": "When you use the products and/or services we provide, we will automatically collect the details of your service using our service, and save it as a network log and transaction flow log. The network log includes the language you use, the date and time of access, and time, and time, and time, and time, and time, and time, and time, and time, and time, and time, the access of access toYou request the webpage record, operating system, software information, equipment MAC address information, login IP information;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the products and/or services we provide, we will automatically collect your details and save it as a network log and transaction flow log."}
{"task": "rw_88.jsonl", "id": 66952, "text": "Trading flow logs include transaction amount, transaction date, transaction time, trading currency, trading card number, trading type, transaction terminal, transaction results, document information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Trading flow logs include transaction amount, transaction date, transaction time, trading currency, trading card number, trading type, transaction terminal, transaction results, document information."}
{"task": "rw_88.jsonl", "id": 66953, "text": "2.2 Equipment information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66954, "text": "When you use our product and/or service process, we may receive and record your relevant equipment information, device models, device MAC addresses, IP addresses, operating systems, operating systems, operating systems, operating systems, operating systems, operating systems in software installation and use.International mobile device recognition code (IMEI).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may receive and record your relevant device information based on your specific permissions in software installation and use. Device models, device MAC addresses, IP addresses, operating systems, international mobile device recognition codes (IMEI)."}
{"task": "rw_88.jsonl", "id": 66955, "text": "2.3 Search Record", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66956, "text": "When you use our site search service, we will collect your search records so that you do n’t need to enter again when you find it in the future.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the search service in the station, we will collect your search record so that you do n’t need to enter again when you find it in the future."}
{"task": "rw_88.jsonl", "id": 66957, "text": "You can delete the aforementioned search records.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66958, "text": "2.4 Location Information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66959, "text": "When you use our product and/or service process, we will use the requirements of relevant laws and regulations or to recommend a convenient service outlet to facilitate your useSpecific permissions in use, collect your location information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your location information based on your specific permissions in software installation and use."}
{"task": "rw_88.jsonl", "id": 66960, "text": "3. When you use the services provided by our App APP, in some specific scenarios, we may provide you with a software service toolkit of a third -party service provider with corresponding business qualifications and capabilities, Collect your necessary information from third -party service providers. The specific purpose, method, and scope of the purpose of personal information involving the use of SDKs involved in the use of personal information is as follows:", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your necessary information from third -party service providers. The specific purpose, method, and scope of the purpose of personal information is as follows:"}
{"task": "rw_88.jsonl", "id": 66961, "text": "(1) Face recognition SDK.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66962, "text": "In order to provide you with face recognition service, we use face recognition SDK. This SDK is provided by Beijing Eye Smart Technology Co., Ltd. When you use face recognition to perform equipment binding, digital RMB and other functions, the app calls face recognition for face recognitionSDK, conduct live test recognition, collect face pictures, and verify the user identity by verifying it by networking.", "label": ["Important", "First Party Collection Information"], "rewrite": "APP calls the face recognition SDK, performs live detection and identification, collects face pictures, and verifies the user identity by verifying it by networking."}
{"task": "rw_88.jsonl", "id": 66963, "text": "(2) OCR (optical character recognition) SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66964, "text": "In order to provide you with image character recognition services, we use OCR (optical character recognition) SDK. This SDK is provided by Hanwang Technology Co., Ltd. You need to collect your ID card, bank card, and driving license information.Information reading information content.", "label": ["Important", "First Party Collection Information"], "rewrite": "OCR (optical character recognition) SDK needs to collect your ID card, bank card, driving license information, read the information content of the document information through OCR, app recognition document information."}
{"task": "rw_88.jsonl", "id": 66965, "text": "(3) WeChat SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66966, "text": "In order to provide you with mobile banking login, transfer, and screenshot sharing service, we use WeChat SDK. This SDK is provided by Tencent. You need to collect your nickname and avatar information. Log in to obtain personal information and license login through WeChat.,Link.", "label": ["Important", "First Party Collection Information"], "rewrite": "WeChat SDK needs to collect your nicknames and avatar information, log in to obtain personal information and license login through WeChat, and share pictures and links through WeChat."}
{"task": "rw_88.jsonl", "id": 66967, "text": "(4) Xiaomi push SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66968, "text": "In order to provide you with a mobile account, system, and marketing message push service, we used Xiaomi to push SDK, APP call message push SDK to generate token push label.Android, ID, device manufacturer, equipment model, equipment memory, operating system version, Xiaomi push SDK version, device belonging (country or region), SIM card operator name, network type, mobile phone vibration, notification bar set information, collect messages, collect messagesCreate, deliver and click time, and use application information such as application package names, version numbers and operating status.", "label": ["Important", "First Party Collection Information"], "rewrite": "Mobile phone vibration, notification bar setting information, collecting message creation, delivery and click time, and application information using push services such as application package name, version number and operating status."}
{"task": "rw_88.jsonl", "id": 66969, "text": "(5) Huawei push SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66970, "text": "In order to provide you with a mobile account, system, and marketing message push service, we use Huawei push SDK, APP call message push SDK to generate token push label. This SDK is provided by Huawei Terminal Co., Ltd. and its affiliated company. You need to collect your mobile phoneTerminal unique logo information (IMEI number), running program.", "label": ["Important", "First Party Collection Information"], "rewrite": "Huawei pushes SDK to collect the unique logo information (IMEI number) of your mobile terminal and is running the program."}
{"task": "rw_88.jsonl", "id": 66971, "text": "(6) UnionPay cloud flash payment SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66972, "text": "In order to provide you with mobile business district payment and post -benefit payment services, we used UnionPay Cloud Flash Pay SDK, APP, and back -end calls UnionPay Cloud Flash Payment to complete the payment. This SDK is provided by China UnionPay Co., Ltd.information.", "label": ["Important", "First Party Collection Information"], "rewrite": "UnionPay Cloud Flash Pay SDK does not get your personal information."}
{"task": "rw_88.jsonl", "id": 66973, "text": "(7) Baidu map positioning SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66974, "text": "In order to provide you with a lifestyle positioning, living payment positioning, gray release, and open screen advertisement according to the geographical display function positioning service, we use Baidu map positioning SDK.Lepatinity information, MAC information, through Baidu map positioning, APP obtain user location information and equipment information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Baidu map positioning SDK needs to collect your latitude and longitude information, MAC information, and use Baidu map positioning to obtain user location information and equipment information."}
{"task": "rw_88.jsonl", "id": 66975, "text": "(8) Equipment fingerprint SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66976, "text": "In order to provide you with payment equipment safety testing and transaction fraud identification services, we use the equipment fingerprint SDK. This SDK is provided by Beijing Yideo Business Service Co., Ltd. You need to collect your system version, mobile phone model, and mobile phone number information. Through the device, through the deviceFingerprints, app calls monitoring whether the user pays the equipment is safe to prevent the risk of trading fraud.", "label": ["Important", "First Party Collection Information"], "rewrite": "Device fingerprint SDK needs to collect your system version, mobile phone model, and mobile phone number information."}
{"task": "rw_88.jsonl", "id": 66977, "text": "(9) UnionPay traffic travel SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66978, "text": "In order to provide you with transportation cost payment services, we have used UnionPay transportation SDK. This SDK is provided by China UnionPay Co., Ltd. You need to collect your user ID, city, latitude and longitude, travel through UnionPay transportation, APP calls for traffic travel scene multiplicationCar code generation.", "label": ["Important", "First Party Collection Information"], "rewrite": "UnionPay transportation SDK needs to collect your user ID, city, latitude and longitude."}
{"task": "rw_88.jsonl", "id": 66979, "text": "(10) Recording SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66980, "text": "In order to provide you with voice -to -line recognition voice recording service, we use the recording SDK. The SDK is provided by Beijing Lingyou Tech Technology Co., Ltd. You need to collect your voice data. By calling API for voice recording, saving to local and extractionUpload.", "label": ["Important", "First Party Collection Information"], "rewrite": "The recording SDK needs to collect your voice data, call the API for voice recording, save it to the local area, and extract and upload it."}
{"task": "rw_88.jsonl", "id": 66981, "text": "(11) Video signed SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66982, "text": "In order to provide you with an online loan contract signing service, we use a video signing SDK. This SDK is provided by Yigu Network Technology Co., Ltd. You need to collect your name, ID number, and mobile phone number.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "The video signing SDK needs to collect your name, ID number, and mobile phone number, and sign a contract contract on your mobile phone through video chat."}
{"task": "rw_88.jsonl", "id": 66983, "text": "(12) God's strategy SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66984, "text": "In order to provide you with better service, we have used Shence's online behavior to collect SDK. This SDK is provided by Shence Network Technology (Beijing) Co., Ltd. to collect users, ID, time, application version, whether to visit on the first day, or on the first day of visits, and on the first day of access,Page address, reptile name, latitude, longitude, service terminal time, operating system, operating system version, screen height, whether WiFi, operator, network type, device ID (including IMEI, MAC address device unique identification codeAhead domain name, front -directional address, element ID, element content, element name, element style name, element type, element selection device, element link address, width of the viewing area, the position of the viewing area distance, the height of the view area, the long stay period, the long stay, the long stay, the long stay, the long stay, the long stay, the long stay, the long stay, the long stay, the long stay, the long stay, the length of the stay, the time of stayingWhether to wake up from the background, page name, element location, browser name, first visit time, first forward address address, first forward domain name, the first browser language used, the first browser character type, analyze user characteristics and functions through this SDKEvaluate to perform APP function optimization, product optimization and personalized recommendations to enhance user experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "The SDK online behavior is collected, and the user ID, time, application version, whether the first day of visits, page address, reptile name, latitude, longitude, server -side time, operating system, operating system version, screen, screen, screen, screen, screen, screenSDK version, IP, country, city, province, whether the first, page title, page address, page path, front -directional domain name, front -directional address, element content, element name, element style name, element type, element selectioner, Elemental link address, width of the viewing area, location at the top of the viewing area, height of the view area, staying time, whether to wake up from the background, page name, element location, browser name, first visit time, first forward address, first forward forward directionDomain name, the first browser language used, and the first browser character type."}
{"task": "rw_88.jsonl", "id": 66985, "text": "(13) HKUST Xunfei voice intelligent SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66986, "text": "In order to provide you with voice search, voice transfer, and digital RMB services, we use the voice intelligent SDK. This SDK is provided by HKUST Xunfei Co., Ltd. You need to collect your voice information to verify that you can open the public digital wallet processingWill.", "label": ["Important", "First Party Collection Information"], "rewrite": "Voice intelligent SDK needs to collect your voice information to verify your willingness to open a public digital wallet."}
{"task": "rw_88.jsonl", "id": 66987, "text": "(14) Alipay SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66988, "text": "In order to provide you with the Alipay account login mobile banking app service, we use Alipay SDK. The SDK is provided by Act Technology Group Co., Ltd. to obtain the nickname and avatar information of your authorized sharing through Alipay SDK for joint login.", "label": ["Important", "First Party Collection Information"], "rewrite": "Alipay SDK obtains the nickname and avatar information you authorized shared for joint login."}
{"task": "rw_88.jsonl", "id": 66989, "text": "(15) Tencent TBS SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66990, "text": "In order to provide you with fund product information summary, we use the PDF reader. The reader is provided by Tencent and obtains your device ID (including IMEI, IMSI, MAC address device unique identification code) through the PDF reader, so that the Android versionSummary of fund product information directly in the mobile bank app.", "label": ["Important", "First Party Collection Information"], "rewrite": "Get your device ID (including IMEI, IMSI, MAC address device unique identification code) through the PDF reader."}
{"task": "rw_88.jsonl", "id": 66991, "text": "(16) Video SDK.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 66992, "text": "In order to provide you with a video seat service, we use the video SDK. This SDK is provided by Yigu Network Technology Co., Ltd. You need to collect your customer number, customer type, customer level, operating system, mobile phone number, mobile phone model, mobile banking version versionThe current access menu information to better provide you with consultation, business processing services, and call screen recording.", "label": ["Important", "First Party Collection Information"], "rewrite": "Video SDK needs to collect your customer number, customer type, customer level, operating system, mobile phone number, mobile phone model, mobile banking version, current access menu information."}
{"task": "rw_88.jsonl", "id": 66993, "text": "4. When you use our travel app service, in order to maintain the safe and stable operation of the service and reduce the risk of transaction and capital, our guild collects the following information, including your device model, operating system, unique device logo, postal savings bank app app, postal banking bank APPSoftware version number, IP address, access to the network, type and status, network quality data, information related to the postal savings bank APP operation log and service log, geographical location information, application list information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Our guild collects the following information, including your device model, operating system, unique device identifier, postal -reserve bank APP software version number, IP address, method, type and status of access to the networkAPP operation logs and service logs related information, geographical location information, and application list information."}
{"task": "rw_88.jsonl", "id": 66994, "text": "If you disagree with our bank to collect the aforementioned information, it may not be able to complete the risk control verification, and it will not be able to apply for functions or services that can be used after risk control verification, but it does not affect other functions or services of your travel app normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you disagree with our bank to collect the aforementioned information, it may not be able to complete the risk control verification, but it does not affect the other functions or services of your travel app normally."}
{"task": "rw_88.jsonl", "id": 66995, "text": "In order to prevent fishing websites, fraud and Trojan viruses more accurately, we may judge risks by understanding some of your network usage habits and software information you often use, and may record some URLs, APPs or softwares that we think are risky.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We may judge risks by understanding some of your network usage habits and your commonly used software information, and may record some URLs, APPs or softwares that we think are risky."}
{"task": "rw_88.jsonl", "id": 66996, "text": "You can turn off your mobile phone positioning service so that we will stop the collection of your location information. This will not affect your payment, but it may affect our judgment of whether it is safe.", "label": ["Important", "First Party Collection Information"], "rewrite": "Closing the mobile phone positioning service will stop the collection of your location information. This will not affect the payment, but it may affect the effect of determining whether it is safe."}
{"task": "rw_88.jsonl", "id": 66997, "text": "5. In order to provide you with more accurate, personality and convenient services, improve service experience, improve service quality, or prevent risks, we will collect you, feedback suggestions or information provided during reports, collect you, participate in the questionnaire surveyThe information feedback from us, collect you, use the types, methods and operation information of the function or service of the electronic banking, and your personal information on our travel, we will statistics and analysis of this information, and will be based on the above, and will be based on the above.The information provides you with the corresponding service or product. If you do not want to receive the service information pushed by the mobile bank app, you can refuse to accept the message notification when installing the APP for the first time, or the \"notification\" center in the mobile operating system offses the corresponding corresponding to the corresponding correspondenceNotification function.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will collect information provided by your feedback suggestions or reports, collect information that you feedback to us when participating in the questionnaire survey, collect your category, methods, and operating information of your electronic banking function or service, and your personal information on our travelEssence"}
{"task": "rw_88.jsonl", "id": 66998, "text": "6. When you use the services provided by third parties in electronic banking, third parties may obtain your nickname, avatar open information, and unique identification information for joint login through electronic banks.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third parties may obtain your nickname, avatar open information, and unique identification information for joint login through electronic banks."}
{"task": "rw_88.jsonl", "id": 66999, "text": "If you have explicitly agreed that the third party can obtain your geographical location information, we will award the third party to obtain the terminal geographical location information interface, which can obtain your specific location information through this interface;", "label": ["Important", "First Party Collection Information"], "rewrite": "If you have explicitly agreed, we will award a third party to obtain the terminal geographical location information interface, which can obtain your specific location information through this interface."}
{"task": "rw_88.jsonl", "id": 67000, "text": "After your explicit consent, the third party can get your mobile phone number information;", "label": ["Important", "First Party Collection Information"], "rewrite": "After your explicit consent, the third party can get your mobile phone number information."}
{"task": "rw_88.jsonl", "id": 67001, "text": "For the relevant information provided by your service when using the service provided by a third party, we will be regarded as you allow the third party to obtain the above -mentioned information;", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67002, "text": "For the information that you generate when using the third -party service, you and the third party should agree on the collection and use of the above information according to law.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67003, "text": "If you refuse to collect, use or pass the above information when providing services, it may cause you to be unable to use the corresponding service of third parties in electronic banks, but this does not affect other functions of your use of electronic banks.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to collect, use, or pass the above information when providing services, it may lead to the inability to use the corresponding service of the third party, but this will not affect your use of other functions."}
{"task": "rw_88.jsonl", "id": 67004, "text": "7. In the following circumstances, you can choose whether to authorize us to collect and use your personal information:", "label": ["Important", "First Party Collection Information"], "rewrite": "In the following circumstances, you can choose whether to authorize us to collect and use your personal information:"}
{"task": "rw_88.jsonl", "id": 67005, "text": "(1) Function based on camera (camera): You can use services such as code scanning, bank card recognition, ID card recognition, face -brushing authentication, online customer service, remote customer service manager, digital RMB and other services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose whether to grant the right of the camera."}
{"task": "rw_88.jsonl", "id": 67006, "text": "(2) Function based on album (picture library): You can use the avatar upload of mobile banking and personal online banking systems, electronic repayment, two -dimensional code scanning, bank card and ID card recognition, online customer service, remote customer service manager, etc.Serve.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose whether to grant the album (picture library) permissions."}
{"task": "rw_88.jsonl", "id": 67007, "text": "(3) Function based on geographical location: You can turn on the positioning service, improve the inquiry nearby outlets, obtain preferential merchant information, life pages, life payment, grayscale release, screen ads displayed according to geographical display, digital RMB, loan application function location information information information information information informationAccuracy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67008, "text": "(4) Functions based on microphone and control media volume: You can use services such as mobile banking verification, voice search, digital RMB.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67009, "text": "(5) Touch ID/FACE ID: You can use mobile banking to log in, pay and other services.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67010, "text": "(6) Function based on calendar: You can use mobile banking financial calendar and other services.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67011, "text": "(7) Function based on address book: You can use mobile phone number transfer, recharge, remittance SMS notification, transfer notification of transfer notifications.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67012, "text": "(8) Function based on call records: You can use loan applications and other services through call records.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67013, "text": "(9) Function based on QR code: You can use public transportation and other services by ride a QR code.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67014, "text": "(10) Telephone -based function: You can use dialing customer service calls and other services.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67015, "text": "(11) SMS -based function: You can use SMS verification code backfill and other services.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67016, "text": "(12) Function based on NFC: You can use POS transfer and other services.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67017, "text": "(13) Functions based on device recognition codes and status, Bluetooth: It is used to ensure the security of your transactions during login and payment.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67018, "text": "(14) Function based on storage space: Use graphic information generated during the use of electronic banks.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67019, "text": "(15) Function based on the shear plate: It is used to identify the bank account in the shear plate and provide the quick jump function of the transfer. The background of our system will not save your shear plate content.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67020, "text": "(16) Function based on reading application list: It is used to ensure your transaction security during the loan service process.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67021, "text": "(17) Function based on the control of the vibrator: For the vibration feedback of the prompt information part of the big character version of the mobile phone bank.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67022, "text": "(18) Function based on device information: used for mobile banking equipment binding functions to ensure your mobile banking use security;", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67023, "text": "Used to ensure your transaction security in the process of loan.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67024, "text": "During the use of the corresponding electronic banking system, the above functions may require you to turn on your device, camera (camera), album (picture library), geographical location (location information), microphone, face, ID, calendar, calendar, calendar, Calculation, call records, two -dimensional codes, telephones, SMS, NFC, device recognition code and status, storage space, Bluetooth, shear plate, read application list, control vibrator, equipment information, access permissions, to achieve realizationThe information involved in these functions, collection and use.", "label": ["Permission Acquisition", "Important"], "rewrite": "The above features may need to open your camera (camera), album (picture library), geographical location (location information), microphone, FACE ID, calendar, address book, call records, two -dimensional code, two -dimensional code, two -dimensional code, call records, call records, address book information)Telephone, SMS, NFC, device recognition code and status, storage space, Bluetooth, shear plates, read application lists, control vibrator, equipment information access permissions to achieve the collection and use of information involved in these functions."}
{"task": "rw_88.jsonl", "id": 67025, "text": "Please note that when you open these permissions, you can authorize us to collect and use this information to implement the above functions. If you cancel these authorization, we will no longer continue to collect and use your information, and we cannot provide you withThe above -mentioned functions corresponding to these authorization, but this does not affect other functions or services of your normal use of mobile banking apps.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You open these permissions represent that you authorize us to collect and use this information to implement the above functions. If you cancel the authorization, you will no longer continue to collect and use this information, and you cannot provide you with the corresponding features, but this does not affect the normal use of other functions.Or service."}
{"task": "rw_88.jsonl", "id": 67026, "text": "8. Others", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67027, "text": "If you collect or use your personal information outside the above situation, we will fully explain to you the purpose, use, content, and scope of the collection and use of your relevant information, and obtain your consent or authorization in advance.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting or using your personal information outside the above situation will fully explain to you the purpose, use, content, and scope of using your relevant information, and obtain your consent or authorization in advance."}
{"task": "rw_88.jsonl", "id": 67028, "text": "Please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned and collected your information, we will use page prompts, interactive processes, website announcements, etc.Explain the content, scope and purpose of information collection to you, and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service is not collected in the aforementioned instructions and the information is collected, we will explain the content, scope and purpose of the information collection to you, and obtain consent."}
{"task": "rw_88.jsonl", "id": 67029, "text": "(2) How do I use your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67030, "text": "In order to abide by national laws and regulations and regulatory requirements, and provide you with services and improve service quality, or to ensure your accounts and funds, our guild uses your information in the following circumstances:", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67031, "text": "1. Our bank will use your personal information to realize your personal information in accordance with the agreement of this policy.", "label": ["Important", "Usage"], "rewrite": "Our bank will use your personal information to be collected in accordance with the agreement of this policy and realize the service or function of our bank."}
{"task": "rw_88.jsonl", "id": 67032, "text": "2. After obtaining your consent, use your information for our other services or marketing promotion, such as recommending the products or services you may be interested in, if you don’t want to receive the message notification on the mobile banking app pageYou can refuse to accept message notifications when installing the APP for the first time, or turn off the corresponding notification function in the \"Notice\" center in the mobile operating system.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "After obtaining your consent, use your information for our other services or marketing promotion. If you do not want to receive a message notification, you can refuse to accept the message notification when installing the APP for the first time, or the \"notice in the mobile terminal operating system\"The center off the corresponding notification function."}
{"task": "rw_88.jsonl", "id": 67033, "text": "We will send you a marketing event SMS. If you do not want to receive such information, you can choose to take a copy according to the method prompted by our bank.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67034, "text": "3. In order to ensure the security of service, we will use your information for authentication, security prevention, fraud monitoring, prevention or prohibition of illegal activities, reducing risks, archiving and backup purposes.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67035, "text": "To help us better understand the operation of electronic banks, we may record the relevant information of the operation of electronic banks, such as the frequency, collapse data, overall usage situation, and performance data of you using electronic banks.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67036, "text": "We will not combine the information stored in the analysis software with any personal identity information you entered in the electronic bank.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67037, "text": "4. Report to relevant departments in accordance with laws and regulations or regulatory requirements.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67038, "text": "5. Invite you to participate in customer surveys related to our services, products or functions.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67039, "text": "In order to provide you with better services, our bank may use your financial information for customer experience, service quality improvement or market research.", "label": ["Important", "Usage"], "rewrite": "Our bank may use your financial information for customer experience, service quality improvement or market survey."}
{"task": "rw_88.jsonl", "id": 67040, "text": "For example, you will send products and services, customer experience, service quality improvement and market research through telephone, SMS, email, WeChat, mobile banking APP, personal online banking, corporate online banking, or other instant messaging tools.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67041, "text": "Whether you agree with the above authorization, it will not affect other functions or services of your normal use of electronic banks.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67042, "text": "After you agree to authorize, if you need to change the authorization, you can call the 95580 service hotline or adjust or unsubsess the binding through other methods specified in our bank.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "After agreed to authorize, if you need to change the authorization, you can call the 95580 service hotline or adjust or unsubscribe through other methods specified in our bank."}
{"task": "rw_88.jsonl", "id": 67043, "text": "6. When we want to use your personal information for other purposes beyond the collection purpose, purpose or reasonable related scope specified in this policy, we will ask for your consent again before using it.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using your personal information to other purposes other than the scope of reason, your consent will be obtained again before use."}
{"task": "rw_88.jsonl", "id": 67044, "text": "7. After collecting your personal information, after our bank anonymizes your information and data through technical means, the anonymized information will not be able to identify the information subject and has the right to use it directly without your consent , has the right to analyze the user database and make commercial use of it.", "label": ["Important", "Usage"], "rewrite": "After collecting your personal information, our bank has the right to directly use information and data through technical means, and has the right to directly use it without consent. It has the right to analyze and commercialize the user database."}
{"task": "rw_88.jsonl", "id": 67045, "text": "8. Our travel will count the service or functional usage of our travel, and may share these statistical information with the public or third -party to show the overall trend of our travel services or functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our travel will statistics on services or functional usage, and may share these statistics with the public or third -party to show the overall trend of service or functions of our bank."}
{"task": "rw_88.jsonl", "id": 67046, "text": "But these statistical information does not include any identity information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67047, "text": "9. When the identity verification is required due to regulatory requirements, business rules, and risk control requirements, our bank will apply your face recognition in the portrait of your identity document in the regulatory agency.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67048, "text": "If you disagree with the aforementioned information of our bank, you may not be able to complete the related business that requires face recognition to strengthen authentication, but it does not affect other services provided by your bank.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67049, "text": "10. In order to verify the accuracy and integrity of information that provides information in the account of non -physical media Ⅱ/Ⅲ account account opening business, our guild will verify the state agencies, financial institutions, and enterprises that legally retain your information;", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67050, "text": "If our bank needs to collect your information to the verification agency in the process of verification and verification, our bank will explain the source of personal information in accordance with laws and regulations or regulatory regulations, and confirm the legitimacy of its personal information source.", "label": ["Important", "First Party Collection Information"], "rewrite": "During the verification check process, our bank needs to collect your information to the verification agency forward. Our guilty requires relevant verification agencies to explain its personal information sources and confirm the legitimacy of its personal information source."}
{"task": "rw_88.jsonl", "id": 67051, "text": "11. In order to provide you with a better use experience, our bank may use your identity information, transaction information, and browsing information. After identifying it, you can extract your preferences and show you a personalized personality.Products or advertisements.", "label": ["Important", "Usage"], "rewrite": "Our travel may be based on your identity information, transaction information, and browsing information. After identifying processing, you can extract your preference features and display personalized products or advertisements based on feature tags."}
{"task": "rw_88.jsonl", "id": 67052, "text": "You can close the \"personalized display\" through the mobile banking \"My-Settings\". After closing, the personalized content will be replaced with a non-customized default content.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67053, "text": "After the \"Personalized Display\" is closed, you can still open it again through the above path.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67054, "text": "12. In order to provide you with better securities account opening services, our bank will use your bank customer number and your account opening information at the securities company to verify whether it is successful.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67055, "text": "(3) Exceptions of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67056, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, we may collect or use your relevant personal information without soliciting your authorization consent, but you clearly refuse or handle the information to infringe your major interests:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, we may collect and use your relevant personal information without soliciting your authorization consent, but you clearly refuse or handle the information to infringe your major interests:"}
{"task": "rw_88.jsonl", "id": 67057, "text": "1. It is necessary for the contract to establish and fulfill the person as a party as a party;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting, using, and fulfilling personal information necessary for the contract does not need to solicit consent."}
{"task": "rw_88.jsonl", "id": 67058, "text": "2. To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and use as a personal information for fulfilling statutory duties or necessary for the statutory obligations does not need to solicit consent."}
{"task": "rw_88.jsonl", "id": 67059, "text": "3. In order to deal with emergencies, or in urgent situations to protect your life, health and property security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and use is a personal information that should be required to respond to public health incidents, or to protect life and health and property security."}
{"task": "rw_88.jsonl", "id": 67060, "text": "4. Implement news reports and public opinion supervision in public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting consent."}
{"task": "rw_88.jsonl", "id": 67061, "text": "5. In accordance with the \"Personal Information Protection Law\", deal with personal information that individuals are disclosed or other legally disclosed within a reasonable scope;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Treatment of public information within a reasonable range does not need to ask for consent."}
{"task": "rw_88.jsonl", "id": 67062, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and using personal information under other circumstances stipulated in laws and administrative regulations without asking for consent."}
{"task": "rw_88.jsonl", "id": 67063, "text": "2. How does our bank use cookies and equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67064, "text": "(1) Cookies", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67065, "text": "In order to ensure the normal operation of electronic banking, we will store a small data file named Cookie on your computer or mobile device. computer, mobile phone, or other device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Small data files called cookies are stored on your computer or mobile device."}
{"task": "rw_88.jsonl", "id": 67066, "text": "Cookies usually contain identifiers, site names and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67067, "text": "We judge whether you successfully log in through the encrypted cookie information to improve service quality and customer experience.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67068, "text": "We will not use Cookie for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67069, "text": "If you do not want information to be stored in cookies, you can manage or delete cookies according to your preferences.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_88.jsonl", "id": 67070, "text": "You can remove everything stored on the computer, Cookie, and most of the network browsers have the function of preventing cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can clear all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies."}
{"task": "rw_88.jsonl", "id": 67071, "text": "(2) Do Not Track (do not track)", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67072, "text": "Many network browsers have the Do not track function, which can release the DO Not Track request to the website.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67073, "text": "Currently, the major Internet standards organizations have not established policies on how websites should respond to such requests.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67074, "text": "But if your browser enables Do, Not, Track, then all our websites will respect your choice.", "label": ["Important", "Edit/Control"], "rewrite": "If Do Not Track is enabled on your browser, all of our websites will respect your choice."}
{"task": "rw_88.jsonl", "id": 67075, "text": "3. How does the bank store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67076, "text": "(1) storage", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67077, "text": "1. We will store personal information collected and generated in the territory in accordance with laws and regulations and regulatory requirements.", "label": ["Data Retention", "Important"], "rewrite": "We will store personal information collected and generated in China in accordance with laws, regulations and regulatory requirements."}
{"task": "rw_88.jsonl", "id": 67078, "text": "When you use cross-border financial services, your personal information (such as customer name, remitter account number and remitter address in cross-border remittance business) may be transmitted to overseas institutions for use after obtaining your authorization and consent. For business processing, our bank will take effective measures to protect your information security.", "label": ["Data Retention", "Important"], "rewrite": "After our bank obtains your authorization and consent, your personal information (such as customer name, remitter account number, and remitter address in cross-border remittance business) may be transmitted to overseas institutions for business processing, and our bank will take effective measures Keep your information safe."}
{"task": "rw_88.jsonl", "id": 67079, "text": "2. We only retain your personal information for the period necessary for the purpose described in this policy and within the time limit required by laws, regulations and regulatory requirements, such as:", "label": ["Data Retention", "Important"], "rewrite": "We only retain your personal information during the time limit of the purpose of this policy, and the time limit for laws and regulations and regulatory requirements, such as:: such as:"}
{"task": "rw_88.jsonl", "id": 67080, "text": "Mobile phone number: When you need to use electronic banking services, we need to keep your mobile phone number to ensure your normal use of the service. When you cancel your electronic banking account, we will delete the corresponding information;", "label": ["Data Retention", "Important"], "rewrite": "When you need to use electronic banking services, we have always saved your mobile phone number. When you log out the electronic bank account, we will delete the corresponding information."}
{"task": "rw_88.jsonl", "id": 67081, "text": "User Avatar: After you set your avatar, we will save your avatar for login and \"My\" page display;", "label": ["Data Retention", "Important"], "rewrite": "After you set your avatar, we will save your avatar for login and \"My\" page display."}
{"task": "rw_88.jsonl", "id": 67082, "text": "Login region: When you log in, we will record the registration location information of your card to ensure that you officially use the service.", "label": ["Data Retention", "Important"], "rewrite": "When you log in, we will record the registration information of your card to ensure that you officially use the service."}
{"task": "rw_88.jsonl", "id": 67083, "text": "This information is removed when the client is uninstalled.", "label": ["Data Retention", "Important"], "rewrite": "Login information is deleted when the client is uninstalled."}
{"task": "rw_88.jsonl", "id": 67084, "text": "(2) protection", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67085, "text": "1. We will abide by relevant laws and regulations, and take necessary measures to protect the security of personal information, so as to prevent personal information from being illegally accessed, copied, modified, transmitted, lost, destroyed, processed or used in accidental or unauthorized circumstances.", "label": ["Important", "Data Security"], "rewrite": "Necessary measures will be taken to ensure the security of personal information to prevent accidental and unauthorized access, copying, modification, transmission, loss, destruction, processing or use of personal information."}
{"task": "rw_88.jsonl", "id": 67086, "text": "For example, encrypted storage of information, use of encryption technology for information transmission, anonymization of information, database locking and other means to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67087, "text": "2. We establish a supporting management system, internal control mechanism and process to ensure your information security.", "label": ["Important", "Data Security"], "rewrite": "We establish a supporting management system, internal control mechanism, and processes to ensure your information security."}
{"task": "rw_88.jsonl", "id": 67088, "text": "For example, strictly restricting information access permissions, system monitoring of information access and processing behavior, and requesting relevant staff to sign a confidentiality agreement, etc.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67089, "text": "3. Our bank will try our best to ensure the security of any information you send to us, but please understand that due to technical limitations and various malicious means that may exist in the Internet industry, it is impossible to always guarantee 100% security of information.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67090, "text": "Please understand that you can access the system and communication network used in our travel services, which may have problems due to factors outside the control scope of our bank.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67091, "text": "In the event of a security incident such as personal information leakage, we will activate an emergency plan to prevent the expansion of the security incident, and will promptly inform you of the relevant situation of the incident through push notifications, text messages or phone calls.", "label": ["Important", "Data Security"], "rewrite": "In the event of a security incident such as personal information leakage, we will activate an emergency plan to prevent the expansion of the security incident and inform you of the incident in a timely manner."}
{"task": "rw_88.jsonl", "id": 67092, "text": "4. The Internet environment is not 100 % security. We will try our best to ensure the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67093, "text": "If our physics, technology, or management protection facilities are damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, which will cause your legitimate rights and interests to be damaged. We will bear the corresponding legal responsibility, except for non -resistance.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67094, "text": "5. We have passed the evaluation and filing of national network security level protection.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67095, "text": "4. How our bank shares, transfers and publicly discloses your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67096, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67097, "text": "Our bank will not share or transfer your personal information from any other companies, organizations and individuals, except for the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Our bank will not share or transfer your personal information from any other companies, organizations and individuals, except for the following situations:"}
{"task": "rw_88.jsonl", "id": 67098, "text": "1. Get your clear consent in advance.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you get your clear consent in advance, you will share and transfer personal information."}
{"task": "rw_88.jsonl", "id": 67099, "text": "2. If the business needs to share your personal information for the partner, our bank will inform you the purpose of sharing personal information, the type of data receiver, and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you share your personal information for the partners, our bank will inform you the purpose of sharing personal information, the type of data receiver, and obtain your consent."}
{"task": "rw_88.jsonl", "id": 67100, "text": "Involving sensitive information, our bank will also inform the type of sensitive information, the identity, necessity, and the impact of the personal rights and interests of the data receiver, and obtain your explicit authorization.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Our guillery informed the type of sensitive information, the identity, necessity, and the impact of personal rights and interests of the data receiver, and obtain your explicit authorization."}
{"task": "rw_88.jsonl", "id": 67101, "text": "Our bank will conduct strict security testing of the application interface (API) and software tool development package (SDK) that the partners obtain the relevant information, and strictly stipulate the strict data protection measures with the partner, so that it will follow the purpose of our bank's entrustment, the purpose of our bank,Service description, privacy policy, and any other related confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Our bank will conduct strict security testing of the application interface (API) and software tool development package (SDK) that the partner obtains information, and strictly agreed to strict data protection measures with the partner."}
{"task": "rw_88.jsonl", "id": 67102, "text": "3. In accordance with the provisions of laws and regulations, or in accordance with the mandatory requirements of the government authority, share your personal information to the outside world.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In accordance with laws and regulations, or in accordance with the mandatory requirements of the government authority, share your personal information to the outside world."}
{"task": "rw_88.jsonl", "id": 67103, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67104, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_88.jsonl", "id": 67105, "text": "1. Get your clear consent in advance.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Get your clear consent in advance and transfer personal information."}
{"task": "rw_88.jsonl", "id": 67106, "text": "2. In accordance with laws and regulations, or in accordance with the mandatory requirements of the government authority, transfer your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In accordance with laws and regulations, or in accordance with the mandatory requirements of the government department, transfer your personal information."}
{"task": "rw_88.jsonl", "id": 67107, "text": "3. In similar transactions such as mergers, acquisitions, asset transfer, etc., if personal information transfer is involved, our guild requires new companies and organizations holding your personal information to continue to be subject to this privacy policy. Otherwise, our bank will ask the company to ask the company to ask the companyOrganize the consent of authorization to you again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In similar transactions such as mergers, acquisitions, asset transfer, etc., if it involves personal information transfer, our guild requires new personal information processing subjects to continue to be subject to this privacy policy. Otherwise, our bank will ask them to reconcile your authorization consent."}
{"task": "rw_88.jsonl", "id": 67108, "text": "(3) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67109, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_88.jsonl", "id": 67110, "text": "1. Get your clear consent in advance.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Get your clear consent in advance and disclose personal information publicly."}
{"task": "rw_88.jsonl", "id": 67111, "text": "2. In accordance with laws and regulations, or in accordance with the mandatory requirements of the government authority, you will publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with laws and regulations, or in accordance with the mandatory requirements of the government authority, your personal information is disclosed publicly."}
{"task": "rw_88.jsonl", "id": 67112, "text": "(4) Exception of obtaining authorization consent", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Exception of obtaining authorization consent"}
{"task": "rw_88.jsonl", "id": 67113, "text": "According to relevant laws and regulations, regulatory requirements, and national standards, in the following circumstances, we may share, transfer, and openly disclose user information without requiring your authorization consent in advance, but you clearly refuse or handle the information to infringe your major interests:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, we may share, transfer, and publicly disclose user information without obtaining your authorization consent in advance, but you clearly refuse or handle the information to infringe your major interests:"}
{"task": "rw_88.jsonl", "id": 67114, "text": "1. It is necessary for the contract to establish and fulfill the person as a party as a party;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The contracts necessary for sharing and fulfilling the contract without soliciting consent."}
{"task": "rw_88.jsonl", "id": 67115, "text": "2. To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "It is not necessary to solicit consent to sharing and performing the personal information of statutory duties or the required personal information necessary for the statutory duty."}
{"task": "rw_88.jsonl", "id": 67116, "text": "3. In order to deal with emergencies, or in urgent situations to protect your life, health and property security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing to respond to emergencies, or personal information necessary for protecting life and health and property security, no consent is required."}
{"task": "rw_88.jsonl", "id": 67117, "text": "4. Implement news reports and public opinion supervision in public interests, and handle personal information within a reasonable range;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In order to implement news reports and supervision of public opinion, if you handle personal information within a reasonable range, you do not need to solicit consent."}
{"task": "rw_88.jsonl", "id": 67118, "text": "5. In accordance with the \"Personal Information Protection Law\", deal with personal information that individuals are disclosed or other legally disclosed within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In accordance with the \"Personal Information Protection Law\", it is not required to deal with disclosure of personal information within a reasonable range."}
{"task": "rw_88.jsonl", "id": 67119, "text": "6. Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Those who shared personal information under other circumstances stipulated in laws and administrative regulations do not need to solicit consent."}
{"task": "rw_88.jsonl", "id": 67120, "text": "V. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67121, "text": "In accordance with China's relevant laws and regulations and regulatory regulations, our bank guarantees the following rights to exercise your personal information:", "label": ["Edit/Control", "Important"], "rewrite": "In accordance with China's relevant laws and regulations and regulatory regulations, our bank guarantees the following rights to exercise your personal information:"}
{"task": "rw_88.jsonl", "id": 67122, "text": "(1) Visit, correct and update your personal information", "label": ["Edit/Control", "Important"], "rewrite": "In protecting you have the right to access, correct and update personal information."}
{"task": "rw_88.jsonl", "id": 67123, "text": "During your use of electronic banks, you have the right to modify or update your personal information independently, except for other provisions of laws, regulations, and regulatory policies.", "label": ["Important", "Edit/Control"], "rewrite": "During your use of electronic banks, you have the right to modify or update your personal information independently, except for other provisions of laws, regulations, and regulatory policies."}
{"task": "rw_88.jsonl", "id": 67124, "text": "According to the relevant requirements of anti -money laundering management, the personal basic information is incomplete, unreal, or the valid documents are expired and the valid documents have not been updated in time within a reasonable period. Our bank will restrict the provision of services. In order to continue to use our travel services, it is recommended that you update your personal information in timeEssence", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67125, "text": "Before you modify your personal information, we will verify your identity.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67126, "text": "After logging in to the electronic bank client, you can check, modify, and delete your basic information in \"My\", including modifying avatars, personal identity information modification, etc.;", "label": ["Important", "Edit/Control"], "rewrite": "After logging in to the electronic banking client, you can check, modify and delete your basic information in \"My\", including modifying avatars and personal identity information modification."}
{"task": "rw_88.jsonl", "id": 67127, "text": "Or check and modify your relevant security settings in the \"Security Center\", such as changing third -party protocols and opening account security locks.", "label": ["Important", "Edit/Control"], "rewrite": "After logging in to the electronic banking client, you can check and modify your relevant security settings in the \"Security Center\", such as changing the third -party agreement and opening account security locks."}
{"task": "rw_88.jsonl", "id": 67128, "text": "Among them, for modifying personal identity information, you can log in to mobile banks, click \"My-Settings-Security Center-Information Management-Personal Information Modification\" to correct or modify your personal identity information, career information and address information.After the modification is successful, you can log in to the electronic bank again.", "label": ["Important", "Edit/Control"], "rewrite": "After you log in to your mobile banking, click \"My-Settings-Security Center-Information Management-Personal Information Modification\" to correct or modify your personal identity information, career information and address information."}
{"task": "rw_88.jsonl", "id": 67129, "text": "You can also log in to the electronic banking client, manage the bank cards bound to the \"Homepage-My Account\" function, or query related transaction details through \"My-Details Inquiry\" and \"Homepage-My Account\".\"Mine-Settings-Security Center\" modify the login password, turn on or turn off a small amount of secret visa.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67130, "text": "(2) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67131, "text": "You can directly remove or delete the information on the product and/or service page of our travel, including binding bank cards, message records, cache records.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67132, "text": "In the following circumstances, you can make a request to delete personal information from our bank:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information from our bank:"}
{"task": "rw_88.jsonl", "id": 67133, "text": "1. If our behavior of handling personal information violates laws and regulations.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67134, "text": "2. If we collect and use your personal information, do not meet the exceptions of authorization described in this policy, but have not obtained your consent.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67135, "text": "3. If our behavior of handling personal information is violated with you.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67136, "text": "4. If you no longer use our products or services, or you log out of our electronic bank account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67137, "text": "5. If my trip no longer provides you with products or services.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67138, "text": "If our bank decides to respond to your deletion request, our bank will also notify the entities that obtain your personal information from our bank and require them to delete them in time. Unless laws, regulations or regulatory policies have other regulations, or these entities have obtained your independent authorization.", "label": ["Edit/Control", "Important"], "rewrite": "If our bank decides to respond to your deletion request, our bank will also notify the entities that obtain your personal information from our bank and require them to delete them in time. Unless laws, regulations or regulatory policies have other regulations, or these entities have obtained your independent authorization."}
{"task": "rw_88.jsonl", "id": 67139, "text": "When you delete the information from our line, our bank may not immediately delete the corresponding information in the backup system, but it will delete these information when the backup is updated.", "label": ["Edit/Control", "Important"], "rewrite": "After deleting information from our line, our bank may not immediately delete the information in the backup system, but it will delete it when the backup is updated."}
{"task": "rw_88.jsonl", "id": 67140, "text": "For personal information that is difficult to achieve in the preservation period stipulated in laws and administrative regulations, or delete personal information that is difficult to achieve from technically, we will stop processing except for storage and adopting necessary security measures.", "label": ["Important", "Data Security"], "rewrite": "If the preservation period is not expired or deleted personal information, it is difficult to achieve technically, we will stop processing except for storage and adopting necessary security protection measures."}
{"task": "rw_88.jsonl", "id": 67141, "text": "(3) Change the scope of your authorization consent or withdraw your authorization", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67142, "text": "Each business function requires some basic personal information to complete.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67143, "text": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time.", "label": ["Important", "Edit/Control"], "rewrite": "For the collection and use of additional personal information, you can give or withdraw your authorization consent at any time."}
{"task": "rw_88.jsonl", "id": 67144, "text": "You can prevent us from obtaining your personal information by closing some functions of electronic banking or refusing to provide relevant personal information when using some functions or services.The device \"setting\" function withdraws the authority obtained by our bank app to limit the information corresponding to our obtaining permissions.", "label": ["Important", "Edit/Control"], "rewrite": "You can prevent us or third parties from getting your personal information by closing some functions of electronic banking or refusing to provide relevant personal information."}
{"task": "rw_88.jsonl", "id": 67145, "text": "The above method may cause us or related third parties to be unable to provide you with corresponding services.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67146, "text": "If you need to withdraw from our bank to collect your personal information authorization, you can withdraw all the authorization of your personal information by canceling the method of canceling the mobile banking of the mobile phone.The authorized third party has collected your personal information authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to withdraw from our bank to collect your personal information authorization, you can withdraw authorization by canceling the mobile banking bank, or you can withdraw authorization through \"My-Settings-Security Center-Authorization Management\"."}
{"task": "rw_88.jsonl", "id": 67147, "text": "(4) Logging out users", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67148, "text": "After you log in to your mobile banking, click \"My-Settings-Logging out of the mobile banking\" to cancel the operation of the mobile banking. You can also ask your own electronic banks through channels such as our outlets or self-service equipment.", "label": ["Important", "Edit/Control"], "rewrite": "After you log in, click \"My-Settings-Logging up the mobile banking\" to cancel the operation of the mobile banking. You can also ask for a cancellation of channels such as our outlets or self-service equipment."}
{"task": "rw_88.jsonl", "id": 67149, "text": "After canceling the electronic bank, your electronic bank account is canceled simultaneously.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67150, "text": "Your behavior of canceling the electronic bank account is irreversible. Once you cancel your electronic bank, we will no longer collect your personal information through the electronic bank client and will delete all information, laws, regulations or supervision of your electronic bank accountExcept for the storage time of personal information storage.", "label": ["Important", "Edit/Control"], "rewrite": "Once you log out your electronic bank, we will no longer collect your personal information and will delete all information, laws and regulations, or regulatory agencies, except for other regulations on personal information storage time."}
{"task": "rw_88.jsonl", "id": 67151, "text": "Please note that when you only delete the electronic banking app in your mobile phone device, our bank will not cancel your electronic bank account. All information about your electronic bank account will not delete.", "label": ["Important", "Edit/Control"], "rewrite": "When the electronic banking app is deleted in mobile phone devices alone, our bank will not cancel your electronic bank account. All information about your electronic bank account will not delete."}
{"task": "rw_88.jsonl", "id": 67152, "text": "You still need to cancel your electronic banking to achieve the above goals.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67153, "text": "(5) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67154, "text": "If you cannot access, correct or delete your user information in the above way, or you need to access, correct or delete other user information generated when using our service or functionOr you can get in touch with our bank through the contact information of this policy with your contact information in this policy.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67155, "text": "In order to ensure safety, our bank may need to provide a written request or prove your identity in other ways. Our bank will complete the verification, processing, and responding to your request within 15 natural days after receiving your feedback and verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67156, "text": "For your reasonable requests, our bank does not charge fees in principle, but on requests that repeat and beyond the reasonable limit, our bank will charge a certain cost fee depending on the situation.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In principle, the reasonable request does not charge fees, but for multiple repeated and more reasonable requests, our bank will charge a certain cost fee depending on the situation."}
{"task": "rw_88.jsonl", "id": 67157, "text": "Regarding illegal, illegal, no reasons, possibilities for no repetition, too many technical means (for example: need to develop new systems or fundamentally change the current practice), bring risks to others with legitimate rights and interests, or very unrealistic requests, IIt may be rejected.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Regarding illegal, illegal, no reasons, possibilities for no repetition, too many technical means, risk or very unrealistic requests to others' legitimate rights and interests, our bank may refuse."}
{"task": "rw_88.jsonl", "id": 67158, "text": "In addition, in accordance with relevant laws and regulations, regulatory requirements, etc., if the following circumstances are required by the state's authority or regulatory authority, or there are other situations, our bank may not be able to respond to your request, but you explicitly refuse or deal with handlingExcept for this information infringe your major interests:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, if there is a national authority or a regulatory authority, or if there are other situations, our bank may not be able to respond to your request, but you clearly refuse or handle the information to infringe your major interests:"}
{"task": "rw_88.jsonl", "id": 67159, "text": "1. What is related to the obligations stipulated in the performance of the personal information controller;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "If the obligations stipulated by the Personal Information Controller's Performance of Laws and Regulations, the request cannot be responded."}
{"task": "rw_88.jsonl", "id": 67160, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_88.jsonl", "id": 67161, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_88.jsonl", "id": 67162, "text": "4. Directly related to criminal investigation, prosecution, trial and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to requests."}
{"task": "rw_88.jsonl", "id": 67163, "text": "5. Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and cannot respond to the request."}
{"task": "rw_88.jsonl", "id": 67164, "text": "6. For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Out of maintaining major legitimate rights and interests such as life and property, it is difficult to get my consent and cannot respond to the request."}
{"task": "rw_88.jsonl", "id": 67165, "text": "7. The request of the person in response to the subject of the personal information will cause the legitimate rights and interests of the personal information subject or other individuals and organizations to be seriously damaged;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "In response to the request of the subject of personal information, if the legitimate rights and interests are severely damaged, the request cannot be responded."}
{"task": "rw_88.jsonl", "id": 67166, "text": "8. Involved in business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_88.jsonl", "id": 67167, "text": "6. Protection of personal information of minors", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67168, "text": "If you are a minor, please read this policy carefully and use our services or provide information to us under the premise of obtaining your guardian's consent.", "label": ["Specific Audiences", "Important"], "rewrite": "Please read this policy carefully, and use our services or provide information to us under the premise of obtaining the consent of the guardian."}
{"task": "rw_88.jsonl", "id": 67169, "text": "Regarding the consent of the supervisor to collect personal information of minors, we will only use this information when the laws and regulations and regulators are allowed to be allowed, the guardian clearly agrees or protects minors.", "label": ["Specific Audiences", "Important"], "rewrite": "We will only provide this information if the laws and regulations and regulatory requirements are allowed to be allowed, the guardian clearly agrees or protects minors."}
{"task": "rw_88.jsonl", "id": 67170, "text": "Our bank will protect the confidentiality and security of personal information of minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67171, "text": "If your guardian does not agree that you will use our services to use our bank's services or provide information to our bank in accordance with this policy. Please immediately terminate the service of our bank and inform us in a timely manner.", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree that you use services or provide information in accordance with this policy, please immediately terminate the service of our bank and inform us in time."}
{"task": "rw_88.jsonl", "id": 67172, "text": "If you are a guardian of a minor, when you have questions about the personal information processing of the minors you monitor, please contact me through the contact information in this policy.", "label": ["Specific Audiences", "Important"], "rewrite": "When the guardian has questions about the personal information processing of the monitoring minors, please contact our bank through the contact information in this policy."}
{"task": "rw_88.jsonl", "id": 67173, "text": "If you are under 14 years of age, use our services or provide information to our bank or provide information on the premise that your parents or guardians agree.", "label": ["Specific Audiences", "Important"], "rewrite": "For children under the age of 14, use services or provide information on the premise of obtaining the consent of the guardian."}
{"task": "rw_88.jsonl", "id": 67174, "text": "For the situation where your parents or guardian consent, in addition to the principles of complying with the principles of legitimate necessity, consent of knowledge, clear purpose, security, and use according to law, we will strictly follow the principles.The requirements of laws and regulations are stored, used, and disclosed, and will not exceed the period required for the purpose of collection and use. After expiration, we will delete or processes your personal information.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Our trip adheres to the principles of legitimate necessity, knowledge consent, clear purpose, safety guarantee, and use according to law, strictly follow the requirements of laws and regulations to storage, use, and disclosure, and will not exceed the period required for the purpose of collection and use.We will be deleted or anonymous afterwards."}
{"task": "rw_88.jsonl", "id": 67175, "text": "7. How to change this policy", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67176, "text": "According to national laws and regulations, changes in regulatory policies, and service operations, our bank will modify this policy and related rules from time to time.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67177, "text": "When this policy is changed, we will issue an updated version of this policy on the electronic banking client, and will be in the form of a pop -up form or website (https://pbank.psbc.com/perbank/html/systems before changing content.Notify you with reasonable ways such as /privacyShow.html) announcement, so that you can understand the latest content of this policy in time.", "label": ["Policy Change", "Important"], "rewrite": "When this policy is changed, we will issue an updated version of this policy on the electronic banking client, and will be in the form of a pop -up form or website (https://pbank.psbc.com/perbank/html/system/Notify you with reasonable ways such as PrivacyShow.html) announcement."}
{"task": "rw_88.jsonl", "id": 67178, "text": "You know and confirm that if you do not agree with the content of the update, you have the right and immediately stop using the corresponding service and cancel the relevant users. Our bank will stop collecting your relevant personal information;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the updated content, you have the right to stop using the corresponding service immediately and cancel the relevant users. Our bank will stop collecting relevant personal information."}
{"task": "rw_88.jsonl", "id": 67179, "text": "If you continue to use electronic banking services after the revision of this policy, it means that you have fully read, understand and accept the revised policies and agree that we can collect, use, save and share your relevant information in accordance with the revised policy.", "label": ["Policy Change", "Important"], "rewrite": "If you continue to use electronic banking services after the revision of this policy, it means that you have accepted the revised policy and agreed that we have collected, used, preserved, and shared your relevant information in accordance with the policy."}
{"task": "rw_88.jsonl", "id": 67180, "text": "8. How to contact me", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67181, "text": "If you have any opinions, suggestions, questions, or complaints on this policy, you can contact us through the 95580 product consultation with the hotline of the complaint service service, \"customer service\" in electronic banking, and other customer service channels to consult with us. We will deal with your opinions in time, Suggestions, complaints, and related issues, the facts are clear and controversially complained 15 natural days.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67182, "text": "Company Name: China Postal Savings Bank Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_88.jsonl", "id": 67183, "text": "Registration address: No. 3, Financial Street, Xicheng District, Beijing.", "label": ["Important", "Contact Information"], "rewrite": "Registration address: No. 3, Financial Street, Xicheng District, Beijing."}
{"task": "rw_88.jsonl", "id": 67184, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
