{"task": "rw_89.jsonl", "id": 67185, "text": "Youku Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67186, "text": "Effective date: February 23, 2022", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67187, "text": "Version: 2022 V1.1", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67188, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67189, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67190, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67191, "text": "Based on this, service provider Youku Information Technology (Beijing) Co., Ltd. (or \"we\") formulates this \"Youku Privacy Policy\" (hereinafter referred toIn the process of our products and services, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make better choices.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67192, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses we logging in the threatening of the body/coarse body to ensure that you fully understand and agree to use it before starting to use.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67193, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67194, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67195, "text": "You agree that the privacy policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not mean that you have agreed to open up additional functions and handle non -necessary personal information.The opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Agree with the privacy policy that you have given the necessary personal information for the need for functional operation to collect and use it, but it does not mean that you have agreed to open up additional functions and handle unnecessary personal information."}
{"task": "rw_89.jsonl", "id": 67196, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67197, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67198, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67199, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67200, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67201, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67202, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67203, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67204, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67205, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67206, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67207, "text": "This policy is applicable to Youku service providers with Youku.com (Youku.com), Youku client (including but not limited to iOS version, Android version, etc.), small programs, and new forms that appear with technology development to you.and service.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67208, "text": "Except for the relevant information collection and use activities explained by this policy, this policy is a uniform content that is uniformly applicable to all products and/or services of Youku. When you use any of our products and/or services, this policy is applicable, but as it shouldIf the product and/or service set the privacy clause/privacy agreement separately, the individual privacy terms/privacy agreements are preferred;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67209, "text": "The content of the privacy clause/privacy agreement is not mentioned, and this policy is applicable.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67210, "text": "But please note that this policy is not applicable to the following situations:", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67211, "text": "1. The information collection/processing practice of providing advertising services for our products and/or services;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67212, "text": "2. Our products and/or services may include or link information or third -party services provided by third parties (including any third -party applications, websites, products, services, etc.).Using such information or services has nothing to do with us.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67213, "text": "We will remind you here that when you use third -party information or services, you should pay attention and read the relevant user agreement and personal information protection policies you displayed in the third direction, and provide your personal information properly and carefully.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67214, "text": "This policy is only applicable to your personal information we collected, and it is not applicable to the collection of your personal information of any third party, as well as any third -party service or third -party information use rules.The behavior of storage and use of your personal information will not be responsible for the scope of law.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67215, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67216, "text": "When you use our products and/or services, your personal information we need/may need to collect and use includes the following: below:", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67217, "text": "1. To achieve the basic functions of providing you with/or services to you, you must authorize us to collect and use the necessary information.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67218, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67219, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67220, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67221, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67222, "text": "Because there are many types and services we provide to you, and the specific products and/or service range that different users choose to use, the basic/additional functions and the personal information types and scope of personal information and use will be different.The specific products and/or service functions are subject to.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67223, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67224, "text": "(1) Account registration/login and authentication", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67225, "text": "(1) Account registration/login", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67226, "text": "[Account Registration] When you register our products and/or services, in order to help you complete the registration process, you need to provide us with your mobile phone number and verify, and create a username and password.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number for verification, and create a username and password."}
{"task": "rw_89.jsonl", "id": 67227, "text": "Collecting such information is to meet the real -name system requirements of relevant laws and regulations. This kind of information is a necessary information for this function. If you do not provide such information, it will cause registration failure, but it will not affect your viewing, searching, and playback of video.Function.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide mobile phone number information, you will fail to register, but it will not affect your browsing, searching, and playback function of your video."}
{"task": "rw_89.jsonl", "id": 67228, "text": "In addition, you can also fill in the name, region and other information according to your own needs.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67229, "text": "[Account login] When you log in to our products and/or services, you need to provide us with your mobile phone number/mailbox and password, or verify;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect mobile phone numbers/mailboxes and passwords, or verify."}
{"task": "rw_89.jsonl", "id": 67230, "text": "Based on our cooperation with communication operators, when you use it and the \"one -click login\" function, after your explicit consent, we will obtain your mobile phone number through the operator to facilitate us to provide you with a fast login service;", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the \"one -click login\" function, you will obtain your mobile phone number after clearing the consent to provide fast login services."}
{"task": "rw_89.jsonl", "id": 67231, "text": "When you use the \"Scan Code Login\" function, we will ask you to authorize the camera permissions to complete the QR code scanning code smoothly;", "label": ["Permission Acquisition", "Important"], "rewrite": "Ask you to authorize the camera permissions to complete the QR code to scan the code smoothly."}
{"task": "rw_89.jsonl", "id": 67232, "text": "When you log in with a third -party platform (for example: Taobao/Alipay/WeChat/Weibo/QQ account, etc.), you authorize to get the relevant information (including nicknames, avatars, specific avatars, specifically in the third -party account number you log in to the third -party account you log in.Your authorization content is subject to), which is binding with Youku account, so that you can log in and use related products and/or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "When logging in with an account on a third -party platform, we authorize us to obtain information (including: nicknames, avatars, and specific content of your authorization)."}
{"task": "rw_89.jsonl", "id": 67233, "text": "In order to meet the real -name system requirements of relevant laws and regulations, when you use a third -party platform account to authorize to log in to our products and/or services, the first authorization needs to be bound to your mobile phone number.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67234, "text": "This kind of information is a necessary information for this function. If you do not provide such information, you may not be logged in normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third -party account information is a necessary information for this function. If you do not provide such information, you may not be logged in normally."}
{"task": "rw_89.jsonl", "id": 67235, "text": "If you do not provide such information, it will cause the login failure, but it will not affect your browsing, searching, and playback function of your video.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not provide a third -party account information, it will cause the login failure, but it will not affect your browsing, searching, and playback function of your video."}
{"task": "rw_89.jsonl", "id": 67236, "text": "[Basic Information Maintenance] When you use Youku, in order to maintain your basic information and improve your service experience, you can choose to fill in your gender, avatar, nickname, birthday, personal introduction, etc.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67237, "text": "Such information is a non -necessary information about this function. If you do not provide this information, it does not affect your basic functions of our products and/or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Third -party account information is a non -necessary information about this function. If you do not provide this information, it does not affect your basic functions."}
{"task": "rw_89.jsonl", "id": 67238, "text": "When you upload/change your avatar, we will ask your camera, album permissions, and collect the picture information you upload/replacement.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When uploading/changing avatars, we will ask your camera, album permissions, and collect the picture information you upload/replacement."}
{"task": "rw_89.jsonl", "id": 67239, "text": "(2) Identity verification", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67240, "text": "When you use information release (such as live broadcast), \"Youku\", online game user real -name registration and transaction, purchase of business performance tickets, purchase related financial products or services, enterprise performance to deduct and pay personal income taxMeet the relevant legal regulations and regulatory requirements, ensure the authenticity of the user's identity, and realize the risk control of anti -fraud, or to ensure the safety of systems and services. You may need to certify your identity before using specific functions and/or services.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67241, "text": "We will need to collect your identity authentication information (may include names, ID card -related information, facial feature information, and mobile phone numbers) to complete real -name authentication.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your identity authentication information (may include name, ID card -related information, facial feature information, and mobile phone numbers) to complete real -name authentication."}
{"task": "rw_89.jsonl", "id": 67242, "text": "In the adolescent mode, if you need to exit and forget the password, in order to meet the relevant laws and regulations, you need to certify your identity.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67243, "text": "You can choose to contact our customer service to reset the password, or you can use online certification to withdraw from the youth mode.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67244, "text": "If you choose online authentication, we will need to collect your identity authentication information (including name, ID card -related information, facial feature information) to complete the certification.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your identity authentication information (including name, ID card -related information, facial feature information) to complete the certification."}
{"task": "rw_89.jsonl", "id": 67245, "text": "(2) Browse/search/play/download", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67246, "text": "When you use our video, audio, live broadcast, electronic readings and other services to browse and playback functions, provide you with consistent services, we need to collect your equipment information and log information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your equipment information and log information."}
{"task": "rw_89.jsonl", "id": 67247, "text": "The aforementioned log information includes: your operation, behavior log information, including your browsing records, likes/sharing/review/interactive records, collection/follower/appointment records/+recording, playback records, playback duration, date and time of access, time and timeEssence", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your log information: your operation and behavior log information, including your browsing records, likes/sharing/review/interactive records, collection/follower/reservation records/+chase records, playback records, playback duration, visit date and visit date and visittime."}
{"task": "rw_89.jsonl", "id": 67248, "text": "Such information is a necessary information for this function. If you do not provide such information, you may not be able to use the above features normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Log information is a necessary information for this function. If you do not provide such information, you may not be able to use the above functions normally."}
{"task": "rw_89.jsonl", "id": 67249, "text": "When you use the search function, we will automatically collect some of your information, including the following personal information: the content of the search (including text, voice information when using voice search), browsing records and time, time of search, and interacting with themfrequency.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using the search function, automatically collect the following personal information: the content of the search (including text, voice information when using voice search), browsing records and time, search time, and the number of interaction with them."}
{"task": "rw_89.jsonl", "id": 67250, "text": "In order to provide efficient search services, some of the aforementioned information will be temporarily stored on your local device, and you can show you search history.", "label": ["Data Retention", "Important"], "rewrite": "When using the search service, some of the aforementioned information will temporarily store on the local device side and show you search history."}
{"task": "rw_89.jsonl", "id": 67251, "text": "Such information is a necessary information for this function. If you do not provide such information, you may not be able to use the above features normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "The search function related information is a necessary information for this function. If you do not provide such information, the above functions may not be used normally."}
{"task": "rw_89.jsonl", "id": 67252, "text": "We provide you with voice search.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67253, "text": "When you use the voice search function, we will request you to authorize the microphone rights and collect your voice information;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When using the voice search function, you ask you to authorize the microphone rights and collect your voice information."}
{"task": "rw_89.jsonl", "id": 67254, "text": "When you use the download function, we will ask you to authorize the storage authority to write the relevant information about the video files in the video file in your device.", "label": ["Data Retention", "Permission Acquisition", "Important"], "rewrite": "When using the download function, you request your authorized storage authority in order to write the relevant information about the video files in the storage space outside the device."}
{"task": "rw_89.jsonl", "id": 67255, "text": "(3) Upload or release, communication and interaction", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67256, "text": "If you use uploaded videos or photos, barrage, comments, or leave messages in the community, you may take the initiative to provide relevant graphic/audio and video content.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67257, "text": "We will automatically collect your above information and show your nickname, avatar, and published information content.", "label": ["Important", "First Party Collection Information"], "rewrite": "Automatically collect your graphic/audio and video content information, and display your nickname, avatar, and published information content."}
{"task": "rw_89.jsonl", "id": 67258, "text": "Please know that the information you posted may include personal information of others. Please obtain legal authorization of others to avoid illegally leaking personal information of others.", "label": ["Important", "First Party Collection Information", "Data Security"], "rewrite": "The published information may include the personal information of others. Please obtain the legal authorization of others to avoid illegally leaking the personal information of others."}
{"task": "rw_89.jsonl", "id": 67259, "text": "When you communicate interaction, we will collect your interactive information (including not limited to comments, barrage, collection/follow/reservation/reservation/recording, praise/comments/sharing/communication interactive information).", "label": ["Important", "First Party Collection Information"], "rewrite": "When communicating and interacting, you will collect your interactive information (including not limited to comments, barrage, collection/follow/reservation/reservation/recording, likes/review/sharing/communication interactive information)."}
{"task": "rw_89.jsonl", "id": 67260, "text": "Upload or publish on the aforementioned information, when you use it, we will ask you to authorize the rights of cameras, albums, and microphones.", "label": ["Permission Acquisition", "Important"], "rewrite": "Upload or release of interactive information, when you use it, we will ask you to authorize the rights of the camera, album, and microphone."}
{"task": "rw_89.jsonl", "id": 67261, "text": "(4) Participate in operation and interactive activities, marketing promotion and message notification", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67262, "text": "If you participate in our operations and interactive activities, such as drawing, guessing, answering, questionnaires, and movie viewing activities, you may need to take the initiative to submit relevant information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Participating in operation and interactive activities requires you to submit relevant information."}
{"task": "rw_89.jsonl", "id": 67263, "text": "For example, you may need to submit your ID information for withdrawal of red envelopes received, redeeming prizes, and increasing taxes to tax institutions.", "label": ["Important", "First Party Collection Information"], "rewrite": "You may need to submit ID information."}
{"task": "rw_89.jsonl", "id": 67264, "text": "If prizes or activities need to be sent, you also need to provide address information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to send prizes or event gifts, address information needs to be provided."}
{"task": "rw_89.jsonl", "id": 67265, "text": "Such information is a necessary information for this function. If you do not provide such information, you may not be able to participate in the above activities normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "ID cards and address information are necessary information about this function. If this kind of information is not provided, it may not be able to participate in the above activities normally."}
{"task": "rw_89.jsonl", "id": 67266, "text": "In order to achieve the function of finding the activity page through the third -party platform, we will find the function of the activity page, we will read our shear board content when you open our application or switch from the background to the front desk to judgeAre there any relevant code information information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "You can read your cut plate content to determine whether there is a related oral code information."}
{"task": "rw_89.jsonl", "id": 67267, "text": "Only when the shear plate has the aforementioned information, we will collect the information. After the server does it, the content you need will be fed back to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "We only collect the information when the shear plate has the aforementioned information."}
{"task": "rw_89.jsonl", "id": 67268, "text": "Please rest assured that we will not store other information about your shear board, and the separate shear information cannot identify your specific identity.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "We will not store other information of your shear board, and we cannot recognize your specific identity by separate shear information."}
{"task": "rw_89.jsonl", "id": 67269, "text": "For your contact information (including contact telephone number, contact mailbox) you provided during the use process, we may send one or more of them in operation, for user messages, authentication, securityVerification, user use experience research and other uses.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67270, "text": "After obtaining your authorization and consent, we may provide you with commercial information such as advertisements and commercial activities that you may be interested in by means of text messages, phone calls and/or emails.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67271, "text": "If you do not want to receive our commercial information, you can reply to the marketing text message that we send to you by replying).", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67272, "text": "When you use video, live broadcast, activities, commodity online, etc., we will request your calendar permissions. After you start the calendar authority, we will access your calendar to help you make an appointment or adjust the time of the appointment.And remind you.", "label": ["Permission Acquisition", "Important"], "rewrite": "Will ask your calendar permissions. After you start the calendar authority, we will access your calendar."}
{"task": "rw_89.jsonl", "id": 67273, "text": "(5) Place order and payment", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67274, "text": "When you purchase our products and/or services, such as VIP members, movie tickets, free streaming packages, U beans, star coins, coupon packages, U diamonds, Youku services, etc., we need to Collect some or all of the following personal information, including: transaction goods or service information, consignee information (consignee name, delivery address and contact number, if the consignee is not your own, you should ensure that you have obtained the consignee relevant authorization), transaction amount, order time, order merchant, order number, order status, payment method, payment account number, and payment status. We collect this information to help you complete the transaction smoothly, ensure your transaction security, and inquire about the order information and provide customer service.", "label": ["Important", "First Party Collection Information"], "rewrite": "The following personal information is collected according to the type of goods or services, including: transaction goods or service information, consignee information (consignee name, delivery address and contact number, if the consignee is not yourself, you should ensure that the consignee has obtained consignor-related authorization), transaction amount, order time, order merchant, order number, order status, payment method, payment account number, and payment status."}
{"task": "rw_89.jsonl", "id": 67275, "text": "Such information is a necessary information for this function. If you do not provide such information, you may not be able to participate in the above activities normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "Such information is necessary information for this function, and if such information is not provided, it may not be possible to participate in the above activities normally."}
{"task": "rw_89.jsonl", "id": 67276, "text": "After you successfully place an order, if the product is provided by a third-party seller or the product needs to be delivered by a third party, we will complete the delivery and delivery of the goods to you for safety and accuracy. It is inevitable that you will be informed of your transaction commodity order information and consignee information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Merchants and third -party distribution companies will learn about your transaction product order information and consignee information in the delivery and delivery links."}
{"task": "rw_89.jsonl", "id": 67277, "text": "We promise you that we will do our best to protect the security of your personal information. We will strictly require merchants and third-party delivery companies to keep your personal information confidential, and only learn and use it for the purpose of delivery, and shall not disclose it or do any other use.", "label": ["Important", "Data Security"], "rewrite": "To ensure your personal information security, we will strictly require merchants and third -party distribution companies to keep your personal information confidential."}
{"task": "rw_89.jsonl", "id": 67278, "text": "(6) Content display and recommendation", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67279, "text": "In order to better provide you with content recommendation and display, optimize search results, understand the adaptability of products to different hardware devices, ensure the security of the operating environment, and identify abnormal account statuses, etc., we will collect information about your use of our products or services. The information of the way, and correlating the information, the information includes: 1. Device information: We will receive and record information about the device you use (such as device model, operating system version, device settings, MAC address and IMEI, IDFA, OAID) based on the specific operations you authorized during software installation and/or use. (such as device identification code, device environment, mobile application list and other software and hardware feature information), device location information (including your authorized GPS location and sensor information such as WLAN access point, Bluetooth and base station);", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and correlate the following information, including: 1. Device Information."}
{"task": "rw_89.jsonl", "id": 67280, "text": "2.Log Information: When you use the products or services provided by our website or client, we will automatically collect the detailed usage of your service as the relevant network log preservation.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect log information."}
{"task": "rw_89.jsonl", "id": 67281, "text": "Including your search and browsing records, attention, playback records, access volume, playback duration, IP address, WLAN network, telecommunications operator network, language, access date and time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Log information includes your search and browsing records, follow, play records, visits, play duration, IP address, WLAN network, telecom operator network, language used, access date and time."}
{"task": "rw_89.jsonl", "id": 67282, "text": "In order to better provide you with content recommendation and display, we will combine device information, service log information, and other information authorized by you to optimize the search results.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Optimize the search results by combining device information, service log information collected according to law, and other information authorized by you."}
{"task": "rw_89.jsonl", "id": 67283, "text": "We use this information to personalize recommendations in the following ways:", "label": ["Important", "Usage"], "rewrite": "Use this information for personalized recommendations::"}
{"task": "rw_89.jsonl", "id": 67284, "text": "(1) Recommended personalized film and television content according to the movie viewing record", "label": ["Important", "Usage"], "rewrite": "Recommended personalized film and television content according to the movie viewing record."}
{"task": "rw_89.jsonl", "id": 67285, "text": "In order to provide you with more convenient and more information display, search and push services that are more convenient and more in line with your personal needs, we will extract your viewing preferences according to your equipment information, movie viewing records, search records and other related log information.More sexual video content and information for you to choose to watch.", "label": ["Important", "Usage"], "rewrite": "According to the relevant log information, you will extract video preferences, and recommend more relevant video content and information for you to choose to watch."}
{"task": "rw_89.jsonl", "id": 67286, "text": "(2) Personalized advertising recommendation", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67287, "text": "We will extract your preference features based on your device information and service log information, order information, and your third -party cooperation platform, and match your corresponding commercial advertisements for you.", "label": ["Important", "Usage"], "rewrite": "According to your equipment information and service log information, order information, and some information on the third -party cooperation platform, extract the preference features, and match the corresponding commercial advertisement."}
{"task": "rw_89.jsonl", "id": 67288, "text": "In the process of targeted advertising to you, we will strictly protect your personal information and ensure data security in accordance with relevant laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67289, "text": "(3) Personalized Recommended Service button Close", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67290, "text": "If you don't want us to use your relevant information according to the aforementioned content, (historical movie viewing records, consumption preferences, and portraits) to recommend personalized services for you, you can enter Youku APP, \"My\" - \"Settings\" -In \"Other Settings\", by clicking \"Allow Youku to watch historical recommendation videos\" and \"Allow Youku to show advertisements based on partner data\", the button selects personalized recommendation services.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "You can enter the Youku APP \"My\" - \"Settings\" - \"Other Settings\", by clicking \"Allow Youku according to watching historical recommendation videos\", \"Allow Youku according to the partner data to show the advertisement\" button, select the personalized recommendation recommendation recommendation recommendationServe."}
{"task": "rw_89.jsonl", "id": 67291, "text": "In addition, we will use your above information to continuously improve and optimize the above functions.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67292, "text": "(7) VIP member or subscription service", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67293, "text": "In order to complete the VIP membership fee payment, we will record your payment method and capital account to achieve the original path refund, the activity red envelope cash withdrawal, and the continuous monthly service after -sales service;", "label": ["Important", "First Party Collection Information"], "rewrite": "It will record your payment method and fund account number to realize the after -sales service of the original path refund, the red envelope promotion of the activity, and the removal of continuous monthly services."}
{"task": "rw_89.jsonl", "id": 67294, "text": "According to the payment method you choose, we will develop your order payment related information, order security related equipment information, and the necessary information required by other anti -money laundering laws through Alipay and other third -party payment software tool development packages embedded in the application (SDK) is shared with Alipay or other third -party payment companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your order payment related information, order security related equipment information, and other anti -money laundering laws required for anti -money laundering law with third -party payment companies."}
{"task": "rw_89.jsonl", "id": 67295, "text": "At the same time, we will record and show you the order information of your account, including purchasing members, single -films, subscribing comics, virtual currency and prop purchase information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The order information will be recorded and displayed to you, including purchasing membership, video on demand, subscription to comics, virtual currency and item purchase information, etc."}
{"task": "rw_89.jsonl", "id": 67296, "text": "You understand and agree that for one or more of your contact methods (such as: contact number) that you provide during use, we may send multiple types of notifications to one or more of them during operation for the purpose of User message notification, identity verification, security verification, user experience research and other purposes.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67297, "text": "In addition, after your authorization consent, we will provide you with commercial information such as advertising and business activities that you may be interested in through SMS, telephone and/or email, but please rest assured that if you don’t want to accept thisFor commercial information, you can also be withdrawn through the withdrawal method provided in SMS and email.", "label": ["Important", "Usage"], "rewrite": "After obtaining your authorization and consent, provide you with commercial information such as advertisements and commercial activities that may be of interest to you by means of text messages, phone calls and/or emails."}
{"task": "rw_89.jsonl", "id": 67298, "text": "(8) Customer service and dispute resolution", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67299, "text": "When you contact us or apply for dispute resolution, in order to protect your account and system security, we need you to provide the necessary personal information to verify your membership.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide the necessary personal information to verify your membership."}
{"task": "rw_89.jsonl", "id": 67300, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may preserve your communication, communication/call records and related content (including account information, order information, to prove the relevant related to related related to the relevantOther information provided by the facts, or the contact information you leave).", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "You may save your communication, communication/call records and related content."}
{"task": "rw_89.jsonl", "id": 67301, "text": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67302, "text": "In order to provide services and improve the reasonable needs of service quality, we may also use other information about you, including relevant information you provide when you contact customer service, and questionnaire response information you send to us when you participate in questionnaire surveys.", "label": ["Important", "Usage"], "rewrite": "May use the relevant information you provided when you contact your customer service, and you will send us questionnaire answering information to us when participating in the questionnaire survey."}
{"task": "rw_89.jsonl", "id": 67303, "text": "(9) Provide you with security", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67304, "text": "In order to improve the security of your services to provide services with our affiliated companies and partners, protect the safety of personal property of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, cyber attacks, Internet intrusion risk, more accurately identify the situation of violations of laws and regulations or Youku related agreements, rules, and rules.Your member information, transaction information, equipment information, service log information, and information that our affiliated companies and partners obtain your authorization or sharing according to law (Among them, we may collect MAC addresses, IMEI and other device logos during the application background operation period.The risk check) to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Embed the application security SDK in the application to collect your device information and service log information, and may use or integrate your membership information, transaction information, device information, service log information and our affiliates and partners to obtain your authorization or in accordance with the law shared information."}
{"task": "rw_89.jsonl", "id": 67305, "text": "(10) Other additional services", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67306, "text": "(1) Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67307, "text": "To provide you with more convenient, better, personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the following additional services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "In the following additional services provided to you, you may collect and use your personal information by opening system permissions."}
{"task": "rw_89.jsonl", "id": 67308, "text": "If you do not agree to start the relevant permissions, it will not affect your basic service of Youku, but you may not be able to obtain the user experience brought by these additional services to you.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not agree to start the relevant authority, it will not affect your basic services, but you may not get the user experience brought by these additional services to you."}
{"task": "rw_89.jsonl", "id": 67309, "text": "You can decide to turn on or off these permissions at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide to turn on or off these permissions at any time."}
{"task": "rw_89.jsonl", "id": 67310, "text": "Please note that if you enable any permission, you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you close any permission, it means that you cancel the authorization, and we will no longer continue to collect based on the corresponding permission and use relevant personal information, and cannot continue to provide you with the services corresponding to this permission.", "label": ["Edit/Control", "Important"], "rewrite": "Opening one authority means that you can authorize us to collect and use relevant personal information. Closing the allowance of any authority means that you have canceled the authorization. It will no longer continue to collect and use relevant personal information based on the corresponding permissions, nor can it continue to provide you with corresponding services."}
{"task": "rw_89.jsonl", "id": 67311, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_89.jsonl", "id": 67312, "text": "You can click here to view \"Application Power Application and Use Instructions\".", "label": ["Permission Acquisition", "Important"], "rewrite": "You can click here to view \"Application Power Application and Use Instructions\"."}
{"task": "rw_89.jsonl", "id": 67313, "text": "(2) Services of cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67314, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67315, "text": "When you use our service, we may use related technologies to send one or more, cookie, or anonymous identifiers (hereinafter referred to as \"Cookie\") to collect, identify and store your access, use this product, use this productInformation about time.", "label": ["Important", "First Party Collection Information"], "rewrite": "Send one or more cookies or anonymous identifiers (hereinafter referred to as \"Cookie\") to your device to collect, identify and store information when you access and use this product."}
{"task": "rw_89.jsonl", "id": 67316, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67317, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the related abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67318, "text": "At the same time, we may use Cookie to show you the information or functions you may be interested in and optimize your choice of advertising.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67319, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of Cookie or reject our cookies."}
{"task": "rw_89.jsonl", "id": 67320, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67321, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67322, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67323, "text": "We will not share your personal information with companies, organizations and individuals other than Youku service providers, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "It will not share your personal information with companies, organizations and individuals other than Youku service providers, except the following situations:"}
{"task": "rw_89.jsonl", "id": 67324, "text": "(1) Sharing necessary to fulfill statutory obligations: We may share your personal information in accordance with laws and regulations, litigation, dispute resolution, or according to the legal requirements of administrative and judicial authorities, and other legal obligations. .", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "It may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements put forward by administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_89.jsonl", "id": 67325, "text": "(2) Sharing when you get your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After obtaining your explicit consent, we will share your personal information with other parties."}
{"task": "rw_89.jsonl", "id": 67326, "text": "(3) Sharing when it is necessary to conclude and perform a contract with you as a party: When you purchase goods or services through Youku, we will share the necessary transaction-related information in your order information with you according to your choice. Providers of related goods or services to meet your transaction, delivery and after-sales service needs.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "According to your choice, the necessary information related to the transaction will be shared with the provider of the relevant goods or services."}
{"task": "rw_89.jsonl", "id": 67327, "text": "(4) Sharing with affiliated companies: In order to facilitate us to provide some services to you with affiliates, to provide you with products and/or services based on Youku accounts, recommend information that you may be interested inPersonal property of the company or other users or the public is unruly, and your personal information may be shared with our affiliated company and/or its designated service provider.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_89.jsonl", "id": 67328, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only share the necessary personal information. If you share the use and processing purpose of sensitive personal information or related companies to change personal information, you will once again solicit your authorization consent."}
{"task": "rw_89.jsonl", "id": 67329, "text": "Please note that the information you share voluntarily or even publicly when using our services may involve personal information or even sensitive personal information of you or others.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67330, "text": "Please consider and make a decision more carefully.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67331, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67332, "text": "We may entrust authorized partners to process your personal information so that authorized partners can provide you with certain services or perform functions on our behalf.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May entrust a partner to handle your personal information."}
{"task": "rw_89.jsonl", "id": 67333, "text": "We will only entrust them to process your information for the legal, legitimate, necessary, specific, and clear purposes stated in this policy. Authorized partners can only have access to the information they need to perform their duties, and we will require them not to Use this information for any other purpose beyond the entrustment.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only be entrusted to process your information for the legal, legitimate, necessary, specific, and clear purposes stated in this policy."}
{"task": "rw_89.jsonl", "id": 67334, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_89.jsonl", "id": 67335, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The authorized partners we commission include the following types:"}
{"task": "rw_89.jsonl", "id": 67336, "text": "(1) Authorized partners of advertising and analysis services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The entrusted authorized partners include: authorized partners for advertising and analysis services."}
{"task": "rw_89.jsonl", "id": 67337, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of using industry -universal security technology, they will commission these partners to handle information about advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_89.jsonl", "id": 67338, "text": "We will not commission your personal identity information to commission partners.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67339, "text": "(2) Suppliers, service providers and other partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The entrusted partners include: suppliers, service providers and other partners."}
{"task": "rw_89.jsonl", "id": 67340, "text": "We entrust the processing of information to suppliers, service providers and other partners who support our business, including technical infrastructure services commissioned by us, analysis of how our services are used, customer service, payment facilitation or academic Research and investigate.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to the suppliers, service providers and other partners who support our business."}
{"task": "rw_89.jsonl", "id": 67341, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Our applications are embedded in SDK or other similar applications of authorized partners."}
{"task": "rw_89.jsonl", "id": 67342, "text": "We will conduct strict security inspections on the application program interface (API) and software tool development kit (SDK) for authorized partners to obtain relevant information, and agree with authorized partners on strict data protection measures to make them comply with this policy and any other relevant confidentiality and security measures to process personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly test the application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information, and strict data protection measures with authorized partners."}
{"task": "rw_89.jsonl", "id": 67343, "text": "Except for the authorized partners to obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Authorized partners do not need to strictly follow security measures to process personal information if they obtain your consent separately."}
{"task": "rw_89.jsonl", "id": 67344, "text": "You can click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_89.jsonl", "id": 67345, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67346, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you need to transfer personal information for merging, separation, dissolution, and declaration of bankruptcy, you will inform the receiver's name or name and contact information to you."}
{"task": "rw_89.jsonl", "id": 67347, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67348, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_89.jsonl", "id": 67349, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67350, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, you will publicly disclose your personal information:"}
{"task": "rw_89.jsonl", "id": 67351, "text": "(1) Based on your initiative and other individual consent, we may disclose your personal information publicly;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on your active choice and other individual consent, we may publicly disclose your personal information."}
{"task": "rw_89.jsonl", "id": 67352, "text": "(2) If we determine that you have violated laws and regulations or seriously violated Youku related agreements and rules, or for protecting the security of Youku users or the public's personal property, we may disclose your personal information, including related violations, including related violations,And the measures we have taken.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you violate the law, or to protect personal and property safety, we may disclose your personal information."}
{"task": "rw_89.jsonl", "id": 67353, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67354, "text": "You can view and manage your information in the following ways, and we will respond to your request in compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information through the following ways. We will respond to your request in the case of compliance with laws and regulations:"}
{"task": "rw_89.jsonl", "id": 67355, "text": "(1) Review, correction and supplement", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67356, "text": "If you wish to review, correct and supplement your basic personal information and payment information in your account, change your password, add security information or close your account, etc., you can log in to your account and perform such operations through \"Account Management\";", "label": ["Important", "Edit/Control"], "rewrite": "If you want to check, correct and supplement personal information, you can log in to the account to perform such operations through \"account management\"."}
{"task": "rw_89.jsonl", "id": 67357, "text": "For example, you can log in to \"My Account\" on the PC or APP to query and modify your personal information, privacy settings, security settings, and modify your personal registration information.", "label": ["Edit/Control", "Important"], "rewrite": "You can log in to \"My Account\" on the PC or APP to query and modify your personal information, privacy settings, security settings, and modify your personal registration information."}
{"task": "rw_89.jsonl", "id": 67358, "text": "(2) Delete", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67359, "text": "You can delete part of your information through the path listed in \"(1) Review, Correction and Supplement\", or apply for account cancellation to delete all your information.", "label": ["Edit/Control", "Important"], "rewrite": "You can delete part of your information through the path listed in \"(1) Review, Correction and Supplement\", or apply for account cancellation to delete all your information."}
{"task": "rw_89.jsonl", "id": 67360, "text": "In the following circumstances, you can make a request to delete personal information by contacting our customers:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information by contacting our customers:"}
{"task": "rw_89.jsonl", "id": 67361, "text": "(1) If our handling of personal information violates laws and regulations;", "label": ["Important", "Edit/Control"], "rewrite": "If our handling of personal information violates laws and regulations, you can apply for deletion."}
{"task": "rw_89.jsonl", "id": 67362, "text": "(2) If we collect and use your personal information without your explicit consent;", "label": ["Important", "Edit/Control"], "rewrite": "If we collect and use your personal information without your explicit consent, you can apply for deletion."}
{"task": "rw_89.jsonl", "id": 67363, "text": "(3) If our handling of personal information seriously violates the agreement with you;", "label": ["Important", "Edit/Control"], "rewrite": "If our handling of personal information seriously violates the agreement with you, you can apply for deletion."}
{"task": "rw_89.jsonl", "id": 67364, "text": "(4) If our processing purpose has been achieved, cannot be achieved or is no longer necessary to achieve the processing purpose;", "label": ["Edit/Control", "Important"], "rewrite": "You can request deletion if our processing purposes have been achieved, are no longer possible or are no longer necessary to achieve the processing purposes."}
{"task": "rw_89.jsonl", "id": 67365, "text": "(5) If we stop providing products or services, or the retention period has expired.", "label": ["Important", "Edit/Control"], "rewrite": "If we stop providing products or services, or the storage period has expired, we can apply for deletion."}
{"task": "rw_89.jsonl", "id": 67366, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the subject who obtained your personal information from us as much as possible and ask them to delete it in a timely manner."}
{"task": "rw_89.jsonl", "id": 67367, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Risk", "Edit/Control", "Data Security", "Important"], "rewrite": "When information is deleted, we may not be able to immediately delete the corresponding information from backup systems, which will be stored securely and restricted from further processing until the backup can be purged or anonymized."}
{"task": "rw_89.jsonl", "id": 67368, "text": "(3) Changing the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67369, "text": "You can change or withdraw your authorization to us to collect and process your personal information in the following ways:", "label": ["Important", "Edit/Control"], "rewrite": "The scope of your authorization to collect and process your personal information can be changed or withdrawn in the following ways:"}
{"task": "rw_89.jsonl", "id": 67370, "text": "(1) Manage authorization in \"My-Settings-Privacy-Privacy Settings of Personal Homepage\".", "label": ["Important", "Edit/Control"], "rewrite": "Management authorization in \"Mine-Settings-Privacy-Personal Home Personal Privacy Settings\"."}
{"task": "rw_89.jsonl", "id": 67371, "text": "(2) Manage the system permissions authorized by managing APP in \"My-Settings-Privacy-System permissions\"/\"Mine-Settings-Privacy-Other Settings\".", "label": ["Edit/Control", "Important"], "rewrite": "Manage the system permission authorization used by App in \"My-Settings-Privacy-System Permissions\"/\"My-Settings-Privacy-Other Settings\"."}
{"task": "rw_89.jsonl", "id": 67372, "text": "(3) Manage the application you have authorized in \"My-Settings-Account Security Center-Binding Account\".", "label": ["Edit/Control", "Important"], "rewrite": "Manage your authorized applications in \"My-Settings-Account Security Center-Bind Account\"."}
{"task": "rw_89.jsonl", "id": 67373, "text": "For the authorization that you cannot directly set through the above methods, you can modify it through customer service contact, but please note that for some types of personal information, such as the information necessary for the basic functions of Youku or the necessaryInformation, we may not be able to respond to your request to change the scope of authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For the authorization that you cannot directly set through the above method, you can modify it through customer service contact. For some types of personal information, you may not be able to respond to your request that you change the scope of authorization."}
{"task": "rw_89.jsonl", "id": 67374, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_89.jsonl", "id": 67375, "text": "However, your decision to withdraw your authorization will not affect our previous processing of personal information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to withdraw authorization will not affect the personal information processing we carried out based on your authorization."}
{"task": "rw_89.jsonl", "id": 67376, "text": "(4) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67377, "text": "You can apply for a cancellation of your account in the following ways:", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67378, "text": "(1) On the \"Logging out\" page (for example, the mobile phone Youku APP \"My-Settings-Account Security Center-Account Logging\", PC-end Youku Homepage, My-Account Setting-Security Center-Account Logging)Essence", "label": ["Important", "Edit/Control"], "rewrite": "Submit an account cancellation application on the \"Logging out\" page."}
{"task": "rw_89.jsonl", "id": 67379, "text": "(2) Contact customer service to apply for cancellation of your account.", "label": ["Important", "Edit/Control"], "rewrite": "Apply for your account through customer service."}
{"task": "rw_89.jsonl", "id": 67380, "text": "After you take the initiative to cancel your account, we will stop providing you with products and/or services, and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After actively canceling the account, we will stop providing you with products and/or services, and delete or anonymous processing your personal information."}
{"task": "rw_89.jsonl", "id": 67381, "text": "(5) Automatic decision -making of constraint information systems", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67382, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67383, "text": "If these decisions significantly affect your legitimate rights and interests, you can contact us through customer service.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67384, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67385, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated in the laws of the People's Republic of China and other applicable laws, you can contact us through customer service or directly to us to usPersonal information protection full -time departments initiated complaints.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67386, "text": "We will make a reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67387, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67388, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit."}
{"task": "rw_89.jsonl", "id": 67389, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or requires too much technical means, bring risks or unrealistic requests to others' legitimate rights and interests, we may refuse."}
{"task": "rw_89.jsonl", "id": 67390, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67391, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67392, "text": "We will only retain your personal information within the time limit of the cost of reaching the cost of the cost, unless the law has compulsory retention requirements.", "label": ["Data Retention", "Important"], "rewrite": "You will only retain your personal information within the period required for the purpose of the cost of reaching the cost of the cost, unless the law has a compulsory retention requirement."}
{"task": "rw_89.jsonl", "id": 67393, "text": "And we judge the standards of the aforementioned period include:", "label": ["Data Retention", "Important"], "rewrite": "We judge the standards of the storage period include:"}
{"task": "rw_89.jsonl", "id": 67394, "text": "(1) Complete your service purposes, maintain corresponding services and business records, and cope with your possible inquiries or complaints;", "label": ["Data Retention", "Important"], "rewrite": "The criteria for judging the storage period include: to complete your related service purposes, maintain the corresponding service and business records, and deal with your possible queries or complaints."}
{"task": "rw_89.jsonl", "id": 67395, "text": "(2) Make sure we provide you with service safety and quality;", "label": ["Data Retention", "Important"], "rewrite": "The criteria for judging the storage period include: to ensure the safety and quality of services to you."}
{"task": "rw_89.jsonl", "id": 67396, "text": "(3) Do you agree to a longer retention period;", "label": ["Data Retention", "Important"], "rewrite": "The criteria for judging the storage period include: whether you agree with the longer retention period."}
{"task": "rw_89.jsonl", "id": 67397, "text": "(4) Whether there are other special agreements in the reserved period.", "label": ["Data Retention", "Important"], "rewrite": "The criteria for judging the storage period include: whether there are other special agreements in the reserved period."}
{"task": "rw_89.jsonl", "id": 67398, "text": "After your personal information exceeds the retention period, we will delete your personal information according to the requirements of the applicable law, or make it anonymous processing.", "label": ["Data Retention", "Important"], "rewrite": "After your personal information exceeds the reserved period, you will delete your personal information according to the requirements of the law or make it anonymous processing."}
{"task": "rw_89.jsonl", "id": 67399, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67400, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in the operation of the People's Republic of China will be stored in China."}
{"task": "rw_89.jsonl", "id": 67401, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important"], "rewrite": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:"}
{"task": "rw_89.jsonl", "id": 67402, "text": "(1) Applicable laws have clear stipulation;", "label": ["Data Retention", "Important"], "rewrite": "Applicable laws have clearly stipulated and provided personal information to overseas."}
{"task": "rw_89.jsonl", "id": 67403, "text": "(2) Get your individual consent;", "label": ["Data Retention", "Important"], "rewrite": "Those who get your own consent will provide personal information to overseas."}
{"task": "rw_89.jsonl", "id": 67404, "text": "(3) You are necessary for cross -border e -commerce transactions and other types of contracts for one party.", "label": ["Data Retention", "Important"], "rewrite": "The necessary information is required to be established and fulfilled to provide personal information to overseas."}
{"task": "rw_89.jsonl", "id": 67405, "text": "(4) In response to the above situations, we will protect your personal information security in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67406, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67407, "text": "(1) Data protection technical measures", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67408, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "It has adopted the industry's standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, publicized, modified, damaged or lost by unauthorized access, publicly disclosing, use, modification, damage or loss."}
{"task": "rw_89.jsonl", "id": 67409, "text": "For example, we will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, the SSL protocol is encrypted and protected, and we provide the HTTPS protocol security browsing method;", "label": ["Important", "Data Security"], "rewrite": "I will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, you are protected by SSL protocols. We provide the HTTPS protocol security browsing method."}
{"task": "rw_89.jsonl", "id": 67410, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_89.jsonl", "id": 67411, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "The access control mechanism will be deployed to ensure that only authorized personnel can access personal information."}
{"task": "rw_89.jsonl", "id": 67412, "text": "At present, our important information systems have been protected by network security levels and above the third evaluation and ISO27001 certification.", "label": ["Important", "Data Security"], "rewrite": "Our important information systems have been evaluated through three or above the network security level and ISO27001 certification."}
{"task": "rw_89.jsonl", "id": 67413, "text": "(2) Data protection management organization measures", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67414, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "Establish a data security management system that is advanced in the industry with data as the core and data life cycle."}
{"task": "rw_89.jsonl", "id": 67415, "text": "We have set up a full -time department for personal information protection and designated the protection of personal information for children.", "label": ["Specific Audiences", "Important", "Data Security"], "rewrite": "We have set up a full -time department for personal information protection and designated the protection of personal information for children."}
{"task": "rw_89.jsonl", "id": 67416, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information."}
{"task": "rw_89.jsonl", "id": 67417, "text": "(3) Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67418, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "If the information is unauthorized access, publicly disclosed, tampered with or destroyed, leading to damage to your legitimate rights and interests, we will start emergency plans in time."}
{"task": "rw_89.jsonl", "id": 67419, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, the basic situation and possible impact, disposal measures, suggestions, and remedies will be informed of you."}
{"task": "rw_89.jsonl", "id": 67420, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "I will inform you with SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish announcements in a reasonable and effective way."}
{"task": "rw_89.jsonl", "id": 67421, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_89.jsonl", "id": 67422, "text": "(4) Prevention of account security risk", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67423, "text": "When using our products and/or services, you inevitably disclose your personal information to the other party or the potential transaction of the transaction, such as contact or contact address.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67424, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67425, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67426, "text": "If you are worried that your personal information, especially your account or password, please contact our customer service immediately so that we can take corresponding measures according to your application, you can also be in \"My-Settings-Account and Security Center-Security Center\"Autonomous\" login equipment management \".", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67427, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67428, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67429, "text": "When the new service and business processes change, we may update our privacy policies, to inform you the specific changes through the announcement of Youku platform announcement or system message and other appropriate ways.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67430, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67431, "text": "For major changes, we will also provide more significant notifications (including we will provide you with pop -up window prompts).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide more significant notifications (including we will provide you with pop -up window prompts)."}
{"task": "rw_89.jsonl", "id": 67432, "text": "The major changes in this policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67433, "text": "1. The business model of the product has changed significantly.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67434, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67435, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67436, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67437, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67438, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67439, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67440, "text": "We will also archive the old version of this policy on the special page of Youku for you to check.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67441, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67442, "text": "We attach great importance to the protection of personal information for minors.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67443, "text": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, you will use our services or provide information to us on the premise of obtaining the consent of the guardian."}
{"task": "rw_89.jsonl", "id": 67444, "text": "If you are under 14 years of age, before you use our service, you and your guardian should read our \"Youku Children's Personal Information Protection Rules\" that we have specially formulated to ensure that the guardian's \"Youku Children's Personal Information Protection RulesAfter the consent, you can use our services under the guidance of the guardian to ensure that you are safe when using our services and trading.", "label": ["Specific Audiences", "Important"], "rewrite": "Before we use our services under the age of 14, you and the guardian should carefully read the \"Youku Children's Personal Information Protection Rules\" that we specially formulated to ensure that after obtaining the consent of the guardian, we can use services under the guidance of the guardian."}
{"task": "rw_89.jsonl", "id": 67445, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child's guardian, please pay attention to whether children use our services after obtaining authorization consent."}
{"task": "rw_89.jsonl", "id": 67446, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have questions about your personal information, please contact our personal information protection full -time department."}
{"task": "rw_89.jsonl", "id": 67447, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67448, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67449, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through Youku online customer service;", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67450, "text": "2. We have also set up a full-time department for personal information protection. You can contact it through pipwg@service.alibaba.com (please indicate that it is related to Youku and explain the specific facts), or call customer service phone: 400-810-0580(Free business), 400-810-3568, (member business), office address: Alibaba Central Center, Building 4, Building 4, Wangjing, Beijing-Wangjing B, Block B Youku Legal Affairs, Zip Code 100102.", "label": ["Important", "Contact Information"], "rewrite": "Establish a full-time department for personal information protection, you can contact it through pipwg@service.alibaba.com, or call customer service: 400-810-0580 (free business) 400-810-3568 (member business), office address: Beijing WangwangwangAli Central Center, Building 4, Building 4, JD Garden-1,00102 of Youku Legal Department of Block B of Wangjing B."}
{"task": "rw_89.jsonl", "id": 67451, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67452, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67453, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67454, "text": "Youku: It refers to Youku.com operated by Youku Information Technology (Beijing) Co., Ltd., and the carrier includes but not limited to web pages (youku.com), APP applications, applets, etc.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67455, "text": "Related company: Refers to the affiliated company of Youku service providers disclosed by the latest listed company annual report of Alibaba Group Holding Limited (Alibaba Group Holding Limited.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67456, "text": "Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67457, "text": "Sensitive personal information: Once sensitive personal information is leaked or illegally, it is easy to lead to personal information that is harmful to natural person's personality dignity or personality and property security.Track information, and personal information of minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67458, "text": "Personal information deletion: Refers to removing personal information in a system involved in daily business functions, so that it keeps them from being retrieved and accessed.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67459, "text": "Child: Refers to minors under the age of 14.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67460, "text": "Equipment information: Including device identifiers (IMEI, IDFA, Android ID, Mac, OAID, IMSI and other device -related information), application information (application crash information, notification switch status, application installation list, and other application related information), equipment parameters), equipment parametersAnd system information (device type, device model, operating system and hardware -related information), device network environment information (IP address, WIFI information, base station information and other network -related information).", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67461, "text": "The actual collection of the product shall prevail.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67462, "text": "Service log information: Including search and browsing records, attention, playback records, visits, playback duration, IP address, WLAN network, telecommunications operator network, language, access date and time.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67463, "text": "Decoration: Refers to the process of personal information processing, so that it cannot recognize specific natural persons without using additional information.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67464, "text": "Anonymous: Refers to the process that personal information cannot identify specific natural persons and cannot recover.", "label": [], "rewrite": []}
{"task": "rw_89.jsonl", "id": 67465, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
