{"task": "rw_80.jsonl", "id": 64456, "text": "Private Information Protection Policy in Himalaya Platform", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64457, "text": "Version update date: June 22, 2022", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64458, "text": "Version release date: June 22, 2022", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64459, "text": "This privacy information protection policy version: 2022 V25", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64460, "text": "introduction", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64461, "text": "Shanghai Himalaya Technology Co., Ltd. and its affiliated companies (hereinafter referred to as \"Himalayan Company\" or \"We\", registered address: Room 2062, Building 2, No. 588, Zixing Road, Minhang District, Shanghai) respects and protects all the use of the Himalayan (www.ximalayaa.com), Himalayan FM mobile client, Himalaya Edition client, Himalayan children's version client, Himalayan vehicle, Himalayan \"light school\" (tentative name), and subsequent \"Himalayan\" related platforms operated by Himalayan company(Here, called the \"Himalaya Platform\" or \"Platform\") users (hereinafter referred to as \"you\") personal privacy and information security.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64462, "text": "In view of this, the Himalayan company formulates the \"Himalayan Personal Information Protection Policy\" (hereinafter referred to as \"this policy\"), and confirmed that during the use of your Himalaya platform service, the Himalayan company collected, stored, used, disclosed, and protected your personal individuals.Related matters.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64463, "text": "This policy is the general privacy policy terms that our platforms are uniformly applicable, which is suitable for all products and services provided by our platform.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64464, "text": "If we use the products or services provided by Himalayan in the affiliated company's products or services but have not set up independent privacy policies, this part of this product or service is also applicable to this policy.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64465, "text": "If the affiliated company sets a privacy policy separately for the specific products or services that it provides you, the content of the corresponding privacy information protection policy is given priority. The content that the corresponding privacy information protection policy is not covered. If this policy is agreed, the content of this policy shall be based on the content of this policy.Make a prevailing.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64466, "text": "Before using the Himalayan products or services, please be sure to read and thoroughly understand this policy, especially the clauses that are identified by the threading of the threatened/coarse body. You should focus on reading and start using it after confirming and consent.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64467, "text": "If you/your guardian does not agree with any content of the privacy policy, you should stop using it immediately.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64468, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the various contact information provided by us.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64469, "text": "The first part definition", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64470, "text": "1. Personal information: Personal information is a variety of information related to recognized or recognized natural persons recorded in electronics or other ways, excluding information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64471, "text": "2. Sensitive personal information: Once leaked or illegally used, it is easy to cause personal information of natural person's personality and dignity to be infringed or personal and property security.Such information, and personal information under minority at the age of 14.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64472, "text": "Sensitive information will make a thickened plus line prompt in this policy.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64473, "text": "3. Delete of personal information: Refers to removing personal information in a system involved in daily business functions, so that it keeps them from being retrieved and accessible.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64474, "text": "4. Our platform: Including the operation of the Himalayan or Himalayan associated companies, but not limited to but not limited to the Himalayan application (APP), the Himalayan website (http://www.ximalaya.com), the Himalayan vehicle application, the Himalayan open API/SDK platform, Himalaya's \"Light School\" platform and other network platforms related to Himalayan FM related to the newly developed or operated by Himalayan or Himalayan related companies.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64475, "text": "5. Our platform service: We are based on the Internet, including our platform website, client (including the App \\ APK \\ SDK \\ API method), and conduct content distribution, information network dissemination, Internet audio and video business and other methods.Various forms (including new service forms that emerge in future technology development) provide you with various services.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64476, "text": "6. Our platform rules: including all rules, user service agreements, interpretations, announcements, other contents, and all platforms that have been published and subsequent in all our platforms and clientsAll kinds of rules, implementation rules, product descriptions, announcements, and platform specifications of various forms.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64477, "text": "7. Related Company: It refers to companies and institutions under the control of Shanghai Himalayan Technology Co., Ltd., under the control of Shanghai Himalaya Technology Co., Ltd. or under the control of Shanghai Himalaya Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64478, "text": "Control refers to the ability to directly or indirectly affected the controlled management/operation of the controlled objects directly or indirectly through ownership, contract, actual operation association, or other methods identified in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64479, "text": "Part 2 Privacy Protection Policy", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64480, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64481, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64482, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64483, "text": "3. How can we share, transfer and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64484, "text": "4. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64485, "text": "5. How do we protect your personal information security", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64486, "text": "6. How do we protect the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64487, "text": "7. How do you exercise your personal information rights", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64488, "text": "8. How to revise this policy", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64489, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64490, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64491, "text": "Because there are many types of products and services provided to you, we will collect and use your personal information according to the specific product/service scope and different functions according to the principles of legal, legitimacy and necessary principles.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "We will collect and use your personal information based on the specific product/service scope and different functions, follow the principles of legal, legitimate and necessary principles."}
{"task": "rw_80.jsonl", "id": 64492, "text": "You understand and agree that, based on the purpose of continuously improving products and services, we will launch optimization functions from time to time, which may increase or change the scope, purpose, and methods of using personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Based on the purpose of continuously improving products and services, we will launch optimization functions from time to time, which may increase or change the scope, purpose, and methods of using personal information."}
{"task": "rw_80.jsonl", "id": 64493, "text": "In this regard, we will clearly explain to you by updating this policy, pop -up window or in -site letter, and provide you with an option that consent or not.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will clearly explain to you by updating this policy, pop -up window or in -site notification method, and provide you with an option that consent or not."}
{"task": "rw_80.jsonl", "id": 64494, "text": "You have the right to refuse to agree to the update of this policy, but you also know and understand that once you reject us to collect and handle your personal information, it is necessary to implement the update service or function, we may not be able to provide you with the updated update.Services and functions, or the effect of updating services, but your original normal function is not affected.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64495, "text": "Here we will tell you one of the necessary personal information types needed one by one, and prompt you to be authorized to authorize the authority when you use the specific function scenario.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64496, "text": "(1) Provide you with audio search, browsing and playback functions", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64497, "text": "You can use the basic functions we provided by tourists, including the search, browsing and playback of audio works.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64498, "text": "In order to ensure the implementation of the above functions and fulfill the security obligations of the network system operation, we will collect your necessary device information (device model, device MAC address, operating system version, unique mobile device recognition codeCard and IMSI information), allocate exclusive identifiers for you, and record the operating information under your tourist based on this identifier, that is, you can browse and collect records and save them in the form of log files.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your necessary device information to allocate exclusive identifies for you."}
{"task": "rw_80.jsonl", "id": 64499, "text": "In addition, in your use process, we may apply for your storage authority in order to record your log information and cache content;", "label": ["Permission Acquisition", "Important"], "rewrite": "During your use, we may apply for your storage authority in order to record your log information and cache content."}
{"task": "rw_80.jsonl", "id": 64500, "text": "We may also need to apply for location information so that we can provide you with more accurate content.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also need to apply for location information so that we can provide you with more accurate content."}
{"task": "rw_80.jsonl", "id": 64501, "text": "You can also choose to be a platform registered user to accept more high -quality and personalized online audio and video services.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64502, "text": "Please note that you have the right to refuse to provide corresponding personal information in the following functions, and you refuse to affect the implementation of the corresponding individual functions, and it does not affect your basic functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "You have the right to refuse to provide corresponding personal information in the following functions, and you refuse to influence the implementation of the corresponding individual functions, and it does not affect your basic functions."}
{"task": "rw_80.jsonl", "id": 64503, "text": "We will collect your personal information based on the following goals:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64504, "text": "(2) Help you register and maintain the platform account", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64505, "text": "1. Basic account creation", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64506, "text": "When you create an account on our platform, in order to become our member registered users so that we can provide you with registered user membership services, you need to provide (1) mobile phone number;", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide a mobile phone number."}
{"task": "rw_80.jsonl", "id": 64507, "text": "Create (2) username and set a password in the Himalayan APP.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64508, "text": "Collecting the above information is used to provide you with account login service and ensure your account security. If you refuse to provide your mobile phone number, you will not be able to complete the registration and basic account creation, but it does not affect other functions of your use of Himalayan normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide a mobile phone number, you will not be able to complete the registration and basic account creation, but it does not affect your normal use of Himalayan."}
{"task": "rw_80.jsonl", "id": 64509, "text": "Avatar, nickname and ID information;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you log in with an account on a third -party platform, if you decide to bind the Himalayan account, after you are authorized, the third -party platform will synchronize your mobile phone number, avatar, nickname and ID information with us."}
{"task": "rw_80.jsonl", "id": 64510, "text": "When you log in with Android devices (Xiaomi, Meizu, Huawei), after you are authorized, we will use account permissions on the search device to find account information on your Android device.", "label": ["Permission Acquisition", "Important"], "rewrite": "When you log in with Android devices, after you are authorized, we will use the account permissions on the search device to find the account information on your Android device."}
{"task": "rw_80.jsonl", "id": 64511, "text": "Collecting the above information is used to provide you with account login service and ensure your account security. If you refuse to authorize such information, you will not be able to use the account of the third -party platform to log in to our platform, but it will not affect your normal use of the Himalayan otherFunction.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collecting the above information is used to provide you with account login service and ensure your account security. If you refuse to authorize such information, you will not be able to log in to our platform with an account on a third -party platform."}
{"task": "rw_80.jsonl", "id": 64512, "text": "You can bind or unbind your third-party platform account in [Settings-Account and Security-Account Binding] at any time. Your unblocking will not affect your basic service function.", "label": ["Important", "Edit/Control"], "rewrite": "You can bind or unbind your third-party platform account in [Settings-Account and Security-Account Binding] at any time. Your unblocking will not affect your basic service function."}
{"task": "rw_80.jsonl", "id": 64513, "text": "2. Recovery of data maintenance and account number", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64514, "text": "a. In order to maintain your basic information and improve your service experience, you can choose to fill in the necessary personal information, including your email, gender, location, avatar, nickname, birthday, personal profile;", "label": ["Important", "First Party Collection Information"], "rewrite": "You can choose to fill in the necessary personal information, including your email, gender, location, avatar, nickname, birthday, personal profile."}
{"task": "rw_80.jsonl", "id": 64515, "text": "You can also choose to fill in your baby's gender and birthday in the baby information interface. We will recommend you on the children's channel based on the information you fill in.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can also choose to fill in your baby's gender and birthday in the baby information interface. We will recommend you on the children's channel based on the information you fill in."}
{"task": "rw_80.jsonl", "id": 64516, "text": "If you choose not to provide this information, it will not affect your basic service function.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose not to provide this information, it will not affect your basic service function."}
{"task": "rw_80.jsonl", "id": 64517, "text": "b. If your account is lost, you can find your account.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64518, "text": "If you forget the account password, you can verify the text message, or contact the customer service to find the password or reset the password.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64519, "text": "You can also change the mobile phone number for changing and unbinding.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64520, "text": "But in the process, you need to provide some information to verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "But in the process, you need to provide some information to verify your identity."}
{"task": "rw_80.jsonl", "id": 64521, "text": "We may need you to provide your identity information, mobile phone numbers, frequent login locations, frequently log in device, often listen to content, registration time and city information;", "label": ["Important", "First Party Collection Information"], "rewrite": "We may need you to provide your identity information, mobile phone numbers, frequent login locations, frequently log in device, often listen to content, registration time and city information."}
{"task": "rw_80.jsonl", "id": 64522, "text": "To verify your true identity, you may also verify your true identity through face recognition if necessary.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64523, "text": "3. The creation of anchor account and authentication", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64524, "text": "When you create an anchor account on our platform, according to the requirements of relevant laws and regulations, you need to conduct real -name certification. In the process, you need to provide (1) the information of the unit;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64525, "text": "(2) Reception record;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the records."}
{"task": "rw_80.jsonl", "id": 64526, "text": "(3) ID number;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect ID number information."}
{"task": "rw_80.jsonl", "id": 64527, "text": "(4) Face feature information (for face verification);", "label": ["Important", "First Party Collection Information"], "rewrite": "Collection of face feature information (for face verification) information."}
{"task": "rw_80.jsonl", "id": 64528, "text": "(5) Photos on the front and back of the ID card.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information on the front and back of the ID card."}
{"task": "rw_80.jsonl", "id": 64529, "text": "In addition, you can also choose to perform job certification, celebrities coffee certification, institutional certification, MCN institutional certification, brand enterprise certification, the above certification needs to be provided: (1) institutional information;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information."}
{"task": "rw_80.jsonl", "id": 64530, "text": "(2) Operator information;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect operator information."}
{"task": "rw_80.jsonl", "id": 64531, "text": "(3) Qualification information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect qualification information."}
{"task": "rw_80.jsonl", "id": 64532, "text": "You can also choose healthy/financial qualification certification. According to the State Cyber Information Office's \"Regulations on the Management of Internet User Public Account Information Service\", public accounts involving health and financial professional content categories must be certified by professional qualifications. The above certification needs to be provided: health, health,Professional qualifications or job certificates involved in the field of finance.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information such as professional qualifications or job certificates involved in the field of health and finance."}
{"task": "rw_80.jsonl", "id": 64533, "text": "By completing different certifications, we will provide you with targeted services such as: anchor traffic support.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64534, "text": "If you refuse to provide the above -mentioned certification information, it will make you unable to become the anchor of this platform and upload creative content, but it does not affect other functions of your use of Himalayan normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above -mentioned certification information, it will make you unable to become the anchor of this platform and upload creative content, but it does not affect other functions of your use of Himalayan normally."}
{"task": "rw_80.jsonl", "id": 64535, "text": "Regarding the personal information of how this platform is collected, processed, and certified anchor, it can be seen that the Himalayan anchor certification agreement is specific.", "label": ["Important", "First Party Collection Information"], "rewrite": "Regarding the personal information of how this platform is collected, processed, and certified anchor, it can be seen that the Himalayan anchor certification agreement is specific."}
{"task": "rw_80.jsonl", "id": 64536, "text": "(3) Help you upload or publish information and videos, establish friends contact", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64537, "text": "If you uploaded videos or photos, publish information release activities such as barrage, comments, messages, or posting, according to the requirements of the current laws and regulations, you may also need to provide the following information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64538, "text": "1., the necessary real -name information", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the necessary real -name information."}
{"task": "rw_80.jsonl", "id": 64539, "text": "a. In order to ensure the security of content, avoid suspicious account invasion platform users and the audience, and fulfill the legal obligations of purifying the network space, we may require additional or batch users who upload junk advertisements, junk videos or illegal content, and the accumulated audio duration to reach the cumulative time to reachA certain number of users, upload the real -name authentication of the ID number, ID card, and the same frame. If you refuse to provide it, we have the right to temporarily turn off your audio release needs.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64540, "text": "b. According to the requirements of the national regulatory agency, the account registered overseas needs to fully implement the real name system.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64541, "text": "To this end, we will provide additional information on overseas registered accounts to provide real -name information, and we must open up upload videos and release video functions for you after the platform approval.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will ask for additional information on overseas registered accounts to provide real -name information."}
{"task": "rw_80.jsonl", "id": 64542, "text": "The above information is necessary for you to upload and release audio, video, and information on our platform, but it does not provide the above information without affecting your basic service functions of our platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64543, "text": "2. Establish a friend contact and share information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64544, "text": "You can build friends and share with each other through our services.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64545, "text": "When you create communication, transactions or content sharing through our service, you can choose the objects of communication, transactions or sharing. They will see public information such as your membership level, nicknames, and information content you share and communicate.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64546, "text": "Public information refers to any information you shared publicly, including your comments, barrage, follow -up reviews, your avatars, nicknames, and user names.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64547, "text": "The content and information you shared when you use our services may involve personal information of others. Please confirm that you have obtained legal authorization of others.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64548, "text": "At the same time, you are obliged to protect your personal information properly and provide and show your information to others only under the necessary situation.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64549, "text": "If you find your personal information leakage, especially your account or password leak, please contact the Himalaya platform customer service immediately.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64550, "text": "(4) Help you participate in platform marketing promotion and operation and operation interaction activities", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64551, "text": "If you participate in the marketing promotion and operation and interactive activities of our platform, such as drawing, guessing, answering questions, questionnaires, browsing advertisements (including third -party partner advertisements), or business cooperation and services with our platform, mayYou need to submit the relevant information necessary for participating in the event.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you participate in the marketing promotion and operation and interactive activities of our platform, you may need to take the initiative to submit the relevant information necessary for participating activities."}
{"task": "rw_80.jsonl", "id": 64552, "text": "For example, when you receive red envelopes and redeem awards, you need to submit your ID information to the tax institution;", "label": ["Important", "First Party Collection Information"], "rewrite": "When you receive a red envelope and redeem the award, you need to submit your ID information to the tax institution."}
{"task": "rw_80.jsonl", "id": 64553, "text": "In order to send prizes or activities to you, you also need to provide contact address information.", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to send prizes or activities to you, you also need to provide contact address information."}
{"task": "rw_80.jsonl", "id": 64554, "text": "Regarding how these marketing promotion and operation activities are collected and using your personal information, you can refer to the text prompt text on the corresponding H5 page.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64555, "text": "If you refuse to provide the above information, it will make you unable to participate in platform marketing promotion and operation and interactive activities, but it will not affect other functions of your use of Himalayan normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, it will make you unable to participate in platform marketing promotion and operation and interactive activities, but it will not affect other functions of your use of Himalayan normally."}
{"task": "rw_80.jsonl", "id": 64556, "text": "When you participate in our platform marketing promotion or operating interactive activity page, in order to improve the fun and interaction of your participation in the above activities, some pages need to shake, shake, and twist your mobile devices on some pages (such as the page prompt \"shake\" and shake\"Wait, the specific page prompts are subject to) participate in activities or receive corresponding rights.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you participate in our platform marketing promotion or operation interactive activity page, in order to improve the fun and interaction of your participation in the above -mentioned activities, some pages need to shake, shake, and twist your mobile devices on some pages."}
{"task": "rw_80.jsonl", "id": 64557, "text": "In this business situation, Himalayan will use your sensor information (please know that simple sensor data is not personal information) identification and judging your device status to determine whether you successfully participate in the above interaction scenarios.", "label": ["Important", "First Party Collection Information"], "rewrite": "Himalayan will use your sensor information to identify your device status to determine whether you successfully participate in the above interaction scenarios."}
{"task": "rw_80.jsonl", "id": 64558, "text": "(5) Provide you with personalized recommendations and security services", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64559, "text": "In order to recommend more suitable personalized content to you, optimize the search results, to show you or recommend the search results and content with a higher degree of correlation (rather than generally pushed), to generate exclusive listening reports for you, and at the same time understand the products of different hardware equipment for different hardware equipment.Adaptability, ensuring the safety of the operation environment, and the abnormal status of the account number, we will collect the following information:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64560, "text": "1.Equipment information: We will receive and record the equipment related information you use according to your specific operations in software installation and use (including device model, hardware serial number, device MAC address, operating system version, device settings, unique device recognition recognition, unique device recognition identificationCode (IMEI, Android, IDFA, IDFV, SIM card, and IMSI information), UUID, necessary mobile application list information, software and hardware and equipment, equipment environment information, sensor information), information related to the location of the device (in order to identify and judge judgment judgmentThe copyright of the content of your area needs to collect the accurate location of your authorized GPS, as well as WLAN access points and base stations, sensor information).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will receive and record the device -related information (including device model, hardware serial number, device MAC address, operating system version, device settings, unique device recognition code (IMEI, Android ID, IDFA, IDFV, SIM cards, and IMSI information), UUID, necessary mobile application list information, software and hardware and equipment, equipment environment information, sensor information), and equipment related information."}
{"task": "rw_80.jsonl", "id": 64561, "text": "2.Log Information: When you use the products or services provided by our website or client, we will automatically collect your detailed usage and save it as a network log.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the products or services provided by our website or client, we will automatically collect your detailed usage and save it as a network log."}
{"task": "rw_80.jsonl", "id": 64562, "text": "Log information includes your search and browsing records, attention, playback records, purchase consumption records, visits, playback duration, IP address, WIFI network, telecommunications operator network, language, visit date and time.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64563, "text": "We will extract your preference features on the basis of collecting the above information, and based on characteristic label output indirect crowd portraits to display and push personalized content and possible commercial advertisements for you.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will extract your preference features on the basis of collecting the above information, and based on characteristic label output indirect crowd portraits to display and push personalized content and possible commercial advertisements for you."}
{"task": "rw_80.jsonl", "id": 64564, "text": "But we strive to ensure your product use experience.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64565, "text": "If you are not interested in the personalized content we recommend or want to no longer receive such personalized services, you can choose to close through the \"account-setting-privacy-personalized service\".", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "If you are not interested in the personalized content we recommend or want to no longer receive such personalized services, you can choose to close through the \"account-setting-privacy-personalized service\"."}
{"task": "rw_80.jsonl", "id": 64566, "text": "After closing, \"guess you like\" and \"private FM\" will not be displayed.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64567, "text": "(6) Provide you with VIP members or subscribing services", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64568, "text": "When you pay the VIP membership fee payment, we will record your payment method and capital account to achieve the original path refund, the activity red envelope cash withdrawal, the continuous monthly monthly service, and after -sales service.Order payment related information, order security related information, and the necessary information required by other anti -money laundering laws, shared with third -party in the application to embed the third -party payment software tool development package (SDK).", "label": ["Important", "First Party Collection Information"], "rewrite": "When you pay VIP membership fees, we record your payment methods and funds accounts."}
{"task": "rw_80.jsonl", "id": 64569, "text": "At the same time, based on maintenance of payment security and tracing online transaction behavior, according to relevant laws and regulations, we will record, save and show you order information, including your purchase of network transaction information for members, single -film on -demand, subscribing programs, and buying.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will record, save and show you the order information, including the network transaction information of your purchase membership, single -film on -demand, subscribing programs, and buying."}
{"task": "rw_80.jsonl", "id": 64570, "text": "When you use the \"I want to open a ticket\" function, you need to provide: the receiver's mobile phone number, the receiver's mailbox, the delivery address, and the taxpayer identification number information for us to send or send the corresponding invoices to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"I want to open a ticket\" function, you need to provide: the receiver's mobile phone number, the receiver's mailbox, the delivery address, and the taxpayer identification number information for us to send or send the corresponding invoices to you."}
{"task": "rw_80.jsonl", "id": 64571, "text": "If you use family membership functions, you need to provide your family members' account information, we will open a family member service for your family.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use family membership functions, you need to provide your family members' account information, we will open a family member service for your family."}
{"task": "rw_80.jsonl", "id": 64572, "text": "If you refuse to provide the above information, it will make you unable to become a VIP member or enjoy subscription service, but it will not affect your normal use of Himalayan functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, it will make you unable to become a VIP member or enjoy subscription service, but it will not affect your normal use of Himalayan functions."}
{"task": "rw_80.jsonl", "id": 64573, "text": "(7) Provide you with \"Discover Friends\" service", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64574, "text": "When you use the \"Discover Friends\" function, in order to recommend the person you may know, we will apply for access to your communication records and collect relevant address book information (including contact names and corresponding contact information).", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "When you use the \"Discover Friends\" function, in order to recommend the person you might know, we will apply for access to your communication records and collect relevant address book information."}
{"task": "rw_80.jsonl", "id": 64575, "text": "Please provide us after being careful to ensure that your friend's consent is consent, and you refuse to authorize the authorization of the communication recording permissions does not affect your normal use of Himalayan.", "label": ["Permission Acquisition", "Important"], "rewrite": "Please provide us after being careful to ensure that your friend's consent is consent, and you refuse to authorize the authorization of the communication recording permissions does not affect your normal use of Himalayan."}
{"task": "rw_80.jsonl", "id": 64576, "text": "The communication recording right is maintained by default.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64577, "text": "If you do not want to be recommended to your friends, you can also close the address book authorization that had previously opened to Himalayan through equipment permissions management.", "label": ["Important", "Edit/Control"], "rewrite": "You can also close the address book authorization that had previously opened to Himalayan through equipment authority management."}
{"task": "rw_80.jsonl", "id": 64578, "text": "(8) Provide you with \"official mall\" service", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64579, "text": "When you use our official mall service to buy products, we will collect the goods or service information of your goods when completing the transaction, the consignee information (the consignee's name, the receipt address and its contact number).", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the goods or service information of you when completing the transaction, the consignee information (the name of the consignee, the receiving address and its contact number)."}
{"task": "rw_80.jsonl", "id": 64580, "text": "In addition, we also need to record and save information related to order, including: transaction amount, order time, order number, order status, payment method, payment of water number, and payment status. We collect this information to help you complete the transaction smoothly smoothly., Ensure your transaction security, query order information, and cooperate with the legal obligations of online transaction supervision.", "label": ["Important", "First Party Collection Information"], "rewrite": "We also need to record and save information related to orders, including: transaction amount, order time, order number, order status, payment method, payment of flowing, payment status."}
{"task": "rw_80.jsonl", "id": 64581, "text": "When you use the \"I want to open a ticket\" function, you need to provide: the receiver's mobile phone number, the mailbox of the ticket, the delivery address, and the taxpayer identification number information for you to send or send the corresponding invoices.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the \"I want to open a ticket\" function, you need to provide: the receiver's mobile phone number, the mailbox of the ticket, the delivery address, and the taxpayer identification number information for you to send or send the corresponding invoices."}
{"task": "rw_80.jsonl", "id": 64582, "text": "When you browse the \"Himalayan Boutique Mall Store\" and click to enter the product details page, we will use your account ID to be associated with Zan Mall account for login verification. Regarding the data sharing we like, you can refer to this in detail this.The policy \"How to share, transfer and disclose your personal information\" in the policy.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you browse the \"Himalayan Boutique Mall Store\" and click to enter the product details page, we will use your account ID to Azan Mall account for login verification."}
{"task": "rw_80.jsonl", "id": 64583, "text": "In addition, when you place an order successfully, in order to complete the delivery of goods to you smoothly, safely, and accurately, merchants or third -party distribution companies will inevitably know your relevant information when shipping and distribution.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you successfully place an order, in order to complete the delivery of goods to you smoothly, safely, and accurately, merchants or third -party distribution companies will inevitably know your relevant information when shipping and distribution."}
{"task": "rw_80.jsonl", "id": 64584, "text": "We will strictly require merchants and third -party distribution companies to keep your personal information confidential, and only learn and use within the scope of the delivery purpose of product distribution. We must not leak or do any other use.", "label": ["Important", "Data Security"], "rewrite": "We will strictly require merchants and third -party distribution companies to keep your personal information confidential, and only learn and use within the scope of the delivery purpose of product distribution. We must not leak or do any other use."}
{"task": "rw_80.jsonl", "id": 64585, "text": "If you refuse to provide the above information, we will not be able to provide you with a \"official mall\" service, but it will not affect other functions of your use of Himalayan normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, we will not be able to provide you with a \"official mall\" service, but it will not affect other functions of your use of Himalayan normally."}
{"task": "rw_80.jsonl", "id": 64586, "text": "(9) Provide you with exclusive services for disabled users", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64587, "text": "In order to fulfill corporate responsibilities and reflect social care, when you enjoy the \"exclusive gift package\" service provided by us for disabled people, you need to provide your name, ID number, and information on the disabledThe aforementioned information you provide compares and information verification with the database of the China Disabled Persons Federation to verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you enjoy the \"exclusive gift package\" service provided by us for disabled people, you need to provide your name, ID number, and information on the disabled to achieve identity authentication."}
{"task": "rw_80.jsonl", "id": 64588, "text": "If you refuse to provide the above information, it will make you unable to enjoy the special service service of disabled users, but it does not affect your normal use of Himalayan functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, it will make you unable to enjoy the special service service of disabled users, but it does not affect your normal use of Himalayan functions."}
{"task": "rw_80.jsonl", "id": 64589, "text": "(10) Help you connect to smart devices", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64590, "text": "If you want to connect the APP with the smart devices you use, you need to turn on Bluetooth permissions so that we can search for your smart devices.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you want to connect the APP with the smart devices you use, you need to turn on Bluetooth permissions so that we can search for your smart devices."}
{"task": "rw_80.jsonl", "id": 64591, "text": "In addition, we may collect your Wi-Fi information, location information, and smart device information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your Wi-Fi information, location information, and smart device information."}
{"task": "rw_80.jsonl", "id": 64592, "text": "This information will be used to provide you with the functions of smart devices, connecting, and discovering nearby equipment and equipment management.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64593, "text": "If you refuse to provide the above information, we will not help you connect to smart devices, but it will not affect other functions of your use of Himalayan normally.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, we will not help you connect to smart devices, but it will not affect other functions of your use of Himalayan normally."}
{"task": "rw_80.jsonl", "id": 64594, "text": "(11) Provide you with customer service and disputes", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64595, "text": "When you initiate a complaint, appeal, or consult us, for your account and system security, we may need you to provide account information first and match your previous personal information to verify your user identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you initiate a complaint, appeal, or consult us, we may need you to provide account information first and match your previous personal information to verify your user identity."}
{"task": "rw_80.jsonl", "id": 64596, "text": "At the same time, in order to facilitate contact with you or help you solve the problem, we may also need you to provide personal information such as names, mobile phone numbers, emails and other contact information, and save call recording through a third -party customer service system, which may include communication/calls.Records, to contact you and help you solve problems, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may also need you to provide personal information such as name, mobile phone number, email and other contact information."}
{"task": "rw_80.jsonl", "id": 64597, "text": "In order to confirm the status of the transaction and provide you with VIP after -sales and dispute solutions for you, we will collect and transaction related information based on the payment institutions and payment methods based on the exchange, including the iOS IAP payment transaction certificate and charging voucher.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and transaction related information based on the payment institutions and payment methods selected by the exchange, including the iOS IAP payment transaction voucher and charging vouchers."}
{"task": "rw_80.jsonl", "id": 64598, "text": "If you refuse to provide the above information, we will not be able to provide you with complete customer service and disputes, but it will not affect your normal use of other functions of Himalayan.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the above information, we will not be able to provide you with complete customer service and disputes, but it will not affect your normal use of other functions of Himalayan."}
{"task": "rw_80.jsonl", "id": 64599, "text": "(12) Provide you with security and guarantee functions", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64600, "text": "In order to fulfill the security obligations of network security, improve your service security, ensure the security of the operation environment, prevent security risks such as fishing websites, fraud, cyber loopholes, computer viruses, cyber attacks, and network invasion to prevent, discover and investigate potential illegal illegal lawViolations or violations of user service agreements, policies or rules, such as abnormalities, multi -end login, abnormal traffic, regular refund requests or low -cost transfer membership cards, etc.Automatically collect your device information in the background (including device models, hardware serial numbers, device MAC address, operating system version, device settings, unique mobile device recognition code (IMEI, Android, ID, IDFA, ICCID, Meid, SIM cardAnd IMSI information), UUID, necessary mobile application list information, software and hardware and equipment, equipment environmental information), log information (including your search and browsing records, attention, play records, visits, playback duration, IP address, WIFI, WIFIThe network, telecommunications operator network, language, access date, and time), and may use or integrate your account information, transaction information, payment information, and other information that obtains your authorization or sharing according to law, comprehensively judge your account and transactionRisk, complete authentication and testing, prevent security incidents, and adopt necessary records, audits, analysis, and disposal measures in accordance with the law to protect the stability of the legitimate rights and interests of all parties.", "label": ["Important", "First Party Collection Information"], "rewrite": "We and applications embedded in the application will automatically collect your device information in the background."}
{"task": "rw_80.jsonl", "id": 64601, "text": "(13) Provide other additional services for you to call you the right", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64602, "text": "In order to provide you with personalized products and services and improve the user experience, we apply for the following equipment permissions to you in the additional services provided to you, and only get personal information from you when you use related functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64603, "text": "1.Camera/camera permissions: By accessing your camera, you can use the camera for QR code scanning code, photography, photos, or for user login, shooting and uploading videos, picture functions, and scanning with your authorization in specific scenarios to achieve scanning.Code payment and participation in platform activities.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain camera/camera permissions."}
{"task": "rw_80.jsonl", "id": 64604, "text": "2.Album and storage permissions: You can upload your photos/picture/video and local cache video and audio files after opening the album permissions, which is convenient for you to replace, publish and share comments, save activities to share the QR code, or communicate with customer service to youThe problems encountered.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain albums and storage permissions."}
{"task": "rw_80.jsonl", "id": 64605, "text": "We may identify the activity link or video service link you need to participate through the photos/pictures you uploaded, or use comment information containing the photos or pictures you uploaded.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64606, "text": "In order to achieve your friends, event discounts, and other link sharing needs, we may read your recently actively saved picture link address.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64607, "text": "In addition, if you use the download audio and video function, we may write the downloaded content based on your storage authority authorization.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64608, "text": "3.Microphone permission: You can realize your favorite movies, TV series, shows, and ensure that the audio recording function is feasible after turning on the microphone rights;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for obtaining microphone rights."}
{"task": "rw_80.jsonl", "id": 64609, "text": "Even though you have agreed to turn on the microphone rights, the microphone keeps the default shutdown state, and will only obtain voice information through the microphone when you actively click on the microphone icon or recording audio in the client.", "label": ["Permission Acquisition", "Important"], "rewrite": "Even though you have agreed to turn on the microphone rights, the microphone keeps the default shutdown state, and will only obtain voice information through the microphone when you actively click on the microphone icon or recording audio in the client."}
{"task": "rw_80.jsonl", "id": 64610, "text": "When you turn on the driving mode, we will open the voice assistant function for you after getting your consent. We will collect your voice information to provide the corresponding voice service to help you play your favorite through voice control while driving.Audio, you can click the microphone logo in the driving mode interface and enter the setting interface of the settings-voice assistant to close this permissions.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you turn on the driving mode, we will open the voice assistant function for you after getting your consent, and we will collect your voice information."}
{"task": "rw_80.jsonl", "id": 64611, "text": "The voice information we collected only for operating instruction recognition (or voice conversion text recognition). We will not actively retain your voice instruction information, let alone use it as other voice control playback functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "The voice information we collected only for operating instruction recognition (or voice conversion text recognition). We will not actively retain your voice instruction information, let alone use it as other voice control playback functions."}
{"task": "rw_80.jsonl", "id": 64612, "text": "4.Communication recording permissions: When you intend to share the link address of the video or the activity links in our platform with your friends, you need to turn on the communication recording authority, which is convenient for us to send the video playback address or event link address through social networks or send the video playback address or event link address.Give your friends.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain communication records."}
{"task": "rw_80.jsonl", "id": 64613, "text": "5.Position permissions: You can open your location permissions to obtain information near your location, related audio and video content, and related movie viewing venue recommendations, dining around the area around the place, and other local life service recommendation information.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for position permissions."}
{"task": "rw_80.jsonl", "id": 64614, "text": "6.Phone permissions: In order to avoid interrupting your live broadcast or recording process, and facilitate our detection of your call status, we need to authorize us to retrieve the status permissions of the phone.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for call permissions."}
{"task": "rw_80.jsonl", "id": 64615, "text": "In addition, in order to ensure your account and use security, at the same time, in order to show you the information you may be interested in, we need to authorize to read the device identification code or advertising logo.", "label": ["Permission Acquisition", "Important"], "rewrite": "We need to authorize to read the device identification code or advertising identifier."}
{"task": "rw_80.jsonl", "id": 64616, "text": "7.NFC permissions: When you use UnionPay payments on our platform for membership VIP, albums, etc. When you purchase or conduct special recharge, live broadcast rewards, etc., we need you to open NFC permissions to complete the payment.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain NFC permissions."}
{"task": "rw_80.jsonl", "id": 64617, "text": "8.Notification permissions: If you use subscribing albums, private messages, group chat and other functions, we may use notification permissions to push the album update content and message reminder.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain notification permissions."}
{"task": "rw_80.jsonl", "id": 64618, "text": "We will ask if you open the notification permissions by pop -up window.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will ask if you open the notification permissions by pop -up window."}
{"task": "rw_80.jsonl", "id": 64619, "text": "9.Bluetooth permissions: If you use Bluetooth to connect smart devices, we may use Bluetooth permissions to achieve Bluetooth control and use Himalayan services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to obtain Bluetooth permissions."}
{"task": "rw_80.jsonl", "id": 64620, "text": "We will ask by the jump device system when you use the Bluetooth connection.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64621, "text": "10. Access with APP installation list permissions: If you use smart audio, Himalayan needs to access the APP installation list to determine whether the smart speaker product client has been installed.", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for access to the app installation list permissions."}
{"task": "rw_80.jsonl", "id": 64622, "text": "11. Read the scissors permissions: The jump scene that appears during the opening of the APP and the use process, in order to confirm whether you have the information you have shared or received, or whether there is a platform activity, the Himalayan needs to visit your shearCut the plate, read the sharing code and links contained in it to achieve functions or services of jumping, sharing, and activity linkages.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply to read the scissors permissions."}
{"task": "rw_80.jsonl", "id": 64623, "text": "You can check the state of the above permissions in your device settings one by one, and you can determine that these permissions are turned on or closed at any time.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can check the state of the above permissions in your device settings one by one, and you can determine that these permissions are turned on or closed at any time."}
{"task": "rw_80.jsonl", "id": 64624, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.And the use of relevant personal information can not provide you with the service corresponding to the permissions.", "label": ["Permission Acquisition", "Edit/Control", "Important"], "rewrite": "If you turn on one authority, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the power, it means that you cancel the authorization. We will no longer continue to collect and use relevant individuals based on the corresponding authority.information."}
{"task": "rw_80.jsonl", "id": 64625, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization, nor does it affect your use of other services.", "label": ["Important", "Edit/Control"], "rewrite": "Your decision to close permissions will not affect the collection and use of information based on your authorization, nor does it affect your use of other services."}
{"task": "rw_80.jsonl", "id": 64626, "text": "(14) Special instructions for collecting and using your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64627, "text": "1.If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing us with these personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing us with these personal information."}
{"task": "rw_80.jsonl", "id": 64628, "text": "If you involve personal information of minors, you need to obtain the consent of the corresponding guardian of minors before the release, and in the aforementioned situation, the guardian has the right to contact us through the approach of Article 9 of this policy, and requires more correct or deletion of individuals involved in minors.Content of information.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you involve personal information of minors, you need to obtain the consent of the corresponding guardian of minors before the release, and in the aforementioned situation, the guardian has the right to contact us through the approach of Article 9 of this policy, and requires more correct or deletion of individuals involved in minors.Content of information."}
{"task": "rw_80.jsonl", "id": 64629, "text": "2.If we use your personal information for other purposes that are not stated in this policy, or if we are beyond the purpose of the purpose and a direct or reasonable range of correlation with the scope of direct or reasonable correlation, we will get your consent in advance.", "label": ["Important", "First Party Collection Information"], "rewrite": "If we use your personal information for other purposes that are not stated in this policy, or if we are beyond the purpose of the purpose and a direct or reasonable range of correlation with the scope of direct or reasonable correlation, we will get your consent in advance."}
{"task": "rw_80.jsonl", "id": 64630, "text": "3. If we get your information indirectly from the third party (such as sharing from the third party), we will clearly require the third party to share your personal information in writing in writing before collecting in writing, andThe type, purpose, method, and authorization consent of your personal information you shared will be promised to make a commitment to third parties to the legality and compliance of the source of personal information. If there are violations of third parties, we will clearly require thatThe other party bear the corresponding legal liability.", "label": ["Important", "First Party Collection Information"], "rewrite": "If we get your information indirectly from the third party (such as sharing from the third party), we will clearly request the third party to share your personal information in writing in writing before collecting in writing, and inform you that you will inform youShare the type of personal information, use purpose, method, and scope of authorization."}
{"task": "rw_80.jsonl", "id": 64631, "text": "At the same time, our professional security team will safeguard personal information (including sensitive information reporting, sensitive information encryption storage, access permissions control).", "label": ["Important", "Data Security"], "rewrite": "Our professional security team will carry out security reinforcement on personal information (including sensitive information reporting, sensitive information encryption storage, and access permissions)."}
{"task": "rw_80.jsonl", "id": 64632, "text": "We will use more than our personal information obtained by protecting our own personal information.", "label": ["Important", "Data Security"], "rewrite": "We will use more than our personal information obtained by protecting our own personal information."}
{"task": "rw_80.jsonl", "id": 64633, "text": "4. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64634, "text": "You fully understand and agree. According to the requirements of laws and regulations, we collect and use your personal information in the following circumstances without your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "According to the requirements of laws and regulations, we collect and use your personal information in the following circumstances without your authorization consent:"}
{"task": "rw_80.jsonl", "id": 64635, "text": "(1), related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information related to national security and national defense security does not need to solicit consent."}
{"task": "rw_80.jsonl", "id": 64636, "text": "(2), related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information related to public safety, public health, and major public interests does not require consent."}
{"task": "rw_80.jsonl", "id": 64637, "text": "(3), related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information related to criminal investigation, prosecution, trial, and judgment is not required."}
{"task": "rw_80.jsonl", "id": 64638, "text": "(4) For the major and legitimate rights and interests of the life and property of you or other individuals, it is difficult to get your consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting major legitimate rights and interests of life and property, but it is difficult to obtain personal information that I agree, without asking for consent."}
{"task": "rw_80.jsonl", "id": 64639, "text": "(5) Personal information that you disclose to the public by yourself;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect your personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_80.jsonl", "id": 64640, "text": "(6) If your personal information is collected from the legal publicly disclosed channels, including legal news reports and government information disclosure channels.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect your personal information from the legal publicly disclosed channels, you do not need to solicit consent."}
{"task": "rw_80.jsonl", "id": 64641, "text": "(7), according to the signing and fulfilling related agreements or other written documents for you;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and submitting and fulfilling personal information necessary for related agreements or other written documents does not need to ask for consent."}
{"task": "rw_80.jsonl", "id": 64642, "text": "(8), necessary to maintain the safe and stable operation of the products and/or services we provided, such as discovering, disposing of products and/./Or services;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information necessary for the safe and stable operation of products and/or services, there is no need to solicit consent."}
{"task": "rw_80.jsonl", "id": 64643, "text": "(9), other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in the laws and regulations without asking for consent."}
{"task": "rw_80.jsonl", "id": 64644, "text": "2. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64645, "text": "(1) Cookie", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64646, "text": "In order to ensure the normal operation of the website, get a more relaxed access experience for you, and recommend the content you may be interested in to you, we will store cookie, Flash, Cookie or browser or associated applications provided on your computer or mobile devicesOther local storage (collectively referred to as \"Cookie\") with names, site names, and some numbers and characters.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will store Cookie, Flash Cookie or browser or associated applications on your computer or mobile devices. Other local storage (collective referred to as \"Cookie\") provided by other commonly included in identifier, site names, and some numbers and characters."}
{"task": "rw_80.jsonl", "id": 64647, "text": "We and third -party partners may use Cookie or similar technologies to collect and use your information and store the information so that the website can store your preference or product data in the shopping cart.", "label": ["Important", "First Party Collection Information"], "rewrite": "We and third -party partners may use Cookie or similar technologies to collect and use your information, and store the information so that the website can store your preference or product data in the shopping cart."}
{"task": "rw_80.jsonl", "id": 64648, "text": "If your browser or browser additional service allows, you can modify your acceptance of Cookie or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "If your browser or browser additional service allows, you can modify your acceptance of Cookie or reject our cookies."}
{"task": "rw_80.jsonl", "id": 64649, "text": "For details, see aboutcookies.org.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64650, "text": "But if you do this, in some cases, you may affect your safe access to our website, and you may need to change the user settings when you visit our website.", "label": ["Important", "Edit/Control"], "rewrite": "But if you do this, in some cases, you may affect your safe access to our website, and you may need to change the user settings when you visit our website."}
{"task": "rw_80.jsonl", "id": 64651, "text": "(11) Cookie similar technology", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64652, "text": "In addition to Cookie, we will also use the website's beacon and pixel label and other similar technologies on the website.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64653, "text": "For example, the email we send to you may contain a link to the address link to our website content. If you click the link, we will track this click to help us understand your product or service preferences to actively improve our customer service to improve customer serviceExperience.", "label": ["Usage"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64654, "text": "Website beacon is usually a transparent image embedded in a website or email.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64655, "text": "With the pixel labels in emails, we can know whether the email has been opened.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64656, "text": "If you don't want your activities to be tracked in this way, you can withdraw from our signal list at any time.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64657, "text": "ETAG (physical label) is the HTTP protocol header that is transmitted behind the Internet browser and the Internet server, which can replace Cookie.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64658, "text": "ETAG can help us avoid unnecessary server loads, improve service efficiency, and save resources and energy. At the same time, we may record your identity through ETAG so that we can understand and improve our products or services more deeply.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64659, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Important", "Edit/Control"], "rewrite": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function."}
{"task": "rw_80.jsonl", "id": 64660, "text": "But please note that if ETAG is discontinued, you may not be able to enjoy the best product or service experience.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64661, "text": "(12) Clear/Disable Cookie", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64662, "text": "Management of cookies and cookies must be completed within the option/preference of your browser.", "label": ["Important", "Edit/Control"], "rewrite": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function."}
{"task": "rw_80.jsonl", "id": 64663, "text": "The following is a guide to how to perform this operation in common browser software:", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64664, "text": " Microsoft Internet Explorer", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64665, "text": " Microsoft Edge", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64666, "text": " Mozilla Firefox", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64667, "text": " Google Chrome", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64668, "text": " Safari for macOS", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64669, "text": " Safari for iOS", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64670, "text": "Regarding, cookie, details, and how to set your browser to accept, delete or disable, cookie, cookie, please see, www.allaboutCookies.org.", "label": ["Edit/Control", "Important"], "rewrite": "For detailed information about Cookie and how to set your browser to accept, delete or disable cookies, see www.allaboutcookies.org."}
{"task": "rw_80.jsonl", "id": 64671, "text": "3. How can we share, transfer and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64672, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64673, "text": "Except for the following situations, we will not share your personal information with any other third parties.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64674, "text": "1. Share if you get your clear consent or authorization or you take the initiative.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information with your clear consent or authorization or your active choice."}
{"task": "rw_80.jsonl", "id": 64675, "text": "2. Sharing in statutory situations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share personal information in statutory situations."}
{"task": "rw_80.jsonl", "id": 64676, "text": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to the outside world in accordance with the requirements of laws and regulations, litigation disputes, or in accordance with the requirements of administrative and judicial organs in accordance with law."}
{"task": "rw_80.jsonl", "id": 64677, "text": "3. Share your personal information from related companies.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64678, "text": "In order to facilitate us to provide you with a service based on the affiliate account, I recommend information that you may be interested in or protect the security of our affiliated companies or other users or the public.It may be shared with our affiliated companies.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After your authorization consent, your personal information may be shared with our affiliated company."}
{"task": "rw_80.jsonl", "id": 64679, "text": "We will only share the necessary personal information (such as the facilitation of your account login and using our affiliated company products or services, we will share your necessary personal information from related companies), if related companies want to change the purpose of the processing of personal information, Will ask your authorization again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share the necessary personal information. If related companies want to change the purpose of personal information, we will solicit your authorization consent again."}
{"task": "rw_80.jsonl", "id": 64680, "text": "4. Share it with authorized partners.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64681, "text": "You have authorized and agreed that we may entrust your partners to provide you with certain services or represent our functions. We will only share your information for the legal, correct, necessary, specific, and clear goals of this privacy information protection policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "You have authorized and agreed that we may entrust your partners to provide you with certain services or represent our functions. We will only share your information for the legal, correct, necessary, specific, and clear goals of this privacy information protection policy."}
{"task": "rw_80.jsonl", "id": 64682, "text": "We will restrict our authorized partners through the agreement that can only be exposed to the information required for their responsibilities, asking them to fulfill strict security measures that are compatible with risks to handle your personal information, including but not limited to the data protection agreementOr clauses, commitments, etc., and you must not use your personal information for any other purposes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will restrict our authorized partners through the agreement that we can only expose the information required for their duties, asking them to fulfill strict security measures that are compatible with risks to handle your personal information."}
{"task": "rw_80.jsonl", "id": 64683, "text": "If you use your personal information beyond the sharing, we will ask it to follow your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you use your personal information beyond the sharing, we will ask it to follow your clear consent."}
{"task": "rw_80.jsonl", "id": 64684, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64685, "text": "(1) Authorized partners of advertising monitoring, data statistics, and data analysis services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64686, "text": "In order to maintain/improve our product/service and provide you with better content, at the same time, it is convenient for us, Hot Cloud, second hand), analyze your service situation, evaluate and optimize the effect of advertising.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may access the designated partners who provide the service to analyze your service situation and evaluate and optimize the effect of advertising."}
{"task": "rw_80.jsonl", "id": 64687, "text": "(2) Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64688, "text": "We share some personal information with suppliers, service providers and other partners (such as Bugly and Chuanglan) that support our business to provide technical infrastructure services, analyze users' usage methods, pay convenience or conduct academic research and investigation.Carry out BUG or collapse statistics, improve the login experience, and realize the gateway number.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We share some personal information with suppliers, service providers and other partners who support our business (such as Bugly, Chuanglan)."}
{"task": "rw_80.jsonl", "id": 64689, "text": "Please rest assured that except for your clear consent, we will not share your personal information with your identity with the authorized partners. We will be able to identify your identity personal informationIdentify your specific identity.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Except for your clear consent, we will not share the personal information that can contact or recognize your identity with the authorized partner. We will be able to identify your identity personal information to identifyidentity."}
{"task": "rw_80.jsonl", "id": 64690, "text": "Himalayan products include the SDK plug -in provided by our authorized partners.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64691, "text": "When you use the relevant services provided by the authorized partner in Himalayan, these service plug -ins will collect and process your relevant personal information. For details, please refer to attachment 1: \"SDK situation of the Himalayan APP involved in personal information transmission\".", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the relevant services provided by the authorized partner in Himalayan, these service plug -ins will collect and process your relevant personal information. For details, please refer to attachment 1: \"SDK situation of the Himalayan APP involved in personal information transmission\"."}
{"task": "rw_80.jsonl", "id": 64692, "text": "We will conduct strict security testing of the application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information. Carefully evaluate the purpose of using your personal information to use your personal information, and to sign the agreement with the authorized partner to sign an agreement through the signing agreementThe method of strict data protection measures is required to process personal information in accordance with our entrusted purpose, service description, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will conduct strict security testing of the application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information. Carefully evaluate the purpose of using your personal information to use your personal information, and to sign the agreement with the authorized partner to sign an agreement through the signing agreementThe method stipulates strict data protection measures."}
{"task": "rw_80.jsonl", "id": 64693, "text": "We strongly recommend that you check and understand its privacy clauses before using any third -party SDK service.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64694, "text": "(13) Transfer", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64695, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:"}
{"task": "rw_80.jsonl", "id": 64696, "text": "1., transfer when you get your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Transfer personal information when you get your clear consent."}
{"task": "rw_80.jsonl", "id": 64697, "text": "2. In the case of reorganization, merger, separation, acquisition, asset sale or bankruptcy liquidation situation or other similar situations in the Himalayan and its affiliatedHigh standards and requirements are treated and protected, otherwise we will ask for the transferee to retake your consent again.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the case of reorganization, merger or bankruptcy liquidation or other similar situations in the Himalayan and its affiliated companies, if it involves the transfer of personal information, we will ask the transferee to use the same or higher standards and requirements as the policy for treatment and protection.Otherwise, you will ask you to ask you again."}
{"task": "rw_80.jsonl", "id": 64698, "text": "(14) Sharing, transfer, and disclose personal information.", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64699, "text": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and publicly disclose your personal information without obtaining your authorization consent in advance:"}
{"task": "rw_80.jsonl", "id": 64700, "text": "1. It is related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information related to national security and national defense security does not require consent."}
{"task": "rw_80.jsonl", "id": 64701, "text": "2. Related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information related to public safety, public health, and major public interests does not need to solicit consent."}
{"task": "rw_80.jsonl", "id": 64702, "text": "3. It is related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing related personal information related to criminal investigation, prosecution, trial, and judgment does not need to solicit consent."}
{"task": "rw_80.jsonl", "id": 64703, "text": "4. Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing the major legitimate rights and interests of life and property, but it is difficult to get personal information that I agree, without asking for consent."}
{"task": "rw_80.jsonl", "id": 64704, "text": "5. Personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share personal information that you disclose to the public yourself without asking for consent."}
{"task": "rw_80.jsonl", "id": 64705, "text": "6. Collect personal information from the legal publicly disclosed information, including legal news reports and government information disclosure channels;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to ask for consent."}
{"task": "rw_80.jsonl", "id": 64706, "text": "7. Perform the relevant obligations stipulated in other laws and regulations, such as the resolution of online intellectual property disputes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Those who fulfill the relevant obligations stipulated in laws and regulations and share personal information without soliciting consent."}
{"task": "rw_80.jsonl", "id": 64707, "text": "According to the law, when the personal information of sharing and transfers takes technical measures, so that the data receiver cannot restore and re -identify a specific personal identity, we will not notify you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "When the personal information of sharing and transfer is treated with technical measures, so that the data receiver cannot restore and re -identify a specific personal identity, we will not notify you separately and obtain your consent."}
{"task": "rw_80.jsonl", "id": 64708, "text": "4. How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64709, "text": "(1) Storage location", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64710, "text": "The personal information we collected and generated in the operation of the People's Republic of China is stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected and generated in the operation of the People's Republic of China is stored in China."}
{"task": "rw_80.jsonl", "id": 64711, "text": "At present, we do not have any personal information to store your personal information or provide your personal information overseas.", "label": ["Data Retention", "Important"], "rewrite": "At present, we do not have any personal information to store your personal information or provide your personal information overseas."}
{"task": "rw_80.jsonl", "id": 64712, "text": "If it is really necessary to perform cross -border transmission of data, we will clearly notify you alone (including the purpose of data outbound, receiving, use method and scope, use content, security guarantee measures, security risks, etc.), and obtain yourClarifying the consent of authorization, we will ensure that the data receiver has sufficient data protection capabilities to protect your personal information and implement it in strict accordance with the provisions of the applicable laws and regulations;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "If it is necessary to perform cross -border transmission of data, we will clearly inform you alone and obtain your clear authorization consent."}
{"task": "rw_80.jsonl", "id": 64713, "text": "In response to the above situations, we will ensure that you provide sufficient protection for your personal information based on this policy.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64714, "text": "(15) Storage period", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64715, "text": "We will only retain your personal information within the shortest period required for the purpose of the cost of reaching the cost policy, unless the laws and regulations have compulsory deposit retention requirements, for example, according to the requirements of the E -commerce Law and the requirements of supporting regulations, your order -type transactionsThe preservation time of data is not less than three years from the date of the transaction.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the shortest period required by the cost of reaching the cost of the cost, unless laws and regulations have compulsory depository requirements."}
{"task": "rw_80.jsonl", "id": 64716, "text": "We judge the standards of the aforementioned period mainly include and the elderly are prevailing:", "label": ["Data Retention", "Important"], "rewrite": "We judge that the standards of the aforementioned period mainly include and the elders are prevailing."}
{"task": "rw_80.jsonl", "id": 64717, "text": "1. Complete your related service purposes, maintain the corresponding service and business records, and deal with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64718, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64719, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64720, "text": "4. Whether there are other special agreements in the reserved period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64721, "text": "After your personal information exceeds the retention period, we will delete or processed your personal information according to the requirements of the applicable law.", "label": ["Data Retention", "Important"], "rewrite": "After your personal information exceeds the retention period, we will delete or processed your personal information according to the requirements of the applicable law."}
{"task": "rw_80.jsonl", "id": 64722, "text": "(16) Delete and anonymous treatment", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64723, "text": "If this platform service decides to stop operation, we will stop collecting your personal information after the relevant service stops operation.", "label": ["Important", "Cessation of Operations"], "rewrite": "If this platform service decides to stop operation, we will stop collecting your personal information after the relevant service stops operation."}
{"task": "rw_80.jsonl", "id": 64724, "text": "We will stop the operation notice in the form of an announcement.", "label": ["Important", "Cessation of Operations"], "rewrite": "We will stop the operation notice in the form of an announcement."}
{"task": "rw_80.jsonl", "id": 64725, "text": "We will delete or anonymous treatment for your personal information, unless laws and regulations have other provisions.", "label": ["Data Retention", "Important"], "rewrite": "We will delete or anonymous treatment for your personal information, unless laws and regulations have other provisions."}
{"task": "rw_80.jsonl", "id": 64726, "text": "Involving the personal information of minors, we will adopt a notice of notifications to stop operations in a timely manner in a timely manner.", "label": ["Specific Audiences", "Important"], "rewrite": "Involving the personal information of minors, we will adopt a notice of notifications to stop operations in a timely manner in a timely manner."}
{"task": "rw_80.jsonl", "id": 64727, "text": "5. How do we protect your personal information security", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64728, "text": "In order to ensure your information security, we strive to take a variety of reasonable physical, electronics and management security measures that meet industry standards to protect your information, so that your information will not be leaked, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "We strive to take various reasonable physical, electronics and management security measures that meet industry standards to protect your information, so that your information will not be leaked, damaged or lost."}
{"task": "rw_80.jsonl", "id": 64729, "text": "To ensure your personal information security, we promise that we will do our best to achieve a reasonable or higher level of security:", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64730, "text": "(1) Technical security protection", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64731, "text": "The technical security measures we take include but not limited to SSL, information encryption storage, and data centers access control.", "label": ["Important", "Data Security"], "rewrite": "The technical security measures we take include but not limited to SSL, information encryption storage, and data centers access control."}
{"task": "rw_80.jsonl", "id": 64732, "text": "We will use encryption technology to improve the security of personal information;", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology to improve the security of personal information."}
{"task": "rw_80.jsonl", "id": 64733, "text": "Using a trusted protection mechanism to prevent personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "Using a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_80.jsonl", "id": 64734, "text": "(17) Security system guarantee", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64735, "text": "We have the industry's advanced data security management system based on data as the core and the data security management system carried out around the data life cycle. It improves the security of the entire system in terms of organizational construction, system design, personnel management, and product technology.", "label": ["Important", "Data Security"], "rewrite": "We have the industry's advanced data security management system based on data as the core and data life cycle."}
{"task": "rw_80.jsonl", "id": 64736, "text": "At present, our platform has passed the third -level evaluation of the network security level.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64737, "text": "(18) Safety management", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64738, "text": "We have adopted strict management of employees or outsourcing staff who may contact you, including but not limited to control mechanisms that allocate different access permissions according to different positions, and signed a confidentiality agreement to record and master the operation situation in real time.", "label": ["Important", "Data Security"], "rewrite": "We have adopted strict management of employees or outsourcing staff who might contact you."}
{"task": "rw_80.jsonl", "id": 64739, "text": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_80.jsonl", "id": 64740, "text": "(19) Sensitive information and password protection tips", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64741, "text": "1. Sensitive personal information protection: When you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information, such as the avatar picture you uploaded.Select upload pictures containing personal information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "When you use our service, you voluntarily shared or even publicly shared information, which may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_80.jsonl", "id": 64742, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64743, "text": "2. Your account has a security protection function, please keep your account and password information properly.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64744, "text": "We will ensure that your information is not lost, and other security measures will be ensured by backup of other servers, encrypted user passwords, and other security measures.", "label": ["Important", "Data Security"], "rewrite": "We will ensure that your information is not lost, and other security measures will be ensured by backup of other servers, encrypted user passwords, and other security measures."}
{"task": "rw_80.jsonl", "id": 64745, "text": "In addition, please use complex passwords to help us guarantee your account security.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64746, "text": "We will try our best to ensure the security of any information you send to us.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64747, "text": "But please know that the Internet is not an absolutely safe environment.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64748, "text": "Although there are aforementioned security measures, please also understand that there are no \"perfect security measures\" on the information network.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64749, "text": "Therefore, please protect your personal information properly and provide them with others alone.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64750, "text": "If you find your personal information leakage, especially your account and password leak, please contact our customer service immediately so that we can take corresponding measures.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64751, "text": "(20) Information security incident processing", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64752, "text": "When the personal information security incident occurs unfortunately, we will inform you in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we will take, the suggestions that you can prevent and reduce the risk,Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "When the personal information security incident occurs unfortunately, we will inform you in accordance with the requirements of the laws and regulations: basic situations and possible impacts, disposal measures, self -control and reducing suggestions, remedy measures."}
{"task": "rw_80.jsonl", "id": 64753, "text": "In the event related to the incident, we will inform you in the form of mail, telephone, push notification, and short message. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "In the event related to the incident, we will inform you in the form of mail, telephone, push notification, and short message. When it is difficult to inform the subject of personal information one by one, we will publish an announcement in a reasonable and effective way."}
{"task": "rw_80.jsonl", "id": 64754, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_80.jsonl", "id": 64755, "text": "6. How do we protect the personal information of children", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64756, "text": "We attach great importance to the protection of children's personal information.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64757, "text": "If you are a child, we ask you to ask your parents or other guardians to read the privacy information protection policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "We ask you to ask your parents or other guardians to read this privacy information protection policy carefully, and use our services or provide information to us under the consent of your parents or other guardians."}
{"task": "rw_80.jsonl", "id": 64758, "text": "We have a product or service, product or service provided by children under the age of 14, which contain a functional sector for children, or need to enter the age information or other products or services that can identify the age of the user.", "label": ["Specific Audiences", "Important"], "rewrite": "We have a product or service, product or service provided by children under the age of 14, which contain a functional sector for children, or need to enter the age information or other products or services that can identify the age of the user."}
{"task": "rw_80.jsonl", "id": 64759, "text": "If you are a child, we ask you to ask your parents or other guardians to read this privacy information protection policy and the \"Child Privacy Policy\", and use our service or direction to your parents or other guardians with your consent.We provide information.", "label": ["Specific Audiences", "Important"], "rewrite": "We ask you to ask your parents or other guardians to read this privacy information protection policy and the \"Child Privacy Policy\", and use our services or provide information to us under the premise of obtaining your parents or other guardians."}
{"task": "rw_80.jsonl", "id": 64760, "text": "For the case where parents or other guardians agree to use our products or services to collect children's personal information, we will only use, share, transfer or protect minors with the permission of laws and regulations, parents or guardians clearly agree or protect minors.Discover this information.", "label": ["Specific Audiences", "Important"], "rewrite": "For the case where parents or other guardians agree to use our products or services to collect children's personal information, we will only use, share, transfer or protect minors with the permission of laws and regulations, parents or guardians clearly agree or protect minors.Discover this information."}
{"task": "rw_80.jsonl", "id": 64761, "text": "If your parents or other guardians do not agree that you use our services or provide information to us in accordance with this policy, please immediately terminate our services and inform us in time so that we can take corresponding measures.Under the circumstances, the personal information of minors is collected. You can contact us through the contact information in Section 9. We will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If your parents or other guardians do not agree that you use our services or provide information to us in accordance with this policy, please immediately terminate our services and inform us in time."}
{"task": "rw_80.jsonl", "id": 64762, "text": "The protection of children's personal information will also be applicable to strict personal information access permissions control system and personal information processing records and control measures.download.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "The protection of children's personal information will also be applicable to strict personal information access permissions control system and personal information processing records and control measures.download."}
{"task": "rw_80.jsonl", "id": 64763, "text": "The contingency plans we have formulated for personal information security incidents will also apply to the protection of children's personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "The contingency plans we have formulated for personal information security incidents will also apply to the protection of children's personal information."}
{"task": "rw_80.jsonl", "id": 64764, "text": "We regularly organize internal personnel to conduct emergency response training and emergency drills to master their job duties and emergency disposal strategies and regulations.", "label": ["Important", "Data Security"], "rewrite": "We regularly organize internal personnel to conduct emergency response training and emergency drills to master their job duties and emergency disposal strategies and regulations."}
{"task": "rw_80.jsonl", "id": 64765, "text": "After unfortunately a child personal information security incident, we will inform the children and their guardians in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of safety events, we have taken or or will take treatment measures, children and their guardiansSuggestions that can prevent and reduce risks, remedy measures for children and their guardians.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "After unfortunately a child's personal information security incident, we will inform the children and the guardian in a timely manner in accordance with the requirements of laws and regulations: basic situations and possible impacts, disposal measures, suggestions, remedy measures."}
{"task": "rw_80.jsonl", "id": 64766, "text": "We will promptly inform children and their guardians in the way the event -related situation is pushed to notify the APP and send email/short message.", "label": ["Specific Audiences", "Important"], "rewrite": "We will promptly inform children and their guardians in the way the event -related situation is pushed to notify the APP and send email/short message."}
{"task": "rw_80.jsonl", "id": 64767, "text": "When it is difficult to inform one by one, we will publish relevant warning information in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "When it is difficult to inform one by one, we will publish relevant warning information in a reasonable and effective way."}
{"task": "rw_80.jsonl", "id": 64768, "text": "At the same time, we will also actively report the disposal of the child's personal information security incident in accordance with the requirements of the regulatory authorities.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We will also actively report the disposal of the child's personal information security incident in accordance with the requirements of the regulatory authorities."}
{"task": "rw_80.jsonl", "id": 64769, "text": "If you are a child's parents or other guardians, please pay attention to whether the child you guard with your authorization will use our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child's parents or other guardians, please pay attention to whether the child you guard with your authorization will use our service after obtaining your authorization consent."}
{"task": "rw_80.jsonl", "id": 64770, "text": "If you have questions about your personal information of your child, please contact us through contact information in Section 9.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have questions about your personal information of your child, please contact us through contact information in Section 9."}
{"task": "rw_80.jsonl", "id": 64771, "text": "7. How do you exercise your personal information rights", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64772, "text": "We can access, correct and delete our account information or use our services when providing convenient ways to provide convenience methods.", "label": ["Important", "Edit/Control"], "rewrite": "We can access, correct and delete our account information or use our services when providing convenient ways to provide convenience methods."}
{"task": "rw_80.jsonl", "id": 64773, "text": "You can access and manage your personal information in the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64774, "text": "(1) Visit your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64775, "text": "You have the right to access your personal information, except for the exception stipulated in laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to access your personal information, except for the exception stipulated in laws and regulations."}
{"task": "rw_80.jsonl", "id": 64776, "text": "You can access your personal information by yourself in the following ways:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64777, "text": "Account Information -If you want to access or edit the account information in your account, change your password or close your account, you can log in to the account to perform such operations through \"account management\";", "label": ["Edit/Control", "Important"], "rewrite": "If you want to visit or edit your account information in your account, change your password or close your account, you can log in to the account to perform such operations through \"account management\"."}
{"task": "rw_80.jsonl", "id": 64778, "text": "For example, you can log in to the PC or APP \"Account Number-Settings-Account and Security\" query, modify your account binding situation, set the password, and check the recent login device.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64779, "text": "Information and information-If you want to access or edit your personal information in your account, you can add, modify and delete your avatar, nickname, gender, birthday, region, region, region, region, region, region, region, region, region, and region on the app.Signature, profile.", "label": ["Edit/Control", "Important"], "rewrite": "If you want to visit or edit your personal information in your account, you can add, modify, and delete your avatar, nickname, gender, birthday, region, sound signature, profile, signature, sound signature, sound signature, sound signature, sound signature on the APPEssence"}
{"task": "rw_80.jsonl", "id": 64780, "text": "If you cannot access your personal information through the above way, you can contact us at any time through the contact information of this policy, and we will reply to your request within 15 working days.", "label": ["Edit/Control", "Important"], "rewrite": "If you cannot access your personal information through the above way, you can contact us at any time through the contact information of this policy, and we will reply to your request within 15 working days."}
{"task": "rw_80.jsonl", "id": 64781, "text": "(21) More correct or supplement your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64782, "text": "When you find that we have the error about your personal information, you have the right to ask us to make corrections or supplements.", "label": ["Edit/Control", "Important"], "rewrite": "When you find that we have the error about your personal information, you have the right to ask us to make corrections or supplements."}
{"task": "rw_80.jsonl", "id": 64783, "text": "You can make corrections or supplementary applications in the method listed in \"(1) access your personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You can make corrections or supplementary applications in the method listed in \"(1) access your personal information\"."}
{"task": "rw_80.jsonl", "id": 64784, "text": "If you cannot access your personal information through the above way or other may not be able to provide you with online correction/modification service at the present, you can contact us at any time through the contact information of this policy. We will reply within 15 working days.Your request.", "label": ["Important", "Edit/Control"], "rewrite": "If you cannot access your personal information through the above way or other may not be able to provide you with online correction/modification service at the present, you can contact us at any time through the contact information of this policy. We will reply within 15 working days.Your request."}
{"task": "rw_80.jsonl", "id": 64785, "text": "After verification of your identity and correct/modify the objectivity and accuracy of the information, you have the right to correct or modify the errors or incomplete information, except for laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to correct or modify the error or incomplete information, except for other provisions of laws and regulations."}
{"task": "rw_80.jsonl", "id": 64786, "text": "For the consideration of security and identity, you may not be able to modify some initial registration information submitted during registration.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For the consideration of security and identity, you may not be able to modify some initial registration information submitted during registration."}
{"task": "rw_80.jsonl", "id": 64787, "text": "(22) Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64788, "text": "You have the right to delete the information that has been filled in through the method of \"(1) access your personal information\".", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to delete the information that has been filled in through the method of \"(1) access your personal information\"."}
{"task": "rw_80.jsonl", "id": 64789, "text": "At the same time, in the following circumstances, you can contact us through the contact information disclosed by this policy and make a request to delete personal information. We will reply to your request within 15 working days:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64790, "text": "1.If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64791, "text": "2.If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64792, "text": "3.If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64793, "text": "4.If you no longer use our products or services, or you take the initiative to cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64794, "text": "5.If we will no longer provide you with products or services", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64795, "text": "If we decide to respond to your deletion request, we will also notify the main body of your personal information from us at the same time as much as possible, and require them to delete them in time, unless laws and regulations have other regulations, such as the order -type transaction data you provide, willIt will be reserved based on laws and regulations for at least 3 years, or these subjects get your independent authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the subjects that obtain your personal information from our personal information as much as possible at the same time, and require them to delete them in time unless laws and regulations have other regulations."}
{"task": "rw_80.jsonl", "id": 64796, "text": "(23) Copy personal information obtain", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64797, "text": "If you need a copy of your personal information, you can contact us through the method provided at the end of this privacy policy. After verifying your identity, we will provide you with your personal information copy (including basic information, basic information, basic information,Identity information), but the laws and regulations have other provisions or except for this policy.", "label": ["Important", "Edit/Control"], "rewrite": "If you need a copy of your personal information, you can contact us through the method provided by the privacy policy at the end of this privacy policy. After verifying your identity, we will provide you with your personal information copy in our service."}
{"task": "rw_80.jsonl", "id": 64798, "text": "(24) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64799, "text": "You can check your authorized consent permissions in your device system settings-application-APP name-permissions, and you can determine that these permissions are turned on or closed at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can check your authorized consent permissions in your device system settings-application-APP name-permissions, and you can determine that these permissions are turned on or closed at any time."}
{"task": "rw_80.jsonl", "id": 64800, "text": "For the collection and use of personal information in different functional services, you can also contact or recover your authorization consent with our platform customer service. We will reply to your request within 15 working days.", "label": ["Edit/Control", "Important"], "rewrite": "For the collection and use of personal information in different functional services, you can also contact or recover your authorization consent with our platform customer service. We will reply to your request within 15 working days."}
{"task": "rw_80.jsonl", "id": 64801, "text": "When you withdraw your consent, we will no longer process the corresponding personal information, and we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization.", "label": ["Edit/Control", "Important"], "rewrite": "When you withdraw your consent, we will no longer process the corresponding personal information, and we will not be able to continue to provide you with the service corresponding to the withdrawal consent or authorization."}
{"task": "rw_80.jsonl", "id": 64802, "text": "But your decision to withdraw consent will not affect personal information processing based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "But your decision to withdraw consent will not affect personal information processing based on your authorization."}
{"task": "rw_80.jsonl", "id": 64803, "text": "(25) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64804, "text": "When you log out the account, you will no longer log in and use our products and services with this account;", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel your account, you will no longer log in and use our products and services with this account."}
{"task": "rw_80.jsonl", "id": 64805, "text": "And this account will be cleared during the use of our products and services but not consumed and the expected interests of the future;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64806, "text": "The content, information, data, records, etc. under this account will be deleted or processed anonymous, except that the laws and regulations have other regulations or the regulatory authorities have other requirements;", "label": ["Important", "Edit/Control"], "rewrite": "The content, information, data, records, etc. under this account will be deleted or anonymous, except that the laws and regulations have other regulations or other requirements."}
{"task": "rw_80.jsonl", "id": 64807, "text": "After your account is canceled, it will not be able to recover.", "label": ["Edit/Control", "Important"], "rewrite": "After your account is canceled, it will not be able to recover."}
{"task": "rw_80.jsonl", "id": 64808, "text": "If you still decide to cancel your account after careful consideration, you can set the application page of the related function settings of our products and/or services you use or submit a cancellation application to us according to the operation guidance.Account \"page (,\" account-setting-account number and security-cancellation account \") submits an account cancellation application.", "label": ["Important", "Edit/Control"], "rewrite": "If you still decide to cancel your account after careful consideration, you can set the application page of the related feature settings of our products and/or services you use or submit a cancellation application to us according to the operation guidance."}
{"task": "rw_80.jsonl", "id": 64809, "text": "If you fail to apply successfully, you can also contact our platform customer service, and we will reply to your request within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64810, "text": "After you actively cancel your account, we will stop providing you with products or services.", "label": ["Edit/Control", "Important"], "rewrite": "After you actively cancel your account, we will stop providing you with products or services."}
{"task": "rw_80.jsonl", "id": 64811, "text": "(26) Restricting automation decision", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64812, "text": "On the Himalayan APP, you can choose whether we use the personalized services we provide through \"account-settings-privacy\".", "label": ["Edit/Control", "Important"], "rewrite": "On the Himalayan APP, you can choose whether we use the personalized services we provide through \"account-settings-privacy\"."}
{"task": "rw_80.jsonl", "id": 64813, "text": "In addition, in some business functions, after informing you and obtaining consent, we may make a decision based on the non -artificial automatic decision -making mechanism, including the information system and algorithm.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "In some business functions, after informing you and obtaining consent, we may make a decision based on the non -artificial automatic decision mechanism, including the information system and algorithm."}
{"task": "rw_80.jsonl", "id": 64814, "text": "If you think these decisions significantly affect your legitimate rights and interests, you have the right to make an explanation through contact information disclosed by this policy, and we will also reply to your request within 15 working days to provide you with appeal methods.", "label": ["Edit/Control", "Important"], "rewrite": "If you think these decisions significantly affect your legitimate rights and interests, you have the right to make an explanation through contact information disclosed by this policy, and we will also reply to your request within 15 working days to provide you with appeal methods."}
{"task": "rw_80.jsonl", "id": 64815, "text": "(27) Course", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64816, "text": "If you find a video content and product and service information push that does not belong to your active search and browsing.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64817, "text": "If you do not want to receive the above information, you can cancel the book through the original path. For example, SMS push can directly reply to the related withdrawal password.Reply to your request within 15 working days.", "label": ["Edit/Control", "Important"], "rewrite": "If you do not want to receive the above information, you can withdraw through the original path."}
{"task": "rw_80.jsonl", "id": 64818, "text": "(28) Complaints", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64819, "text": "You have the right to contact us to complain through the contact information disclosed by this policy.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64820, "text": "We will respond within 15 working days from the date of receiving your complaint.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64821, "text": "If you are not satisfied with our response, especially our personal information processing behavior harms your legitimate rights and interests, you can also complain or report to the regulatory authorities such as online information, public security, industry and commerce, or filed a lawsuit with the jurisdiction of jurisdiction., But we hope you can first contact us on related issues.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64822, "text": "(29) responding to your above request", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64823, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64824, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64825, "text": "For your reasonable request, we do not charge fees in principle.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64826, "text": "However, we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "However, we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit."}
{"task": "rw_80.jsonl", "id": 64827, "text": "We may refuse for those who have no repetition and need too many technical means (for example, need to develop new systems or fundamentally change the current management), bring risks or very unrealistic requests to others' legitimate rights and interests.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may refuse to reject those who have no repetition, need too much technical means, bring risks or very unrealistic requests to others."}
{"task": "rw_80.jsonl", "id": 64828, "text": "In addition, if your request directly involves the direct related interests of national security, defense security, public health, criminal investigation, etc., or may cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged, or it is based on the Himalayas' performance of laws and regulations.The stipulated cases related to obligations, or have sufficient evidence that you have subjective malice or abuse of rights, or respond to your request that will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged, and we will not be able to respond to your request.", "label": ["Edit/Control", "Risk"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64829, "text": "If you cannot access your personal information through the above way, you can contact us through the contact information in Section 9, and we will reply to your right response request within 15 days.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64830, "text": "8. How to revise this policy", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64831, "text": "Himalayan may modify this policy regularly. After the agreement is modified, the Himalayan will publish the modified content on the related pages or other appropriate ways.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64832, "text": "According to the requirements of laws and regulations, we will list the previous version of this policy on the official website so that you can check it.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64833, "text": "If you do not agree with the modification of this agreement, please stop using the platform or cancel the service you have obtained;", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with the amendment of this agreement, please stop using the platform or cancel the services you have obtained."}
{"task": "rw_80.jsonl", "id": 64834, "text": "If you choose to continue accessing or using platforms or services after the policy is modified, it means you agree that the updated privacy policy and its related policies are constrained.", "label": ["Policy Change", "Important"], "rewrite": "If you choose to continue accessing or using platforms or services after the policy is modified, it means you agree that the updated privacy policy and its related policies are constrained."}
{"task": "rw_80.jsonl", "id": 64835, "text": "You understand that the terms of this policy signed with the Himalayan company cannot completely cover all your rights and obligations on personal information about your personal information.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64836, "text": "Therefore, the Himalayan company announced other statements and various forms of rules as supplementary clauses of this policy. It is an integral part of this policy, and has the same legal effect as this agreement.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64837, "text": "Without your consent, we will not limit the rights you should enjoy in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64838, "text": "We will release any changes and updates made on the Privacy Policy on the Himalaya platform.", "label": ["Policy Change", "Important"], "rewrite": "We will release any changes and updates made on the Privacy Policy on the Himalaya platform."}
{"task": "rw_80.jsonl", "id": 64839, "text": "For major changes, we will also provide more significant notifications (including public notifications through platform publicity and even pop -up notices).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide more significant notifications (including public notifications through platform publicity and even pop -up notices)."}
{"task": "rw_80.jsonl", "id": 64840, "text": "The major changes in this policy include, but not limited to:", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64841, "text": "1. Our service model has changed significantly.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64842, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64843, "text": "2. We have undergone major changes in control.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64844, "text": "If the owner of the merger acquisition and reorganization is changed;", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64845, "text": "3. The main object of personal information sharing, transfer or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64846, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64847, "text": "5. When we are responsible for handling the responsibility departments, contact methods and complaint channels of personal information security.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64848, "text": "In order to receive notifications in time, it is recommended that you notify us in time when your personal contact information is updated.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64849, "text": "If you continue to use our services after the policy update is effective, it means that you have fully read, understand and accept the updated policy and are willing to be subject to updated policy constraints.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64850, "text": "We encourage you to check this policy every time we use our services.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64851, "text": "You can view this policy through the \"Homepage-Settings-Privacy Settings-Privacy Settings-Privacy Settings-Privacy Settings-Privacy Settings-Privacy Settings-Himalayan User Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64852, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64853, "text": "You can contact us through the following ways. We will reply to your request within 15 working days:", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64854, "text": "We have set up a full -time department for personal information protection. For example, if you have any questions, opinions or suggestions on the Privacy Information Protection Policy of Himalayan, or have any questions, opinions or suggestions for children's personal information, or complaints and reports on network information security, you can get in contact with us through the following ways:", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64855, "text": "Our receiving address: No. 3 National Innovation Center, No. 799 Dangui Road, Pudong New District, Shanghai;", "label": ["Important", "Contact Information"], "rewrite": "Our receiving address: No. 3 National Innovation Center, No. 799 Dangui Road, Pudong New District, Shanghai."}
{"task": "rw_80.jsonl", "id": 64856, "text": "Contact: Himalayan Customer Service Department", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64857, "text": "Contact: 400-838-5616", "label": ["Important", "Contact Information"], "rewrite": "Contact: 400-838-5616."}
{"task": "rw_80.jsonl", "id": 64858, "text": "Contact email: privacy@ximalaya.com", "label": ["Important", "Contact Information"], "rewrite": "Contact email: privacy@ximalaya.com."}
{"task": "rw_80.jsonl", "id": 64859, "text": "The signing of this agreement is the Pudong New District of the People's Republic of China in Shanghai. Due to the effectiveness, performance, explanation and use of the Himalayan platform or service due to the effectiveness, performance, and all matters related to this agreement due to the effectiveness of this agreement.Law (for the purpose of this agreement, laws in Hong Kong, Macao and Taiwan are not listed here).", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64860, "text": "All controversy that occurred with Himalayan and its affiliated companies or Himalaya platforms should be friendly and negotiated. If negotiations cannot be achieved, you agree that the two parties will resolveEssence", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64861, "text": "Please confirm that you have read all of them and fully understand the above terms.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64862, "text": "Note: The update date of this policy version is June 22, 2022. If you think the update policy is more favorable, we agree that the two parties will apply the content of this policy.", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64863, "text": "Attachment: \"SDK situation of the Himalayan APP involved in personal information transmission\"", "label": [], "rewrite": []}
{"task": "rw_80.jsonl", "id": 64864, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
