{"task": "rw_82.jsonl", "id": 65136, "text": "Privacy Policy in Xianyu Community", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65137, "text": "Update date: June 29, 2022", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65138, "text": "【introduction】", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65139, "text": "You are welcome to use our products and services!", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65140, "text": "We know the importance of personal information to you. Your trust is very important to us. We will strictly abide by laws and regulations to take corresponding security protection measures to protect your personal information security and controlling.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65141, "text": "Based on this, the service provider (or \"us\", see Appendix: Related Definition) to formulate this \"Leisure Fish Community Privacy Policy\" (hereinafter referred to as \"this policy\"/\"this privacy policy\") to help you fully understandIn the process of using our products and services, how will we collect, use, share, store, and protect your personal information, as well as how you can manage your personal information so that you can make a better choice.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65142, "text": "Before you start using our products and services, please read and understand this policy carefully. In particular, we should focus on reading the clauses of the line identification of the lines under the body to ensure that you fully understand and agree before you start using it.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65143, "text": "The professional vocabulary involved in this policy, we try to explain to you in a concise and popular expression in order to facilitate your understanding.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65144, "text": "If you have any questions, opinions or suggestions on the content of this policy, you can contact us through the contact information at the end of this policy.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65145, "text": "You agree that this policy said that you have understood the functions provided by the application, and the necessary personal information required for functional operation, and give corresponding collection and use authorization, but it does not meanThe opening, processing non -necessary personal information and processing sensitive personal information, we will solicit your consent separately according to your actual usage.", "label": ["Policy Change", "Important"], "rewrite": "You agree that this policy indicates that you have understood the functions provided by the application, and the necessary personal information, and give the corresponding collection and use authorization, but it does not meanUse your consent separately."}
{"task": "rw_82.jsonl", "id": 65146, "text": "This privacy policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65147, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65148, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65149, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65150, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65151, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65152, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65153, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65154, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65155, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65156, "text": "1. Scope of application", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65157, "text": "This policy is applicable to the various products and services provided by you with new forms (collectively referred to as the \"Leisure Fish Community\") to you with the development of the leisure fish community website, client, applet, and new forms.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65158, "text": "In addition to the relevant information collection and use activities described by this policy, this policy is not applicable to other services you provided by the idle fish community and other third directions. Other services are suitable for the personal information collection and use rules it explained to you.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65159, "text": "2. Information collection and use", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65160, "text": "When you use our products/services, the personal information we need/may need to collect and use includes the following:", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65161, "text": "1. In order to realize the basic functions of providing you with our products and/or services, you must authorize us to collect and use the necessary information.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65162, "text": "If you refuse to provide the corresponding information, you will not be able to use our products and/or services normally;", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65163, "text": "2. In order to provide you with additional functions to our products and/or services, you can choose to agree or disagree with the information we collected and used alone.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65164, "text": "If you refuse to provide it, you will not be able to use related additional functions normally or cannot achieve the functional effects we intend to achieve, which will not affect your basic functions.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65165, "text": "We are here to remind you that we are committed to creating a variety of products and services to meet your needs.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65166, "text": "Because there are many types and services we provide to you, and there are differences in the scope of the specific product/service selected by different users, the basic/additional functions and the personal information types and scope of personal information and use will be different. Please use specific ones.Product/service function shall prevail.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65167, "text": "The specific feature scenarios we will provide you include::", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65168, "text": "(1) Help you become our user and account management", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65169, "text": "1. Basic user service", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65170, "text": "You need to complete the free fish community account login to use the complete service. If you do not complete your account login, you will only use browsing and search services.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65171, "text": "2. Additional user service", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65172, "text": "Special user equity: If you choose to fill in gender, date of birth, place of residence, nickname, avatar, we can provide you with membership privilege services.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65173, "text": "Among them, the nicknames and avatars you set will be displayed publicly.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The nicknames and avatars you set will be displayed publicly."}
{"task": "rw_82.jsonl", "id": 65174, "text": "Real name/actual authentication: If there is a scene of the real identity of the user in accordance with the law (including the release of idle items, purchase specific products or become other certified members, protect the rights and interests of minors in accordance with the law, combat telecommunications network fraud, and deduct you for youTaxes and fees, administrative law enforcement or relevant subjects in the relevant subjects), we will ask you to provide you with your true identity information (ID information and/or facial information) and/or corporate related information to complete the real -name certification.", "label": ["Important", "First Party Collection Information"], "rewrite": "If there is a scene of the user's true identity in accordance with the law, we will ask you to provide you with your true identity information (ID information and/or facial information) and/or corporate related information to complete the real -name authentication."}
{"task": "rw_82.jsonl", "id": 65175, "text": "In order to achieve the purpose of certification, you need to actively provide relevant real identity information (name, document number and other documents or facial recognition information, which may be different according to the actual situation, subject to page prompts) and authorize us to pass the national authority and credible identity certificationThe institution conducts information verification;", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to achieve the purpose of certification, you need to actively provide relevant authentic identity information and authorize us to conduct information verification through national authoritative identity authentication agencies."}
{"task": "rw_82.jsonl", "id": 65176, "text": "Or you authorize us to obtain your necessary authentication identity information for your Binding Alipay account from Alipay.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65177, "text": "We will record, save certification information and certification results in accordance with the law. This information is for the completion of certification purposes, or the purpose stipulated in other laws and regulations, and will not be used as other purposes without your explicit authorization.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will record, save certification information and certification results in accordance with the law. This information is for the completion of certification purposes, or the purpose stipulated in other laws and regulations, and will not be used as other purposes without your explicit authorization."}
{"task": "rw_82.jsonl", "id": 65178, "text": "In addition, in order to ensure the safe operation of the functions of community functions such as the use of the idle fish community, participating in promotional activities, or user interaction, we need to check the real -name authentication status of the Alipay account binding to Alipay to verify your basic participationConditions to ensure your activity experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to check the real -name authentication status of the Alipay account you binding to Alipay to verify your basic participation conditions to ensure your activities."}
{"task": "rw_82.jsonl", "id": 65179, "text": "Authorized login: We may provide your account information (avatar, nickname, and other pages prompt information) to third parties after you agree with you alone, so that you can easily implement the registration or login of a third -party account in order to use the idle fish community in the idle fish communityThe services you provide in the third direction.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may provide your account information (avatar, nickname, and other pages prompts) to third parties after you agree."}
{"task": "rw_82.jsonl", "id": 65180, "text": "In addition, we may obtain your third -party account information from a third party based on your separate consent and bind it with your idle fish community account, so that you can log in to the third party and use our products and//Or service.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may obtain your third -party account information from a third party based on your individual consent."}
{"task": "rw_82.jsonl", "id": 65181, "text": "We will use your relevant information within the scope of the authorization you agree with.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will use your relevant information within the scope of the authorization you agree with."}
{"task": "rw_82.jsonl", "id": 65182, "text": "(2) Show you product or service information to you", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65183, "text": "In order to show you the product or service information, including your access footprint and historical search situation, we will collect and use your browsing and search records when you visit or use the idle fish community website or client.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect and search and search for your browsing and search records when you visit or use the idle fish community website or client."}
{"task": "rw_82.jsonl", "id": 65184, "text": "Sorting services or other information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We will combine equipment information, service log information collected in accordance with the law, and other information that get your authorization to predict your preference characteristics through algorithm models."}
{"task": "rw_82.jsonl", "id": 65185, "text": "In order to meet your diverse needs, we will introduce diversified recommendation technologies during the sorting process, expand the recommended content, and avoid excessive concentration of the same type of content.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65186, "text": "We will also push you a business advertisement and other information that you may be interested in based on your preference characteristics based on your preferences (some products/services that are applicable to this policy do not involve personalized information display based on personal characteristics), or send you to youBusiness short information.", "label": ["Important", "Usage"], "rewrite": "We will also push you a business advertisement and other information that you may be interested in based on your preferences, or send you commercial short information to you."}
{"task": "rw_82.jsonl", "id": 65187, "text": "At the same time, we strive to ensure your privacy experience through the following measures:", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65188, "text": "1. If you want to delete your browsing and search records, you can choose to delete in \"Search Box-History Search\";", "label": ["Edit/Control", "Important"], "rewrite": "If you want to delete your browsing and search records, you can choose to delete in \"Search Box-History Search\"."}
{"task": "rw_82.jsonl", "id": 65189, "text": "2. If you don't want to accept the business information we send to you, you can reply or close the withdrawal or other ways we provided by the SMS prompt;", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65190, "text": "3. If you need to check the sorting of your personal characteristics when using the search service you provided by us, you can click the corresponding button on the search results page to select the \"credit\", \"price\", \"region\", \"\" region \",\"Setting \"General Sorting\" and other settings;", "label": ["Important", "Edit/Control"], "rewrite": "If you use the search service you provide, you need to check the sorting of your personal characteristics. You can click the corresponding button and set it on the search results page."}
{"task": "rw_82.jsonl", "id": 65191, "text": "4. If you don't want to see the products or services recommended for you on the homepage or enter the payment page, you can select the product or service picture of the recommended product or service, select a shielding similar product or in the subsequent pop -up window according to the prompt or the prompts or similar products or similar products or similar products or in the prompts.Categories of goods or services;", "label": ["Edit/Control", "Important"], "rewrite": "If you don't want to see the products or services recommended for you on your homepage or enter the payment completion page, you can choose the recommended product or service picture of the recommended product or service, and select a similar product or product or product or product or product or product or product or product or product in the subsequent pop -up window.The category of service."}
{"task": "rw_82.jsonl", "id": 65192, "text": "You can set up in \"My-Settings-Privacy-Personalized Content Recommendation\".", "label": ["Edit/Control", "Important"], "rewrite": "You can set up in \"My-Settings-Privacy-Personalized Content Recommendation\"."}
{"task": "rw_82.jsonl", "id": 65193, "text": "(3) Provide you with the functions of collection, purchase, attention and sharing", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65194, "text": "In the process of visiting our website or client, you can choose to collect the products and/or services that are interested in, establish a attention relationship with the seller/other members you are interested in, and share the products from the third party through the functional components provided by us./Service Information.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65195, "text": "In the process of using the above features, we will collect service log information including your collection records, concerns, and sharing history to achieve the above functions and other purposes we have clearly notified.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect service log information including your collection records, concerns, and sharing history to achieve the above functions and the purpose we have clearly notified."}
{"task": "rw_82.jsonl", "id": 65196, "text": "You can view or manage your collection information in \"My-Collection\".", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65197, "text": "(4) Help you complete the order and order management", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65198, "text": "When you order specific products and/or services in our products and/or services, we will generate orders for you to buy the product and/or service for you through the system.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65199, "text": "In the process of ordering, you need to provide at least your consignee's name, delivery address, and consignee contact phone number. For some special types of goods and services, you also need to provide other information necessary for the product or service, such as involving it involvedYou need to provide your identity information during cross -border transactions to complete customs clearance.", "label": ["Important", "First Party Collection Information"], "rewrite": "You need to provide at least your consignee's name, the receiving address, and the telephone number of the consignee. For some special types of goods and services, you also need to provide other information necessary for the product or service."}
{"task": "rw_82.jsonl", "id": 65200, "text": "At the same time, this order will contain the goods and/or service information you purchased, the specific order number, the time of order creation, the amount you should pay, your remarks information.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65201, "text": "We collect this information to help you successfully complete the transaction, ensure your transaction security, facilitate your inquiry of order information, provide customer service and after -sales service and other purposes that we clearly notify.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect this information to help you successfully complete the transaction, ensure your transaction security, facilitate your inquiry of order information, provide customer service and after -sales service and other purposes that we clearly notify."}
{"task": "rw_82.jsonl", "id": 65202, "text": "You can order goods and/or services for others through the idle fish community. You need to provide the aforementioned personal information of the actual consignee and ensure that the actual consignee has obtained the consent of the actual consignee.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can order goods and/or services for others through the idle fish community. You need to provide the aforementioned personal information of the actual consignee and ensure that the actual consignee has obtained the consent of the actual consignee."}
{"task": "rw_82.jsonl", "id": 65203, "text": "To facilitate your understanding, query order information and manage order information, we will collect the order information you generated during our service process to display and facilitate the management of your order.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect the order information you generated during the use of our service to show you and facilitate the management of your order."}
{"task": "rw_82.jsonl", "id": 65204, "text": "You can fill in/select more additional information including other contact calls and receipt time to ensure the accurate delivery of goods or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "You can fill in/select more additional information including other contact calls and receipt time to ensure the accurate delivery of goods or services."}
{"task": "rw_82.jsonl", "id": 65205, "text": "You can check and manage your order information through \"I bought\" and \"I sold\".", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65206, "text": "(5) Help you complete the payment", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65207, "text": "To complete the order payment, you need to bind the Alipay account and choose the payment method.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65208, "text": "In order to match the information matching and completion of the information between the idle fish community account and the Alipay account, Alipay will provide us with your Alipay user number and account type. We will provide Alipay with the corresponding idle fish community account ID and membership name.", "label": ["Important", "First Party Collection Information"], "rewrite": "Alipay will provide us with your Alipay user number and account type. We will provide Alipay with the corresponding idle fish community account ID and membership name."}
{"task": "rw_82.jsonl", "id": 65209, "text": "We will develop your account member name, the corresponding Alipay account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws through the Alipay software tools embedded in the website or client (Software tool development packages are referred to as \"SDK\" in this policy) and other security methods shared with Alipay.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will share your account membership name, corresponding Alipay account member name, order payment related information, order security related equipment information, and other necessary information required by other anti -money laundering laws to develop packages and other security methods with Alipay."}
{"task": "rw_82.jsonl", "id": 65210, "text": "If you choose to provide you with a payment service by other financial institutions, we will also share your bank card payment, which is valid for the bank card, and share the necessary information of bank card payment with the corresponding financial institutions you choose.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you choose to provide you with a payment service by other financial institutions, we will also share your bank card payment, which is valid for the bank card, and share the necessary information of bank card payment with the corresponding financial institutions you choose."}
{"task": "rw_82.jsonl", "id": 65211, "text": "In order to allow us to learn and confirm your payment progress and status in a timely manner, and to provide you with service after -sales and dispute solutions, you agree that we can collect the transaction objects, Alipay or other financial institutions you choose.information.", "label": ["Important", "First Party Collection Information"], "rewrite": "You agree that we can collect and pay the progress related information from the transaction objects you choose, Alipay or other financial institutions you choose."}
{"task": "rw_82.jsonl", "id": 65212, "text": "You can view the Alipay account desensitization login information or application for your account or apply for replacing the bound Alipay account.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65213, "text": "(6) Help you complete the delivery of goods or services", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65214, "text": "In order to ensure that the goods and/or services you buy can be smooth, safe, and accurately provide, we will disclose delivery information related to the order of Zhejiang Cainiao Supply Chain Management Co., Ltd. to provide logistics information systems and technical services to the idle fish community.It also synchronizes related distribution information to the corresponding logistics distribution subject according to the choice of the main body of the goods and/or the service.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will disclose the delivery information related to order to Zhejiang Cainiao Supply Chain Management Co., Ltd., which provides logistics information systems and technical services to the idle fish community, and synchronize related to the corresponding logistics distribution subject according to the choice of the product and/or service subject according to the product and/or service subject.Delivery Information."}
{"task": "rw_82.jsonl", "id": 65215, "text": "You know and agree that the corresponding logistics distribution subject will inevitably know and use your delivery information to complete the delivery purpose.", "label": ["Important", "First Party Collection Information"], "rewrite": "You know and agree that the corresponding logistics distribution subject will inevitably know and use your delivery information to complete the delivery purpose."}
{"task": "rw_82.jsonl", "id": 65216, "text": "In order to provide you with the purpose of after -sales and dispute solutions, we need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress related to the main body of logistics.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need to learn and confirm the delivery progress and status in a timely manner. You agree that we can collect information related to the delivery progress related to the main body of the logistics."}
{"task": "rw_82.jsonl", "id": 65217, "text": "(7) Customer service and dispute handling", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65218, "text": "When you contact us or propose the application for sale, after -sales, and dispute dispute handling, in order to ensure your account and system security, we need you to provide the necessary personal information to verify your membership status.", "label": ["Important", "First Party Collection Information"], "rewrite": "We need you to provide the necessary personal information to verify your membership."}
{"task": "rw_82.jsonl", "id": 65219, "text": "In order to facilitate the processing plan and results of helping you solve the problem or record related issues as soon as possible, we may preserve your communication, communication/call records and related content (including account information, order information, to prove the relevant related to related related to the relevantOther information provided by the facts, or the contact information you leave).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may preserve your communication, communication/call records and related content (including account information, order information, other information provided by the relevant facts, or the contact information you leave)."}
{"task": "rw_82.jsonl", "id": 65220, "text": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information.", "label": ["Important", "Usage"], "rewrite": "If you consult, complain or provide suggestions for specific orders, we will use your account information and order information."}
{"task": "rw_82.jsonl", "id": 65221, "text": "In order to provide reasonable needs of services and improve service quality, other information we may also use, including the relevant information you provided when you contact the customer service, the questionnaire answering information you sent to us during the questionnaire survey.", "label": ["Important", "Usage"], "rewrite": "The other information we may also use, including the relevant information you provided when you contact the customer service, and the questionnaire answering information you sent to us during the questionnaire survey."}
{"task": "rw_82.jsonl", "id": 65222, "text": "(8) Provide you with information disclosure release function", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65223, "text": "You can select the message, comment and other information release functions that we provide for you, choose to publicly publish graphic/video content, publish messages, evaluation and Q & A content, one -click to resold the products purchased from Taobao platforms, and publish products as sellers as sellersAnd/or service related information, store -related information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65224, "text": "We respect and protect your settings of the relevant information and the scope of the release.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65225, "text": "We may judge whether you can enjoy the corresponding information release function permissions based on your user type and network log information.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65226, "text": "Please note that the information you publish may involve your or other people's personal information and even sensitive personal information. If you choose to upload pictures containing personal information when evaluating.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65227, "text": "Please consider whether to share or even publicly share relevant information when using our services.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65228, "text": "If you involve the personal information of others in your public release, you need to obtain the consent of others before the release.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65229, "text": "(9) Provide you with security", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65230, "text": "In order to fulfill the legal obligations to ensure the security of transactions, improve the security of your use of us and our affiliates and partners, protect the safety of your or other users or the public, and better prevent fishing websites, fraud, fraud, andNetwork vulnerabilities, computer viruses, network attacks, network invasion risks, and more accurately identify the cases of violating laws and regulations or related agreements and rules of the idle fish community., Service log information, and may use or integrate your membership information, transaction information, equipment information, service log information, and information that our affiliated companies and partners obtain your authorization or sharing according to law (Among them, we may run in the background of the application background.During the period, collect MAC addresses, IMEI, and other device identifiers for risk verification) to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "In the application, we embed the application security SDK developed by our affiliated company to collect your equipment information and service log information, and may use or integrate your membership information, transaction information, equipment information, service log information, and our affiliated companies and partners and partnersObtain information on your authorization or sharing according to law."}
{"task": "rw_82.jsonl", "id": 65231, "text": "(10) Other additional services provided for you", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65232, "text": "1. Additional services based on system permissions", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65233, "text": "To provide you with more convenient, better, personalized products and/or services, and strive to improve your experience, we may collect and use your personal information by opening system permissions in the following additional services.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We may collect and use your personal information by opening system permissions in the following additional services."}
{"task": "rw_82.jsonl", "id": 65234, "text": "If you do not agree to start the relevant permissions, it will not affect your basic services to use the idle fish community, but you may not be able to obtain the user experience brought by these additional services to you.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not agree to start the relevant permissions, it will not affect your basic services to use the idle fish community, but you may not be able to obtain the user experience brought by these additional services to you."}
{"task": "rw_82.jsonl", "id": 65235, "text": "You can decide these permissions to open or close at any time.", "label": ["Important", "Edit/Control"], "rewrite": "You can decide these permissions to open or close at any time."}
{"task": "rw_82.jsonl", "id": 65236, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the right of power, it means that you cancel the authorization.With relevant personal information, you cannot continue to provide you with the service corresponding to the permissions.", "label": ["Important", "Edit/Control"], "rewrite": "If you turn on one authority, it means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you turn off the power, it means that you cancel the authorization. We will no longer continue to collect and use relevant individuals based on the corresponding authority.Information cannot continue to provide you with the service corresponding to the permissions."}
{"task": "rw_82.jsonl", "id": 65237, "text": "The decision of your closure authority will not affect the collection and use of information based on your authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_82.jsonl", "id": 65238, "text": "You can click here to view the application authority application and usage description.", "label": ["Permission Acquisition", "Important"], "rewrite": "The decision of your closure authority will not affect the collection and use of information based on your authorization."}
{"task": "rw_82.jsonl", "id": 65239, "text": "2. Cookie and services of similar technologies", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65240, "text": "Cookie and similar device information identification technology are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65241, "text": "When you use our service, we may use related technologies to send one or more cookies or anonymous identifiers (hereinafter referred to as \"Cookie\") to your device to collect, identify and store your access, and use this product to use this product.information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may use related technologies to send one or more cookie or anonymous identifiers (hereinafter referred to as \"Cookie\") to your device to collect, identify and store your information when you access and use this product."}
{"task": "rw_82.jsonl", "id": 65242, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65243, "text": "We use Cookie to ensure the safety and efficient operation of products and services. It can make us confirm the security status of your account and transaction, check the related abnormal conditions of collapse and delay, and help you save the steps of filling in your form and entering search content.And process.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65244, "text": "At the same time, we may use Cookie to show you the information or functions you may be interested in and optimize your choice of advertising.", "label": ["Important", "Usage"], "rewrite": "We may use Cookie to show you the information or functions you may be interested in and optimize your choice of advertising."}
{"task": "rw_82.jsonl", "id": 65245, "text": "Most browsers provide users with the function of removing the browser cache data. You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of cookies or reject our cookies.", "label": ["Edit/Control", "Important"], "rewrite": "You can perform the corresponding data clearing operation, or you can modify the degree of acceptance of Cookie or reject our cookies."}
{"task": "rw_82.jsonl", "id": 65246, "text": "You may not be able to use services or corresponding functions that depend on cookies because of these modifications.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65247, "text": "(11) Other rules of collecting and using personal information", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65248, "text": "1. If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing these personal information to the idle fish community.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the information you provide contains personal information of other users, you need to ensure that you have obtained legal authorization before providing these personal information to the idle fish community."}
{"task": "rw_82.jsonl", "id": 65249, "text": "2. If we use information for other purposes that are not stated in this policy, or use information collected based on specific purposes for other purposes, we will get your consent in advance.", "label": ["Important", "Usage"], "rewrite": "If we use the information that the information is not stated in this policy, or the information collected based on specific purposes for other purposes, you will get your consent in advance."}
{"task": "rw_82.jsonl", "id": 65250, "text": "3. Under the premise of strictly identifying and unable to re -identify specific individuals through security encryption technology, we will use the collected data for machine learning, algorithm model training or other data analysis and mining processing to better guaranteeOur product experience and auxiliary business decision analysis.", "label": ["Important", "Usage"], "rewrite": "Under the premise of strictly identifying the safety encryption technology and unable to re -identify specific individuals, we will use the collected data for machine learning, algorithm model training or other data analysis and mining processing."}
{"task": "rw_82.jsonl", "id": 65251, "text": "3. Provide information to the outside world", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65252, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65253, "text": "We will not share your personal information with companies, organizations, and individuals other than the service provider of Xianyu Community, except the following situations:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We will not share your personal information with companies, organizations, and individuals other than the service provider of Xianyu Community, except the following situations:"}
{"task": "rw_82.jsonl", "id": 65254, "text": "1. Perform the sharing necessary for the legal obligations: we may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes in accordance with the requirements of administrative and judicial organs in accordance with the requirements of administrative and judicial organs in accordance with the law, and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, litigation, and disputes, or in accordance with the requirements put forward by administrative and judicial organs in accordance with the law, as well as other legal obligations."}
{"task": "rw_82.jsonl", "id": 65255, "text": "2. Sharing your consent: After getting your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "After getting your clear consent, we will share your personal information with other parties."}
{"task": "rw_82.jsonl", "id": 65256, "text": "3. The shared sharing in order to establish and fulfill your contract as a party as a party: if you buy and sell goods or provide/accept services through the idle fish community, we will according to your choice.Necessary information sharing with providers of related products or services to realize your needs of transactions, distribution and after -sales service.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "According to your choice, we will share the necessary information related to transaction information in your order information to providers related to related products or services to achieve your needs of transactions, distribution and after -sales service."}
{"task": "rw_82.jsonl", "id": 65257, "text": "4. Sharing with affiliated companies: In order to facilitate us to provide some services to you with affiliates, such as providing products and services based on accounts, recommending information that you may be interested in, identifying abnormal membership accounts, protecting the idle fish community affiliated companyOr for other users or the public's personal property security is unruly, your personal information may be shared with our affiliated company and/or its designated service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your personal information may be shared with our affiliated companies and/or its designated service providers."}
{"task": "rw_82.jsonl", "id": 65258, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information and be restricted by the purpose declared in this policy. If we share your sensitive personal information or the purpose of changing personal information to change personal information, we will solicit your authorization consent again."}
{"task": "rw_82.jsonl", "id": 65259, "text": "You can click here to view the data sharing of the idle fish community.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the data sharing of the idle fish community."}
{"task": "rw_82.jsonl", "id": 65260, "text": "Please note that when you use our service, you voluntarily share or even publicly share information, which may involve your or other people's personal information and even sensitive personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When you use our service, you voluntarily shared or even publicly shared information, which may involve personal information of you or others and even sensitive personal information."}
{"task": "rw_82.jsonl", "id": 65261, "text": "Please consider and make a decision more cautiously.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65262, "text": "(2) Entrusted processing", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65263, "text": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may entrust a partner to handle your personal information in order to authorize partners to represent you to provide you with certain services or fulfilling functions."}
{"task": "rw_82.jsonl", "id": 65264, "text": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only entrust their information for the legal, correct, necessary, specific, and clear goals of this policy statement. We can authorize partners to only contact the information required by their duties, and we will ask for the agreement to request that it must not be requiredThis information is used for any other purpose beyond the scope of commission."}
{"task": "rw_82.jsonl", "id": 65265, "text": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the authorized partner will use your information for our unreasonable purpose, it will obtain your consent alone."}
{"task": "rw_82.jsonl", "id": 65266, "text": "At present, our authorized partners include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65267, "text": "1. Authorized partners of advertising and analysis of service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65268, "text": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Under the premise of using industry -universal security technology, we will entrust these partners to handle information about advertising, coverage, and effectiveness related to advertising."}
{"task": "rw_82.jsonl", "id": 65269, "text": "We will not commission your personal identity information to commission partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not commission your personal identity information to commission partners."}
{"task": "rw_82.jsonl", "id": 65270, "text": "2. Suppliers, service providers and other partners.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65271, "text": "We entrust the information to the suppliers, service providers and other partners who support our business to handle it. These support for the technical infrastructure services that we are entrusted to provide, analyze the usage methods of our services, provide customer service, pay conveniently, or perform academic academic academicsResearch and investigation.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We entrust the information to the suppliers, service providers and other partners who support our business."}
{"task": "rw_82.jsonl", "id": 65272, "text": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to ensure the stable operation and functional implementation of our client, so that you can use and enjoy more services and functions. Our application will embed the SDK or other similar applications of authorized partners."}
{"task": "rw_82.jsonl", "id": 65273, "text": "We will strictly test the application interface (API) and software tool development package (SDK) of the authorized partners to obtain relevant information, and strict data protection measures with the authorized partners, so that it will be in accordance with this policy and any other any otherRelated confidentiality and security measures to handle personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will strictly test the application interface (API) and software tool development package (SDK) of authorized partners to obtain relevant information, and strict data protection measures with authorized partners."}
{"task": "rw_82.jsonl", "id": 65274, "text": "You can click here to view the details we access.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click here to view the details we access."}
{"task": "rw_82.jsonl", "id": 65275, "text": "(3) Transfer", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65276, "text": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If we need to transfer personal information for the reasons for merging, separation, dissolution, and declaration of bankruptcy, we will inform you the name or name and contact information of the receiver."}
{"task": "rw_82.jsonl", "id": 65277, "text": "The receiver will continue to fulfill this policy and other legal obligations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The receiver will continue to fulfill this policy and other legal obligations."}
{"task": "rw_82.jsonl", "id": 65278, "text": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the receiver changes the original treatment purpose and method of processing, you will re -obtain your consent."}
{"task": "rw_82.jsonl", "id": 65279, "text": "(4) Public disclosure", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65280, "text": "We will only disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only disclose your personal information in the following circumstances:"}
{"task": "rw_82.jsonl", "id": 65281, "text": "1. Based on your active choice and other individual consent, we may publicly disclose your personal information;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65282, "text": "2. If we determine that you have violated laws and regulations or seriously violated related agreements and rules of the idle fish community, or to protect the safety of personal property of users or public personal property of the idle fish community, we may disclose personal information about you, includingRelated violations and measures that the idle fish community has taken you.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65283, "text": "(5) Information disclosure", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65284, "text": "In the scope permitted by the law, such as the needs of leisure fish users and right holders to apply for a rational protection need to complain to the relevant authorities or to prosecute to the court, and apply to the idle fish to obtain your name/business entity name (such as), ID number number number, ID number number(If you have), address and contact information, you agree that leisure fish can disclose the aforementioned information to it.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For example, based on the need for rights protection, the right to obtain your name/business entity name, ID number and other information, you need to authorize your idle fish to disclose the aforementioned information."}
{"task": "rw_82.jsonl", "id": 65285, "text": "Fourth, your rights", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65286, "text": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:", "label": ["Important", "Edit/Control"], "rewrite": "You can check and manage your information through the following ways, and we will respond to your request in the case of compliance with laws and regulations:"}
{"task": "rw_82.jsonl", "id": 65287, "text": "(1) Review, correct and supplement", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65288, "text": "You have the right to check, correct and supplement your information through the following ways:", "label": ["Edit/Control", "Important"], "rewrite": "You have the right to check, correct and supplement your information through the following ways:"}
{"task": "rw_82.jsonl", "id": 65289, "text": "1. Log in to the idle fish client and enter \"My - Settings -Personal Information Settings\";", "label": ["Important", "Edit/Control"], "rewrite": "Log in to the idle fish client and enter \"My - Settings -Personal Data Settings\"."}
{"task": "rw_82.jsonl", "id": 65290, "text": "2. Log in to the idle fish client and select \"My — help and customer service\".", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65291, "text": "(2) Copy", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65292, "text": "You can copy your personal information after the path listed in \"(1), correct, and supplement\".", "label": ["Important", "Edit/Control"], "rewrite": "You can copy your personal information after the path listed in \"(1), correct, and supplement\"."}
{"task": "rw_82.jsonl", "id": 65293, "text": "(3) Delete", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65294, "text": "You can delete all your information by applying for cancellation of idle fish services.", "label": ["Important", "Edit/Control"], "rewrite": "You can delete all your information by applying for cancellation of idle fish services."}
{"task": "rw_82.jsonl", "id": 65295, "text": "In the following circumstances, you can make a request to delete personal information through contact with the idle fish customer service:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65296, "text": "1. If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65297, "text": "2. If we collect and use your personal information, it has not obtained your clear consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65298, "text": "3. If our behavior of handling personal information seriously violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65299, "text": "4. If our treatment purpose has been achieved, cannot be achieved or is not necessary for the purpose of the treatment;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65300, "text": "5. If we stop providing products or services, or the storage period has expired.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65301, "text": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, we will also notify the subject of your personal information from our personal information as much as possible at the same time, and ask them to delete it in time (unless laws and regulations have other regulations, or these subjects have independently obtained your authorization)Essence"}
{"task": "rw_82.jsonl", "id": 65302, "text": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "When you or we assisted you to delete the relevant information, because of the applicable legal and security technical restrictions, we may not be able to immediately delete the corresponding information from the backup system.Treatment until the backup can be removed or achieved anonymous."}
{"task": "rw_82.jsonl", "id": 65303, "text": "(4) Change the scope of authorization", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65304, "text": "You can change or withdraw the scope of your personal information through contact with the idle fish customer service or withdrawn from you, but please note that for some types of personal information, such as the information necessary for the basic functions of the idle fish community, or we can fulfill the law of the law, we fulfill the law.The required information required by the regulations may not be able to respond to the request that you change the scope of authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "You can change or withdraw from the free fish customer service or withdrawn from the scope of the collection and processing of your personal information."}
{"task": "rw_82.jsonl", "id": 65305, "text": "When you withdraw authorization, we will no longer process the corresponding personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw authorization, we will no longer process the corresponding personal information."}
{"task": "rw_82.jsonl", "id": 65306, "text": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "But your decision to withdraw authorization will not affect our personal information processing based on your previous authorization."}
{"task": "rw_82.jsonl", "id": 65307, "text": "(5) Logging out the account", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65308, "text": "You can apply for a cancellation of your idle fish service in the following ways:", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65309, "text": "1. Submit a cancellation application in \"My - Settings -Accounting -Logging out of Leisure Fish Service\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65310, "text": "2. Through customer service contact, apply for cancellation of your idle fish service.", "label": ["Important", "Edit/Control"], "rewrite": "Apply for your idle fish service through customer service."}
{"task": "rw_82.jsonl", "id": 65311, "text": "After you actively cancel the idle fish service, we will stop providing you with products or services, and delete or process your personal information according to the requirements of applicable laws.", "label": ["Important", "Edit/Control"], "rewrite": "After you actively cancel the idle fish service, we will stop providing you with products or services, and delete or process your personal information according to the requirements of applicable laws."}
{"task": "rw_82.jsonl", "id": 65312, "text": "(6) Automatic decision -making of constraint information system", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65313, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including the algorithm.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65314, "text": "If these decisions affect your legitimate rights and interests, you can contact us through customer service.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65315, "text": "(7) Responsive your above request", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65316, "text": "For your or your guardians, close relatives, and other authority to make the above requests to us, and your relevant personal information rights stipulated by the Law of the People's Republic of China and other applicable laws, you can contact us or directly through the idle fish customer service or directly or directlyLay up to our personal information protection full -time department.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65317, "text": "We will make a reply within 15 days.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65318, "text": "To ensure your account security and your personal information security, when you make a request to us, we may verify your identity (such as adding account verification, requesting you to provide written requests or other reasonable ways), and then process youRequest.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65319, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "For your reasonable request, we do not charge fees in principle, but we will charge a certain fee as appropriate for requests that repeat and beyond the reasonable limit."}
{"task": "rw_82.jsonl", "id": 65320, "text": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or you need too many technical means (if you need to develop a new system or change the current convention fundamentally), bring risks to others' legitimate rights or notIn actual requests, we may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For information that is not directly associated with your identity, the information that is repeatedly applied without reasonable reasons, or requires too much technical means, bring risks or unrealistic requests to others' legitimate rights and interests, we may refuse."}
{"task": "rw_82.jsonl", "id": 65321, "text": "5. Storage of information", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65322, "text": "(1) Storage period", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65323, "text": "We will only retain your personal information within the time limit required for the purpose of the cost of reaching the cost policy, unless the law has compulsory retention requirements, such as the required product and service information and transaction information to be stored in accordance with the regulations of the lawsuit.It's not less than three years.", "label": ["Data Retention", "Important"], "rewrite": "We will only retain your personal information within the time limit of the cost of reaching the cost of the cost, unless the law has compulsory retention requirements."}
{"task": "rw_82.jsonl", "id": 65324, "text": "We judge the storage period of personal information mainly based on the following standards:", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65325, "text": "1. Complete your related transaction purpose, maintain the corresponding transactions and business records to cope with your possible inquiries or complaints;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65326, "text": "2. Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65327, "text": "3. Do you agree to a longer retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65328, "text": "4. Whether there are other special agreement or laws and regulations on the retention period.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65329, "text": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the reservation period, we will delete or deal with your personal information according to the requirements of the applicable law."}
{"task": "rw_82.jsonl", "id": 65330, "text": "(2) Storage location", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65331, "text": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information we collected and generated in the operation of the People's Republic of China will be stored in China."}
{"task": "rw_82.jsonl", "id": 65332, "text": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "In the following circumstances, we will provide your personal information to possible overseas entities after fulfilling the obligations stipulated in the law:"}
{"task": "rw_82.jsonl", "id": 65333, "text": "1. Applicable laws have clear regulations;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If the applicable laws are clearly stipulated, personal information will be provided overseas."}
{"task": "rw_82.jsonl", "id": 65334, "text": "2. Get your individual consent;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If you get your own consent, you will provide personal information to your overseas."}
{"task": "rw_82.jsonl", "id": 65335, "text": "3. As a cross -border e -commerce transaction and other types of contracts for one party, you are necessary for the establishment and other types of contracts.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "As a party's cross -border e -commerce transaction and other types of contracts, you are necessary for the establishment of and performing and fulfilling your parties. You will provide personal information to overseas."}
{"task": "rw_82.jsonl", "id": 65336, "text": "In response to the above situations, we will protect your personal information security in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65337, "text": "(3) Storage safety", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65338, "text": "1. Data protection technical measures", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65339, "text": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost.", "label": ["Important", "Data Security"], "rewrite": "We have adopted our information that meets industry standards, reasonable and feasible security measures to protect your information, and prevent personal information from being disclosed, used, modified, damaged or lost by unauthorized access, publicly disclosed, used, modified, damaged, or lost."}
{"task": "rw_82.jsonl", "id": 65340, "text": "For example, we will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, we are encrypted by SSL protocols. We provide the HTTPS protocol security browsing method;", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology to improve the security of personal information. When you exchange data between your browser and the server, we are encrypted by SSL protocols. We provide the HTTPS protocol security browsing method."}
{"task": "rw_82.jsonl", "id": 65341, "text": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent personal information from being maliciously attacked."}
{"task": "rw_82.jsonl", "id": 65342, "text": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information.", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to make every effort to ensure that only authorized personnel can access personal information."}
{"task": "rw_82.jsonl", "id": 65343, "text": "2. Measures for data protection management organization", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65344, "text": "We have established a data security management system that is advanced in the industry with data as the core and the data security management system around the data life cycle, and improves the security of personal information from organizational construction, institutional design, personnel management and product technology.", "label": ["Important", "Data Security"], "rewrite": "We have established a data security management system that is advanced in the industry with data as the core and around the data life cycle."}
{"task": "rw_82.jsonl", "id": 65345, "text": "We have set up a full -time department for personal information protection.", "label": ["Important", "Data Security"], "rewrite": "We have set up a full -time department for personal information protection."}
{"task": "rw_82.jsonl", "id": 65346, "text": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "Through training courses and examinations, we have continuously strengthened employees' awareness of protecting the importance of personal information."}
{"task": "rw_82.jsonl", "id": 65347, "text": "3. Response of personal information security incident", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65348, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "If your legitimate rights and interests are damaged, we will launch an emergency plan in time and take reasonable and necessary measures to minimize the impact on your personal."}
{"task": "rw_82.jsonl", "id": 65349, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If personal information security incidents occur, we will also inform you that the basic situation and possible impact, disposal measures, suggestions, and remedy measures to you."}
{"task": "rw_82.jsonl", "id": 65350, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way."}
{"task": "rw_82.jsonl", "id": 65351, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_82.jsonl", "id": 65352, "text": "4. Prevention of account security risk", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65353, "text": "When using the idle fish community service for online transactions, you inevitably disclose your personal information from the other party or the potential transaction of the transaction, such as contact or contact address.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65354, "text": "In addition, you can also establish communication, exchange information or analysis content with our services.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65355, "text": "Please protect your personal information properly, provides others only under the necessary circumstances, and do not trust the transaction through other trading tools to avoid the stolen information or even encounter telecommunications network fraud.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65356, "text": "If you are worried about your personal information, especially your account or password, please contact our customer service immediately so that we can take corresponding measures based on your application.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65357, "text": "You can also independently perform \"account security\", \"account maintenance\" and \"device management\" in \"My-Settings-Security Center-Account Security\", and submit fraud money in \"My-Settings-Security Center-Report Center\"Complaints and reports of information leakage and sale of banned products.", "label": ["Edit/Control", "Important"], "rewrite": "You can also independently perform \"account security\", \"account maintenance\" and \"device management\" in \"My-Settings-Security Center-Account Security\", and submit fraud money in \"My-Settings-Security Center-Report Center\"Complaints and reports of information leakage and sale of banned products."}
{"task": "rw_82.jsonl", "id": 65358, "text": "6. Policy update", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65359, "text": "In order to bring you a better product and service experience, we continue to strive to improve our products, services and technology.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65360, "text": "When the new service and business processes change, we may update our privacy policy to inform you of specific changes.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65361, "text": "But without your clear consent, we will not limit your rights you enjoy in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65362, "text": "We will release any changes to this policy on the special page.", "label": ["Policy Change", "Important"], "rewrite": "We will release any changes to this policy on the special page."}
{"task": "rw_82.jsonl", "id": 65363, "text": "For major changes, we will also provide more prominent notifications (including we will notify or provide you with pop -up window prompts through the method of leisurely fish community).", "label": ["Policy Change", "Important"], "rewrite": "For major changes, we will also provide more prominent notifications (including we will notify or provide you with pop -up window prompts through the method of leisurely fish community)."}
{"task": "rw_82.jsonl", "id": 65364, "text": "The major changes in this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65365, "text": "1. The business model of the product has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65366, "text": "Such as the purpose of handling personal information, the type of personal information, and the use of personal information;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65367, "text": "2. The main body of the privacy policy caused by business adjustment and transaction mergers and acquisitions, and the new subject receiving party changes the original processing purpose and method of treatment;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65368, "text": "3. The main object of personal information sharing or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65369, "text": "4. User personal information rights and their exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65370, "text": "5. When dealing with the person in charge of the person in charge of the personal information protection and the change of complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65371, "text": "6. Personal information protection assessment report shows that the existence of products has a significant impact on personal rights.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65372, "text": "We will also archive the old version of this policy on the special page of the idle fish community for you to check.", "label": ["Policy Change", "Important"], "rewrite": "We will also archive the old version of this policy on the special page of the idle fish community for you to check."}
{"task": "rw_82.jsonl", "id": 65373, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65374, "text": "[We presented that you have the corresponding civil behavior capabilities during the leisure fish community activities.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65375, "text": "] If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, we ask you to ask your parents or other guardians to read this policy carefully, and use our services or provide information to us under the consent of your parents or other guardians."}
{"task": "rw_82.jsonl", "id": 65376, "text": "If you are under 14 years of age, [Before you use our service, you and your guardian should read our \"Personal Information Protection Rules for Children\" carefully to ensure that the guardian's \"Personal Information Protection Rules\" is obtainedAfter you agree], you can use our services under the guidance of the guardian to ensure that you are safe when using our services and trading.", "label": ["Specific Audiences", "Important"], "rewrite": "For children under the age of 14, after using our services, you and your guardians should read the \"Personal Information Protection Rules of Children\" to ensure that after obtaining the consent of the guardian, we can use the service under the guidance of the guardian."}
{"task": "rw_82.jsonl", "id": 65377, "text": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a child's parents or other guardians, please pay attention to whether the child uses our service after obtaining your authorization consent."}
{"task": "rw_82.jsonl", "id": 65378, "text": "If you have any questions about your child's personal information, please contact our personal information protection department.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65379, "text": "Eight, contact us", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65380, "text": "You can contact us in the following ways. We will reply to your request within 15 days:", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65381, "text": "1. If you have any questions, opinions or suggestions on the content of this policy, you can contact us through [idle fish online customer service];", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65382, "text": "2. We also set up a full -time department for personal information protection. You can use [pipwg@service.alibaba.com] to contact it (please indicate that it is related to the [Xianyu Community] and explain the specific facts), office address: [[[[[[[[[[[[[[[[[[[Legal Service Desk, Building 1, No. 4, No. 969, Wenyi West Road, Yuhang District, Hangzhou].", "label": ["Important", "Contact Information"], "rewrite": "We have also set up a full -time person for personal information protection, and you can contact it through [pipwg@service.alibaba.com]."}
{"task": "rw_82.jsonl", "id": 65383, "text": "It should be noted that we may not reply to the issue that has nothing to do with the right to this policy or your personal information.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65384, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legitimate rights and interests, you can also seek solutions by filed a lawsuit to a court with jurisdiction in the place of residence in the defendant.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65385, "text": "Appendix: Related Definition", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65386, "text": "Leisure fish community: refers to idle fish websites, clients, applets, etc. (including new service forms in the future of technology) with the domain name \"GOOFISH.com\".", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65387, "text": "Xianyu Community Service Provider: Refers to the Internet information and software technology service providers of Xianyu Community Zhejiang Alibaba Xianyu Network Technology Co., Ltd. and Hangzhou Chuan Orange Network Technology Co., Ltd. (can be called or collectively called \"us\").", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65388, "text": "Related Company: Refers to the related companies of the idle fish community service provider disclosed by AlibabaBABAGROUGROPHOLDINGLIMITED (AlibabaBABAGROUPHOLDINGLIMITED).", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65389, "text": "Alipay: Refers to the main Alipay (China) Network Technology Co., Ltd. providing Alipay services.", "label": [], "rewrite": []}
{"task": "rw_82.jsonl", "id": 65390, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
