{"task": "rw_93.jsonl", "id": 68413, "text": "Wake up privacy policy", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68414, "text": "Update date: June 29, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68415, "text": "Shenzhen Facemeng Technology Co., Ltd. and its related parties (referred to as \"we\" or \"company\") as operators of awakening pictures know the importance of personal information to you. We will protect your individuals in accordance with the provisions of laws and regulationsInformation and privacy security.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68416, "text": "We formulate this \"Wake -ups Privacy Policy\" (referred to as \"this privacy policy\") and special reminders: I hope you can read and understand the privacy policy carefully before using the wake -up map and related services to make appropriate choices.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68417, "text": "This privacy policy will help you understand:", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68418, "text": "We will follow your information to collect and use your information, but we will not collect personal information in a package of compulsory binding because you agree with your consent of this privacy policy.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68419, "text": "When you use or open related functions or use services, we will collect and use relevant information for the implementation of functions and services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68420, "text": "Unless it is necessary to realize business functions or necessary information that necessary in accordance with laws and regulations, you can refuse to provide and not affect other functions or services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68421, "text": "We will explain the information we want to collect in the privacy policy.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68422, "text": "When you use wake -up pictures for pictures/video editing, beautification, pictures repair, templates, login, sharing and other services, we may be based on legal requirements or implementation functions. We may be sensitiveInformation is collected or treated locally.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use wake -up pictures for pictures/video editing, beautification and other services, we may collect or handle personal sensitive information such as your picture/audio and video files, facial recognition features, and other personal sensitive information."}
{"task": "rw_93.jsonl", "id": 68423, "text": "You have the right to refuse to authorize this information or withdraw your authorization of this information.", "label": ["Important", "Edit/Control"], "rewrite": "You have the right to refuse to authorize or withdraw authorization of personal sensitive information such as picture/audio and video files and facial recognition features."}
{"task": "rw_93.jsonl", "id": 68424, "text": "Please understand, refusing or withdrawing the authorization consent will cause you to be unable to use relevant features, but it does not affect other services that use your normally using the wake -up map.", "label": ["Important", "First Party Collection Information"], "rewrite": "Rejection or withdrawal of authorization will cause you to be unable to use related specific functions, but does not affect the use of other functions."}
{"task": "rw_93.jsonl", "id": 68425, "text": "When you fully read and agree to this privacy policy and the \"Wake -up User Agreement\", it means that you have agreed to accept all the functional services of the wake -up map.", "label": ["Policy Change", "Important"], "rewrite": "When you fully read and agree to this privacy policy and the \"Wake -up User Agreement\" means you have agreed to accept all functional services."}
{"task": "rw_93.jsonl", "id": 68426, "text": "If you only want to use the basic functional service of the awakening map, you can close the \"personalized content recommendation\" to enter the basic function mode before the first time you agree to the \"Wake Picture\" personal information protection guidance.", "label": ["Important", "Edit/Control"], "rewrite": "You can close the \"personalized content recommendation\" to enter the basic functional mode at the same time before the first time he agrees with the \"wake -up\" personal information protection guidance."}
{"task": "rw_93.jsonl", "id": 68427, "text": "Other value -added function services, we will pop up a separate pop -up window to remind you, and only provide you with the consent of your authorization and collect relevant necessary information;", "label": ["Important", "First Party Collection Information"], "rewrite": "We will only provide other value -added services and collect relevant necessary information after obtaining your separate authorization consent."}
{"task": "rw_93.jsonl", "id": 68428, "text": "Please note that after you make a separate authorization consent (including but not limited to your active login of the wake -up map, authorized use of special beautification tools, special effects gameplay, etc.), the basic function mode will be automatically exited into the general mode.", "label": ["Important", "Edit/Control"], "rewrite": "Your individual consent of any value -added service will lead to automatic entering the general mode."}
{"task": "rw_93.jsonl", "id": 68429, "text": "If you do not log in to the account, we will ensure the basic functions of information push through the identifier information corresponding to the device.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you do not log in to the account, we will use the device identifier information guarantee information push function."}
{"task": "rw_93.jsonl", "id": 68430, "text": "If you log in to your account, we will push information based on your account information.", "label": ["Important", "Usage"], "rewrite": "If you log in to your account, we will push information according to account information."}
{"task": "rw_93.jsonl", "id": 68431, "text": "The camera (camera) and album (storage) permissions will not be opened by default. Only after your explicit authorization will be used when you implement specific functions or services, you can also withdraw authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "The camera (camera) and album (storage) permissions can only be used only by your explicit authorization and can be withdrawn."}
{"task": "rw_93.jsonl", "id": 68432, "text": "In particular, it is necessary to point out that even after your authorization, we have obtained these sensitive permissions, and we will not collect your information when related functions or services are not needed.", "label": ["Permission Acquisition", "Important"], "rewrite": "We have obtained the camera (camera), album (storage) permissions, and only collect your information only when related functions or services are required."}
{"task": "rw_93.jsonl", "id": 68433, "text": "Explanation and usage instructions for wake -up graphs", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68434, "text": "This privacy policy is suitable for your mobile Internet application, PC -end/web application, official website, third -party websites and applications for mobile Internet applications, \"Awakening\" through the name \"Awakening Picture\" and may include \"wake -up maps\" related to third -party websites.Software Development Tool Pack (SDK) and application programming interface (API) method to access and use \"wake -up\" products and related services.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68435, "text": "The following will help you understand how we collect, use, store, transfer (as applicable) and protect personal information;", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68436, "text": "Help you understand the way to check, copy, correct, delete, and withdraw authorization of personal information.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68437, "text": "This policy is closely related to your service relationship. We recommend that you read and understand all the contents of this policy, make a proper choice you think, and the important content of your personal information rights and interests.Essence", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68438, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68439, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68440, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68441, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68442, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68443, "text": "6. Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68444, "text": "7. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68445, "text": "8. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68446, "text": "9. Amendment and Notice of Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68447, "text": "10. Scope of application", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68448, "text": "11. Contact us", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68449, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68450, "text": "We will collect the information you actively provided when using the service, and collect the information you generated during the use of function or accepting service through automation:", "label": ["Important", "Edit/Control"], "rewrite": "We will collect the information you actively provide and automatically collect the information you generate in the process of using the function or service."}
{"task": "rw_93.jsonl", "id": 68451, "text": "1.1 Registration, login, certification", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68452, "text": "(1) You can use a third -party account (such as: Douyin account, Apple, ID) to authorize and use wake -up maps and related services. To this end, you will authorize us to obtain the public information registered on the third -party platform (avatar avatar portrait (avatar picture, Nickname), and other information you authorized, will be used to create a wake -up account account for you simultaneously, and bind the third -party account you who have authorized to with your awakening account to provide you with a wake -up map -related service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the open information of the third -party account you log in to the wake -up map and other authorized other information to create a wake -up account and bind it with the third -party account you who have authorized."}
{"task": "rw_93.jsonl", "id": 68453, "text": "You can also choose your information according to your own needs.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68454, "text": "In addition, when you authorize to log in to the wake -up map through the Douyin account, you can also actively agree and authorize the wake -up picture to get the song list you collected in Douyin so that you can be more convenient to make pictures/audio and video editing through the wake -up picture.The aforementioned singing single will be embedded in the audio. If you do not agree to synchronize the vibrato collection song list, we will respect your choices and will not obtain such information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you are authorized to log in to the wake -up picture through the Douyin account, collect the song list collected by the Douyin authorized by your authorized Douyin so that you can quickly use the tracks in the song list."}
{"task": "rw_93.jsonl", "id": 68455, "text": "(2) When logging in with a third -party account, you may need to write and read the information necessary to log in in the shear plate.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When logging in with a third -party account, you need to write or read the information necessary to log in in the shear plate."}
{"task": "rw_93.jsonl", "id": 68456, "text": "This information is for the purpose of achieving the relevant purpose of login and will not collect your privacy information.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68457, "text": "(3) We will still ask you to provide personal information that we need but third parties.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68458, "text": "If you refuse to provide it, it will cause you to be unable to use related services.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68459, "text": "(4) You agree and understand that when you use the function of identity authentication or related services (for exampleThe related third -party accounts used have completed real -name registration registration;", "label": ["Important", "Edit/Control"], "rewrite": "When using the function or related service that requires identity authentication, the third -party account that uses the real -name system should be completed."}
{"task": "rw_93.jsonl", "id": 68460, "text": "Or you may need to provide your real identity information to complete the real -name authentication before you can use the relevant functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68461, "text": "You can refuse to provide it. If you choose to refuse, you may not be able to obtain related services, but it does not affect other functions and services of your normally using the wake -up map.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to authenticate the real -name identity, you will not be able to obtain related services."}
{"task": "rw_93.jsonl", "id": 68462, "text": "(5) When you register, log in to wake up and related services, you can create an account through your mobile phone number and improve the relevant network identification information (account nickname). The collection of this information is to help you complete the registration.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register, log in to wake up and related services, you can create an account with your mobile phone number and improve the network identity information."}
{"task": "rw_93.jsonl", "id": 68463, "text": "Mobile phone numbers are necessary information to fulfill the requirements of national laws and regulations on the requirements of the online real -name system. If you do not provide mobile phone numbers for registration and login, we may not be able to provide you with functions such as information release and comments.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you do not provide mobile phone numbers for registration and login, you may not be able to provide you with functions such as information release and comments."}
{"task": "rw_93.jsonl", "id": 68464, "text": "You can fill in your personal information (personal profile) after you register and log in to your account. We will collect your active personal data to display it to other users.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your proactive personal data to display to other users."}
{"task": "rw_93.jsonl", "id": 68465, "text": "(6) Based on our cooperation with communication operators, when you use the \"one -click login\" function of the wake -up map, after your consent, we will handle your mobile phone number with the operator to provide you with a fast login service.Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"one -click login\" function of the wake -up picture, we will process the mobile phone number authorized by the operator."}
{"task": "rw_93.jsonl", "id": 68466, "text": "If the above processing is refused, you will not be able to register and log in to the wake -up map in the \"one -click login\" method, but it does not affect your registration in other ways, nor does it affect the normal use of other functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide your mobile phone number, you cannot register and log in with the \"one -click login\" method, but it does not affect the normal use of other functions."}
{"task": "rw_93.jsonl", "id": 68467, "text": "1.2 Safe in the normally and run safely", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68468, "text": "1.2.1 Operation and Security", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68469, "text": "We are committed to providing you with a safe, credible product and use environment, and providing high -quality and reliable services and information is our core goal.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68470, "text": "Please understand that in order to maintain the normal operation of our services and protect the legitimate interests of you or other users or the public from losses, we will collect the necessary information for the safe and stable operation of products or services.", "label": ["Data Security", "First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68471, "text": "In addition, wake -up maps will not collect any other personal sensitive information in your background running in the background.", "label": ["Important", "First Party Collection Information"], "rewrite": "In the silent state and/or in the background running process, no other personal sensitive information of you will be collected."}
{"task": "rw_93.jsonl", "id": 68472, "text": "1.2.2 Equipment information and log information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68473, "text": "(1) When you use wake -up maps and related services, in order to ensure the quality and efficiency of software and services, we will collect your hardware models, operating system versions, and equipment logo (Androidid, OAID, OAID, OAID, GAID, hardware serial number, iOS such as IDFV, IDFA), WLAN access points (SSID, BSSID), Bluetooth, base station, network device hardware address (MAC), IP address, software version number, network access modeAnd type, status, network quality data, operation, use, service log information and sensor information.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect your hardware model, operating system version number, equipment identifier, network basic information, service log information, and sensor information to ensure the safe operation of software and services."}
{"task": "rw_93.jsonl", "id": 68474, "text": "(2) In order to help us better understand the operation of wake -up maps and related services. At the same time, in order to prevent malicious procedures and ensure the quality and efficiency of operating operations, we will record the network log, collect the application information or the process information and application that is being running.The overall operation, usage and frequency of use, frequency, application crash, overall installation usage, performance data, and source of application.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Record network logs, collect and install application information or process information, the overall operation of the application, and use information to understand the operation of the product or service, prevent malicious procedures, and ensure the quality and efficiency of operation."}
{"task": "rw_93.jsonl", "id": 68475, "text": "(3) We may use your account information, equipment information, service log information, as well as the information that our affiliates and partners are obtained or provided by your authorization or provided by law to judge the security of accounts and transactions, conduct authentication, identify violations of laws and regulations illegal regulationsSituation, testing and preventing safety incidents, and adopting necessary records, analysis, and disposal measures in accordance with the law.", "label": ["Important", "Data Security", "Usage"], "rewrite": "Use your account information, equipment information, service log information, and other information you authorized to judge accounts and transaction security, conduct authentication, identify illegal violations, test and prevent security incidents."}
{"task": "rw_93.jsonl", "id": 68476, "text": "1.3 Photo/audio and video beautification, editing and other general functions", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68477, "text": "Wake pictures provide you with photos/video editing, beautification, filter, pictures, etc., and support media file download/save to local/sharing and other general functions and services.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68478, "text": "In order to achieve these functions and services, we need to obtain the camera (camera) and album permissions (storage). These permissions are sensitive permissions. We will only obtain such permissions after you authorize.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your authorized camera (camera) and album permissions (storage) to achieve general functions such as photos/audio and video beautification and editing."}
{"task": "rw_93.jsonl", "id": 68479, "text": "If you refuse to authorize certain necessary permissions, you will not be able to use the corresponding function, but it does not affect your normal use of other services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68480, "text": "1.4 Provide unique features such as personalized beautification tools, map repair templates and other features", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68481, "text": "Provide a personalized picture, video aesthetic tools (filters, beauty, beauty, etc.), map fixing templates, etc. are the core functions and services of awakening pictures.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68482, "text": "To achieve these functions and services, we may collect and use the following information:", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use your face to achieve special features such as landscaping tools, map repair templates."}
{"task": "rw_93.jsonl", "id": 68483, "text": "(1) Face recognition information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68484, "text": "a. When you choose to use some beautification tools and feedback templates that need to be adjusted or feedback based on facial recognition information, in order to provide a better functional experience and display effect, we need to identify and handle your facial features on the local client.The information is used for rendering effects. We will not transmit this information to the server, will not store any form of storage, and will not use this information to any other purposes other than this.Three parties;", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you choose to use beautification tools and trimming templates, we need to identify and process your facial feature information on the local client, but will not return this information to the server or store or use it as other purposes, let alone provide it."}
{"task": "rw_93.jsonl", "id": 68485, "text": "b. When you choose to use some creative functions, special effects gameplay (including but not limited to \"portrait intelligent matting\", \"map intelligent matting\", \"intelligent cutout template\", \"intelligent recommendation template\", etc.)In order to achieve image processing and facial effect optimization faster and accurately, we need to temporarily upload media information such as pictures and videos that you choose to process to optimize the effect.", "label": ["Data Retention", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you choose to use certain creative functions and special effects gameplay, we need to upload the media data you choose to be imported temporarily to the server for the effect optimization processing."}
{"task": "rw_93.jsonl", "id": 68486, "text": "The media information you uploaded will only be used to optimize images, video processing and/or effect optimization through specific creative functions and special effects.Forms of storage will not be provided to third parties.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "We will not store any form of media information or use it for other purposes, let alone provide it."}
{"task": "rw_93.jsonl", "id": 68487, "text": "After completing the relevant function processing and returning the effect content to you, we will immediately delete the relevant pictures, videos and other media information and all information involved from the server.", "label": ["Data Retention", "Important"], "rewrite": "We will delete all information after completing the relevant function processing of the media data you uploaded and return the effect content."}
{"task": "rw_93.jsonl", "id": 68488, "text": "We will authorize the special features that need to upload media information to the server for the effect optimization processing. If you refuse to authorize, it will only make you unable to use specific functions, but it does not affect other services that use your normally use.", "label": ["Permission Acquisition", "Important"], "rewrite": "For the special features of uploading media data to the server for the effect optimization processing, we will make a separate authorization prompt."}
{"task": "rw_93.jsonl", "id": 68489, "text": "(2) Other content feature information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68490, "text": "a. When you use the pictures/video editing, beautification, and template -related functions of wake -up pictures, in order to achieve better editing functions, beautification tools, template adaptation and map repair effects, we will choose to you on the local client to select you through the algorithm to you.The rough content feature information in the picture (such as: food, landscape, crowd, etc., but does not include any information that can be identified) for feature analysis and processing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use pictures/video editing, beautification, template -related functions, analyze and process the rough content feature information in the picture in the picture through the algorithm."}
{"task": "rw_93.jsonl", "id": 68491, "text": "b. When you use \"Recommended Music\" related functions, in order to achieve better music matching, we need to extract the necessary frame numbers from the video files to be processed to upload to the server for the content characteristics to return to you to return to you.Music content.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use the \"Recommended Music\" related functions, we need to draw the number of necessary frame numbers from the video file for the content characteristics analysis to return the music content that is adapted."}
{"task": "rw_93.jsonl", "id": 68492, "text": "We will not use it for any other purposes other than that, nor do it store any form of storage, let alone provide it to third parties.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "We will not use the videos you uploaded as other purposes or storage, let alone provide it."}
{"task": "rw_93.jsonl", "id": 68493, "text": "After completing the relevant function processing and returning to the music content from you, we will immediately delete the relevant media information and all information involved from the server.", "label": ["Data Retention", "Important"], "rewrite": "In completing the \"Recommended Music\" related services, we will delete all the information involved from the server."}
{"task": "rw_93.jsonl", "id": 68494, "text": "We will authorize the special features that need to upload media information to the server for the effect optimization processing. If you refuse to authorize, it will only make you unable to use specific functions, but it does not affect other services that use your normally use.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will have a separate authorization prompt to upload media information to the server for the effect optimization processing."}
{"task": "rw_93.jsonl", "id": 68495, "text": "Please understand that when we collect and process the above information, we have de -identified processing/anonymous processing. The data analysis only corresponds to the identification of specific and cannot directly associate the user's personal identity.", "label": ["Important", "Data Security", "Usage"], "rewrite": "When we collect and process video information, we have de -identified processing/anonymous processing."}
{"task": "rw_93.jsonl", "id": 68496, "text": "1.5 Information release and interactive communication", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68497, "text": "(1) You can contact us according to the operating rules of the wake -up map to become the creator of the wake -up map. We will give a basic review of your user identity and creative ability. After the review is approved, we will open the corresponding creator permissions for you.After becoming the creator of the wake -up map, you can publish your creative design works (for example, photo template).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you apply to become a wake -up creator, we will basicly review your user identity and creative ability."}
{"task": "rw_93.jsonl", "id": 68498, "text": "(2) When applying for the authorization of the above -mentioned wake -up creators and/or using the creator identity authentication service, according to laws and regulations, security guarantee requirements, you need to provide real identity information (real name, ID number, phone number, etc.) Complete online or offline real -name certification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When opening the author's authority or using the creator identity authentication service, collect your real identity information so that you can complete the real -name authentication."}
{"task": "rw_93.jsonl", "id": 68499, "text": "(3) When you publish creative design works (including but not limited to photo templates, etc.) on the wake -up map, we will collect information you published/comment, and show your nickname, avatar, publishing content, publishing content to get the contents of the publishing, get the contents of the publishing, get the contents of the publishing, get the contents of the publishing, and get the content of the publishing.Favorites/like/like, comment.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "When publishing creative design works or reviewing, we will collect information you posted/comment and show your nicknames, avatars and other information."}
{"task": "rw_93.jsonl", "id": 68500, "text": "(4) When you pay attention to your account, browse, comment, follow, collect/like/like/like or share, we will collect your account and the aforementioned information, and display the content of the account publishing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you pay attention to your account, browse, comment, follow, collect/like/like/like or share, collect your account and the aforementioned information, and display the content of the account publishing."}
{"task": "rw_93.jsonl", "id": 68501, "text": "(5) The information that users are collected by our products or services, such as the information posted by other users may contain some of your information (such as: in the creative design works that collect/like/like/likeRelated information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Users are collected by us for using our products or services."}
{"task": "rw_93.jsonl", "id": 68502, "text": "1.6 Information Browse", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68503, "text": "In order to ensure the quality of the template content recommended by the awakening map, and recommend the template you may be interested in, the awakening map may collect related necessary information.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68504, "text": "The above information includes:", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68505, "text": "The behavior information you operate and use: click, use, share, save to the local area", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68506, "text": "The information you actively provided: like (like), cancel the like (cancel love)", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68507, "text": "Manage personalized content recommendation", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68508, "text": "1.7 Share and event participation", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68509, "text": "In the case of your sharing or receiving information, participating in activities, we may need to access your shear board and read the passwords, sharing code, and links contained in it to achieve functions or functions such as jumping, sharing, activity linkage or linkage.Serve.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Visit your shear plates and read the content of it to achieve functions or services such as jumping, sharing, and activity linkage."}
{"task": "rw_93.jsonl", "id": 68510, "text": "In order to analyze statistical indicators such as new, activation, retention, and performance, we may call the shear plates to analyze the relevant statistical information. Please rest assured that we will not collect your privacy information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may call the cutting plate to analyze relevant statistical information, but we will not collect privacy information."}
{"task": "rw_93.jsonl", "id": 68511, "text": "When you choose to participate in the activities we organized, you can provide information such as name, communication address, contact information, bank account and other information according to the event needs.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you participate in the event, collect information such as your name, communication address, contact information, bank account and other information as needed."}
{"task": "rw_93.jsonl", "id": 68512, "text": "This information is personal sensitive information, which is necessary for you to receive transfer or gift. If you refuse to provide this information, we may not be able to transfer or distribute gifts to you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use information such as name, communication address, contact information, bank account and other information to you or send gifts to you."}
{"task": "rw_93.jsonl", "id": 68513, "text": "1.8 News notice", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68514, "text": "You know and agree that for your contact information (for example: contact telephone number) provided by you in the process of using the product and/or service, we may send one or more of them in the operation.User news notification, authentication, security verification, user experience research research and other purposes;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We may send multiple types of notifications to the contact information you provided by you, for information notification, authentication, security verification, user experience research research and other uses."}
{"task": "rw_93.jsonl", "id": 68515, "text": "In addition, we may also provide you with commercial information such as services, functions or activities that you may be interested in by text messages and telephones, but please rest assured that if you do not want to accept this information, you can via your mobile phone.The withdrawal method provided in the SMS can also be contacted directly with us.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "We may also provide you with personalized recommendations in a SMS and telephone, and you can make a copy."}
{"task": "rw_93.jsonl", "id": 68516, "text": "1.9 Other use information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68517, "text": "The use information mainly includes: click, follow, collect, search, query, browse, download, share, comment, like (like) and other information generated by users when using wake -up pictures.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68518, "text": "1.10 collection and use of personal information purpose changes", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68519, "text": "Please understand that with the development of our business, it may be adjusted and changed to the functions of the wake -up map and the services provided.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68520, "text": "In principle, when the new features or services are related to the functions or services we are currently provided, the personal information collected and used will be directly or reasonable to the original processing purpose.", "label": ["Important", "Usage"], "rewrite": "When new functions or services are related to the current function or service, the personal information collected and used in principle will be directly or reasonable to the original processing purpose."}
{"task": "rw_93.jsonl", "id": 68521, "text": "In the scenario that is not directly or reasonable with the original treatment purpose, we collect and use your personal information will be inform again and obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "We exceed and use your personal information over the purpose of the original treatment, and we will inform again and obtain your consent."}
{"task": "rw_93.jsonl", "id": 68522, "text": "1.11 Personal information to obtain consent collection and use in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68523, "text": "Please understand that in the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the following situations, according to laws and regulations and related national standards, we collect and use your personal information without obtain your authorization consent:"}
{"task": "rw_93.jsonl", "id": 68524, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_93.jsonl", "id": 68525, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to public safety, public health, and major public interests does not need to solicit authorization consent."}
{"task": "rw_93.jsonl", "id": 68526, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial and judgment execution does not need to solicit authorization consent."}
{"task": "rw_93.jsonl", "id": 68527, "text": "(4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Out of major legitimate legitimate rights and interests of the life and property of personal information subjects or other individuals, it is difficult to obtain the collection and use information that I agree, and there is no need to solicit authorization consent."}
{"task": "rw_93.jsonl", "id": 68528, "text": "(5) The collected your personal information is made to the public by yourself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collected your personal information is publicly disclosed to the public by yourself, and you don't need to solicit authorization consent."}
{"task": "rw_93.jsonl", "id": 68529, "text": "(6) The personal information collected from the legal public disclosure information, such as legal news reports and government information disclosure;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Your personal information collected from the legal disclosure information does not need to obtain authorization consent."}
{"task": "rw_93.jsonl", "id": 68530, "text": "(7) Sign or perform the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information necessary for signing or fulfilling the contract according to your request does not need to solicit authorization consent."}
{"task": "rw_93.jsonl", "id": 68531, "text": "(8) The necessary and stable operations for maintaining software and related services, such as the failure of discovering and disposing of software and related services;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information necessary to maintain the safe and stable operation of software and related services does not require authorization consent."}
{"task": "rw_93.jsonl", "id": 68532, "text": "(9) It is necessary for legal news reports;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The necessary collection and use information for legal news reports does not need to solicit authorization consent."}
{"task": "rw_93.jsonl", "id": 68533, "text": "(10) Academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide the results of academic research or descriptions, to identify the personal information contained in the result;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When academic research institutions are necessary to carry out statistics or academic research based on public interests, and provide academic research or description results, they can identify the personal information contained in the results without requiring the consent of authorization."}
{"task": "rw_93.jsonl", "id": 68534, "text": "(11) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_93.jsonl", "id": 68535, "text": "Special reminder you pay attention, if the information cannot be identified alone or in combination with other information, it is not your personal information in the legal sense;", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68536, "text": "When your information can identify your personal identity alone or in combination with other information, or we will not be able to connect with any specific personal information with other personal information combined with other personal information, this information will be used as you during combination.Personal information is handled and protected in accordance with this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68537, "text": "2. How do we use cookie equivalent technologies", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68538, "text": "Similar technologies such as Cookie and Equipment Information Makes are commonly used in the Internet.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68539, "text": "When you use a wake -up and related services, we may use related technologies to send one or more cookies to your device, or anonymous identifiers to collect and identify the information when you access and use this product.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information through cookies or anonymous identifiers, identify the information when you access and use the product."}
{"task": "rw_93.jsonl", "id": 68540, "text": "We promise that cookies will not be used for any other purposes other than the purpose of this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68541, "text": "We use cookies and similar technologies to achieve the following functions or services:", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68542, "text": "2.1 Guarantee of the safety and efficient operation of products and services", "label": ["Usage"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68543, "text": "We may set up Cookie, or an anonymous identifier that guarantees security, so that we can confirm whether you log in to the service safely, or whether you encounter stolen, fraud and other illegal acts.", "label": ["Important", "Usage"], "rewrite": "To confirm whether you log in safely through cookie or anonymous identifiers, or whether you encounter stolen, fraud and other illegal acts."}
{"task": "rw_93.jsonl", "id": 68544, "text": "These technologies also help us improve service efficiency, improve login and response speed.", "label": ["Important", "Usage"], "rewrite": "Cookie or anonymous identifiers can help improve service efficiency, improve login and response speed."}
{"task": "rw_93.jsonl", "id": 68545, "text": "2.2 Help you get a easier access experience", "label": ["Usage"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68546, "text": "Using this kind of technology can also help you save you to fill in your personal information, repeat the individual picture/audio and video aesthetic tools, photo template functions (such as: record filter settings, etc.), steps to enter search contentAnd process (example: record search, etc.) to help you get a easier access experience.", "label": ["Important", "Usage"], "rewrite": "By using cookie or anonymous identifiers, you can help you repeat the information, the steps and processes of repeated selection functions."}
{"task": "rw_93.jsonl", "id": 68547, "text": "2.3 COOKIE Clear", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68548, "text": "Most browsers provide users with the function of removing browser cache data. You can perform the corresponding data clearance operation in the browser settings function.", "label": ["Important", "Edit/Control"], "rewrite": "The data clearance operation can be cleared by clearing the function of the browser cache data in the browser settings function."}
{"task": "rw_93.jsonl", "id": 68549, "text": "If you clear, you may not be able to use the services or corresponding functions that we depend on Cookie.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68550, "text": "3. How do we share, transfer, and publicly disclose personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68551, "text": "3.1 Sharing", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68552, "text": "3.1.1 Sharing Principles", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68553, "text": "(1) The principle of authorization consent:, without your consent, we will not share your personal information. Unless the personal information shared is to identify the information after the processing, and the third party cannot re -identify the natural person.Essence", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We share your personal information will obtain your authorization consent in advance, except for the natural person subjects who cannot re -identify the identification information of the third parties."}
{"task": "rw_93.jsonl", "id": 68554, "text": "If the purpose of third -party information uses information beyond the scope of the original authorization consent, they need to re -obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68555, "text": "(2) Principles of legitimate legitimacy and minimum must:, shared data must have a legal and legitimate purpose, and the shared data is limited to the purpose of achieving the goal.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Sharing data has a legitimate and legitimate purpose and is limited to the purpose."}
{"task": "rw_93.jsonl", "id": 68556, "text": "(3) Principles of security and prudential: We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate the security guarantee capabilities of these partners, and require them to follow the legal agreement of cooperation.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will carefully evaluate the purpose of third -party use of shared information, comprehensively evaluate their security and guarantee capabilities, and require the cooperation legal agreement."}
{"task": "rw_93.jsonl", "id": 68557, "text": "We will strictly monitor the software tool development package (SDK) and application interface (API) that the partners obtain information to protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Safety monitoring the SDK and APIs of the partner to protect data security."}
{"task": "rw_93.jsonl", "id": 68558, "text": "Third -party information sharing list", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68559, "text": "3.1.2 The scope of the partner", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68560, "text": "If the specific functions and scenarios are provided by our affiliates and third parties, the scope of the partner includes our affiliates and third parties.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68561, "text": "3.1.3 commission processing", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68562, "text": "For the scene of commissioning to handle personal information, we will sign the relevant processing agreement with the trustee and cooperation in accordance with the law and supervise the personal information usage activities.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a related processing agreement with the partner of personal information and supervise their personal information use activities."}
{"task": "rw_93.jsonl", "id": 68563, "text": "3.1.4 Common processing", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68564, "text": "For the scenario of jointly handling personal information, we will sign relevant agreements with the partners in accordance with the law and agreed that their rights and obligations to ensure that in the process of using relevant personal information and protect the security of data and protect data security.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign an agreement with the partners who handle personal information to stipulate their respective rights and obligations to protect data security."}
{"task": "rw_93.jsonl", "id": 68565, "text": "3.1.5 Sharing information of function or service", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68566, "text": "(1) When you use the functions provided by our partners in the wake -up map, or when software service providers, smart equipment providers, system service providers and us provide you with services with usThe information necessary for business purposes to show you the information you may be interested in, or push the specific function, service or information that is more suitable for you.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you use the functions provided by the partner in the wake -up map, or the functions provided by the partner with us, we may share the information necessary for the cooperation party to achieve business purposes."}
{"task": "rw_93.jsonl", "id": 68567, "text": "(2) In order to adapt the message push function with the terminal model you use, we may share mobile phone models, versions and related equipment information through SDK and other technologies and terminal equipment manufacturers (Huawei, Xiaomi, OPPO, vivo, etc.).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share mobile phone models, versions and related device information for you through SDK and other technologies and terminal equipment manufacturers."}
{"task": "rw_93.jsonl", "id": 68568, "text": "3.1.6 Data use of safety and analysis statistics", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68569, "text": "(1) Safe security: We attach great importance to accounts, services and content security. In order to ensure the security of your and other users' accounts and property security, so that you and our legitimate rights and interests are exempted from illegal infringement.Equipment, account and log information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Parties may use the necessary devices, accounts and log information to ensure the safety of the product."}
{"task": "rw_93.jsonl", "id": 68570, "text": "(2) Analysis of product conditions: In order to analyze the use and performance of our products, our partners may need to use the product's usage (collapse, flashback), equipment identification information, and overall installation of usage.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Partners may need to use information such as the use of the product, the equipment identification information, and the overall installation of the application to analyze the product situation."}
{"task": "rw_93.jsonl", "id": 68571, "text": "(3) In order to improve the scientific research capabilities in related fields and promote the level of scientific and technological development, we may use de -identifiable or anonymous data with cooperative scientific research institutes, universities and other institutions under the premise of ensuring that data security and purpose are legitimate.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may share data that cannot be recognized by research institutions, research institutes, universities and other institutions, and ensure that the purpose of use is legitimate and data security."}
{"task": "rw_93.jsonl", "id": 68572, "text": "3.1.7 Help you participate in marketing promotion activities", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68573, "text": "When you choose to participate in the relevant marketing activities organized by us and our partners, in order to ensure that you can get the same experience in the joint event, or entrust the partner to honor you in time, we and our partners may need to use you to use youThe name, communication address, contact information, bank account, etc. (the information used in different activities may have differences, and the specific rules of the activity shall prevail).", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We may use information such as your name, communication address, contact information, bank account, etc. to help you participate in marketing activities or reward rewards."}
{"task": "rw_93.jsonl", "id": 68574, "text": "Rejection of the above use may affect your participation in related activities, but it will not affect other functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68575, "text": "3.2 Transfer", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68576, "text": "With the continuous development of our business, we will be likely to carry out mergers, acquisitions, and asset transfer, and your personal information may be transferred as a result.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be transferred due to merging, acquisition, and asset transfer."}
{"task": "rw_93.jsonl", "id": 68577, "text": "When the previous described changes occur, we will follow the laws and regulations and the security standards that are not lower than the security standards stated by the privacy policy.We will ask the Fang Fang to re -obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When personal information is transferred with merging, acquisition, or asset transfer, the party will be required to continue to perform the obligation of personal information processors. If the processing purpose and processing method will be required, it will request them to reconcile your authorization consent."}
{"task": "rw_93.jsonl", "id": 68578, "text": "3.3 Public display", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68579, "text": "(1) We will not disclose your information publicly unless it follows national laws and regulations or obtains your consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We only disclose your information only after obtaining your consent, except for other provisions of laws and regulations."}
{"task": "rw_93.jsonl", "id": 68580, "text": "We publicly disclose your personal information to adopt security measures that meet the standards of the industry.", "label": ["Third Party Sharing/ Disclosure", "Data Security"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68581, "text": "(2) When a penalty announcement of illegal accounts and fraud, we may disclose information about the relevant account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may disclose information about illegal accounts and fraudulent accounts in the penalty announcement."}
{"task": "rw_93.jsonl", "id": 68582, "text": "(3) The works you published publicly (including usage, total usage, praise/obtained/collected quantity, comments that are collected), the number of fans, likes (like), the user will pay attention toShow on the homepage.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The number of works you publish, the number of fans, and the favorite works will be displayed on the personal homepage."}
{"task": "rw_93.jsonl", "id": 68583, "text": "3.4 Personal information that obtains consent to sharing, transfer, and publicly disclosed in accordance with the law", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68584, "text": "Please understand that in the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtain your authorization consent:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following situations, according to laws and regulations and national standards, we shared, transferred, and publicly disclosed your personal information without obtain your authorization consent:"}
{"task": "rw_93.jsonl", "id": 68585, "text": "(1) For the contract for the contract to establish and fulfill your contract as a party, or implement human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law in accordance with the law;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to establish and fulfill your contract as a party as a party, or to implement the sharing or disclosure necessary for human resource management in accordance with the labor rules and regulations and collective contracts signed in accordance with the law and the collective contracts signed in accordance with the law, no authorization is required."}
{"task": "rw_93.jsonl", "id": 68586, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to fulfill the statutory duties or the shared or disclosure necessary for the legal obligation, no authorization is required."}
{"task": "rw_93.jsonl", "id": 68587, "text": "(3) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_93.jsonl", "id": 68588, "text": "(4) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be solicited."}
{"task": "rw_93.jsonl", "id": 68589, "text": "(5) In order to deal with emergencies, or in emergency situations, it is necessary to protect the health and property safety of natural people;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to cope with emergencies, or to protect the lives and health of natural persons in the case of emergencies, it is necessary to sharing or disclosure necessary for the safety of natural persons, and no authorization is required."}
{"task": "rw_93.jsonl", "id": 68590, "text": "(6) Implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable scope;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In order to implement news reports and supervision of public opinion, deal with personal information within a reasonable scope without authorization."}
{"task": "rw_93.jsonl", "id": 68591, "text": "(7) Process your own personal information in accordance with relevant laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It is not necessary to solicit authorization in accordance with relevant laws and regulations on your own or other legitimate personal information."}
{"task": "rw_93.jsonl", "id": 68592, "text": "(8) Collect personal information from the information disclosed legal and publicly disclosed;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_93.jsonl", "id": 68593, "text": "(9) Other circumstances stipulated in laws and administrative regulations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure of other laws and regulations and other regulations does not need to be authorized."}
{"task": "rw_93.jsonl", "id": 68594, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68595, "text": "4.1 Storage location", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68596, "text": "In accordance with the provisions of laws and regulations, we will store your personal information collected and generated during the domestic operation process in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_93.jsonl", "id": 68597, "text": "At present, we will not transmit the above information overseas. If we transmit to overseas, we will follow relevant state regulations or solicit your consent.", "label": ["Data Retention", "Important"], "rewrite": "If you transmit personal information to overseas, we will follow relevant state regulations or seek your consent."}
{"task": "rw_93.jsonl", "id": 68598, "text": "4.2 Storage period", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68599, "text": "4.2.1, we only retain your personal information during the period for providing the purpose of providing wake -up maps and related services: the information, like (like/collection) and related information you publishWe will retain relevant information during the period of not canceling the account.", "label": ["Data Retention", "Important"], "rewrite": "You generally retain your personal information within the time limit for service purposes."}
{"task": "rw_93.jsonl", "id": 68600, "text": "After exceeding the necessary period, we will delete or processes your personal information, except for other regulations.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_93.jsonl", "id": 68601, "text": "4.2.2, if you cancel your account, take the initiative to delete your personal information, or go beyond the necessary period, we will delete or processes your personal information, except for the following situations:", "label": ["Data Retention", "Important"], "rewrite": "If you cancel your account, take the initiative to delete personal information, or go beyond the necessary period, we will delete or processes personal information."}
{"task": "rw_93.jsonl", "id": 68602, "text": "(1) Comply with the requirements for information retention of laws and regulations (for example: the \"E -commerce Law\" stipulates that the time for the saving time of goods and service information and transaction information is not less than three years from the date of completion of the transaction).", "label": ["Data Retention", "Important"], "rewrite": "Out of compliance with laws and regulations on information retaining, it will not immediately delete or processes personal information."}
{"task": "rw_93.jsonl", "id": 68603, "text": "(2) For the purpose of finance, auditing, and dispute resolution, the period needs to be reasonably extended.", "label": ["Data Retention", "Important"], "rewrite": "If the purpose of finance, auditing, and dispute resolution requires a reasonable extension of the period, it will not immediately delete or processes personal information."}
{"task": "rw_93.jsonl", "id": 68604, "text": "5. How can we protect the security of personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68605, "text": "(1) We attach great importance to your personal information security, and we will strive to take reasonable security measures (including technical and management) to protect your personal information and prevent your personal information from being used in improperly or in unauthorized situations.It was interviewed, publicly disclosed, used, modified, damaged, lost or leaked.", "label": ["Important", "Data Security"], "rewrite": "We will take technical and management security measures to prevent your personal information from being improperly used or unauthorized access, publicly disclosed, used, modified, etc."}
{"task": "rw_93.jsonl", "id": 68606, "text": "(2) We will use the encryption technology, anonymous treatment, and related reasonable and feasible methods that are not lower than industry peers to protect your personal information, and use a security protection mechanism to prevent your personal information from being maliciously attacked.", "label": ["Important", "Data Security"], "rewrite": "We will use encrypted technology, anonymous processing and other means to protect your personal information and prevent your personal information from being maliciously attacked."}
{"task": "rw_93.jsonl", "id": 68607, "text": "(3) We will establish a special security department, security management system, and data security process to ensure your personal information security.", "label": ["Important", "Data Security"], "rewrite": "We will establish security departments, systems, and processes to ensure your personal information security."}
{"task": "rw_93.jsonl", "id": 68608, "text": "We adopt strict data use and access systems to ensure that only authorized personnel can access your personal information and conduct security audits of data and technology in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "We adopt the data usage and access system to ensure that your personal information is authorized and conducts security audit on data and technology."}
{"task": "rw_93.jsonl", "id": 68609, "text": "(4) Although the above -mentioned reasonable and effective measures have been taken and the standards required by relevant legal regulations have been adopted, please understand that due to the technical restrictions and various malicious means that there may beSecurity measures cannot always ensure that the information is 100 % security. We will try our best to ensure the security of our personal information.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_93.jsonl", "id": 68610, "text": "(5) You know and understand that the system and communication network you used to access our services may have problems due to factors outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_93.jsonl", "id": 68611, "text": "Therefore, we strongly recommend that you take positive measures to protect the security of personal information, including but not limited to the use of complex passwords, regularly modify the password, do not disclose your account password and related personal information to others.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you take positive measures to protect the security of personal information, including the use of complex passwords, regularly modify passwords, account passwords confidential."}
{"task": "rw_93.jsonl", "id": 68612, "text": "(6) We will develop an emergency treatment plan and immediately start the emergency plan when the user information security incident occurs, and strive to prevent the impact and consequences of these security events expand.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with information security incidents."}
{"task": "rw_93.jsonl", "id": 68613, "text": "Once the user information security incident (leaked and lost) occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have taken or we will takeAnd reducing risk suggestions, remedy measures for you.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_93.jsonl", "id": 68614, "text": "We will promptly inform you of the incident -related situation with push notifications, emails, letters, text messages, and related forms. When it is difficult to inform them one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_93.jsonl", "id": 68615, "text": "At the same time, we will also report to the disposal of user information security incidents in accordance with the requirements of the relevant regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_93.jsonl", "id": 68616, "text": "(7) Once you leave the wake -up map and related services, browse or use other websites, services and content resources, we will not be able to protect your personal information submitted by software and website in other services outside the awakening map and related services.Whether you log in to, browse or use the above software, or whether the website is based on the link or guidance of the wake -up map.", "label": ["Important", "Data Security", "Risk"], "rewrite": "Regardless of whether you log in, browse or use the software, whether the website is based on the link or guidance of the wake -up map, we are unable to protect your personal information submitted in addition to the wake -up and related services."}
{"task": "rw_93.jsonl", "id": 68617, "text": "6. Personalized recommendation", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68618, "text": "In order to show you more information to you and recommend correlation, provide a service that meets your needs more. The wake -up map will collect and use your personal information to automatically calculate and predict your preferences through the computer algorithm model to match what you may be interested in.Information or other service content, the following we will explain to you in detail the operating mechanism of the personalized product service and the way you implement control.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your personal information to automatically calculate and predict your preferences to provide personalized recommendations through computer algorithm models."}
{"task": "rw_93.jsonl", "id": 68619, "text": "6.1 Personalized recommendation mechanism", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68620, "text": "(1) The scope of our personalized recommendation service is [display template content].", "label": ["Important", "Usage"], "rewrite": "The scope of providing personalized recommendation services is [display template content]."}
{"task": "rw_93.jsonl", "id": 68621, "text": "(2) In order to predict your preferences, we may collect and use your equipment information and behavior information when using the product. Behavioral information includes your click, use, sharing, stored, stored to local, collection when you visit/use the product.(Like), cancel collection (cancel your favorite) behavioral information and operation related records.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your device information and the behavior information when using the product to predict your preference."}
{"task": "rw_93.jsonl", "id": 68622, "text": "(3) We can automatically analyze the above information through the computer algorithm, extract your user characteristics after calculating, and then predict the content of the content of the content in the information candidate with other relevant characteristics, and select the content based on the results of the prediction.And sorting.", "label": ["Important", "Usage"], "rewrite": "The equipment information and behavior information are automatically analyzed through the computer algorithm, the user characteristics are extracted after calculation, and the prediction of other information is predicted in conjunction with other information, and the content is screened and sorted according to the prediction results."}
{"task": "rw_93.jsonl", "id": 68623, "text": "After the processing of heavy, dispersing, etc., the final content recommendation list is displayed to you in turn.", "label": ["Usage"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68624, "text": "(4) We will provide real -time feedback on the recommendation model based on your browsing behavior in the process of using the product, and constantly adjust the optimization results to better provide you with high -quality content.", "label": ["Important", "Usage"], "rewrite": "Based on the browsing behavior during the use of the product, real -time feedback on the recommendation model is optimized."}
{"task": "rw_93.jsonl", "id": 68625, "text": "6.2 Personalized recommendation control and management", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68626, "text": "Receive information autonomous controllable", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68627, "text": "We will use the recommendation algorithm to personalize and display the information content you browse. You can control the personalized recommendation of information content in the following way:", "label": ["Important", "Edit/Control"], "rewrite": "You can control the personalized recommendation of information content in the following way:"}
{"task": "rw_93.jsonl", "id": 68628, "text": "6.2.1 Autonomous decision to receive personalized recommendation content:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68629, "text": "(1) You can use the \"1.,-, 1.6\" of the \"1., 1.6\" in this privacy policy.The path of the personalized content recommendation function is turned on or closed.", "label": ["Important", "Edit/Control"], "rewrite": "Open or close of personalized content recommendation functions:  \"Management Personalized Content Recommendation] through the\" 1. -1.6 \"clause;path of."}
{"task": "rw_93.jsonl", "id": 68630, "text": "You can choose to close all personalized content recommendations for one click. When you choose to close all personalized content recommendation, you will no longer show you \"recommendation\" content. You cannot enjoy personalized recommendation services, but you can continue to browse attention, hotspotsWait for non -personalized recommendation content.", "label": ["Edit/Control", "Important"], "rewrite": "After all the one -click recommendation of personalized content recommendation, \"recommendation\" content will no longer be displayed."}
{"task": "rw_93.jsonl", "id": 68631, "text": "(2) You can also choose to partially close personalized recommendations. You can close personalized recommendations based on search results or pay attention. After partial closure of personalized recommendation functions, we will not use the corresponding information to make personalized recommendations to you.", "label": ["Important", "Edit/Control"], "rewrite": "After closing the search results or personalized recommendations based on attention, you will not use the corresponding information to make personalized recommendations to you."}
{"task": "rw_93.jsonl", "id": 68632, "text": "(3) When you are not interested in specific information or hope to reduce some types of information, you can make your opinions and suggestions through the wake-up map mobile client [setting]-[feedback] pathAdjust strategy.", "label": ["Important", "Edit/Control"], "rewrite": "When you are not interested in specific information or want to reduce a certain type of information, you can make opinions and suggestions through [Settings]-[Feedback of Opinions]."}
{"task": "rw_93.jsonl", "id": 68633, "text": "6.2.2, the information required for autonomous subscription: In the follow -up function, you will choose to follow the account number according to your initiative. You can choose to pay attention or cancel your attention.", "label": ["Edit/Control", "Important"], "rewrite": "You can choose to pay attention to or cancel the subscription information."}
{"task": "rw_93.jsonl", "id": 68634, "text": "6.2.3, when you are not interested in content, you can also enter the keywords interested in the search bar, click and read the search results.", "label": ["Important", "Edit/Control"], "rewrite": "You can enter the keywords interested in the search bar, click and read the search results."}
{"task": "rw_93.jsonl", "id": 68635, "text": "7. Manage your personal information", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68636, "text": "We attach great importance to your management of personal information and do our best to protect your personal information inquiry, access, modification, delete, withdrawn, withdrawing, canceling account numbers, complaint reports, and setting up privacy functions to make you capableGuarantee your privacy and information security.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68637, "text": "7.1 Change or withdraw the scope of authorization", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68638, "text": "(1) You can turn off the camera (camera) and album (storage) in the device operating system, change the consent range or withdraw your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Turn the camera (camera) and album (storage) in the device operating system to change the scope of consent or withdraw authorization."}
{"task": "rw_93.jsonl", "id": 68639, "text": "After withdrawal authorization, we will no longer collect information related to these permissions.", "label": ["Important", "Edit/Control"], "rewrite": "After the withdrawal authorization, there will be no more information related to these permissions."}
{"task": "rw_93.jsonl", "id": 68640, "text": "(2) Specific business functions and services will need your information to be completed. When you withdraw from consent or authorization, we cannot continue to provide you with the function and services corresponding to the withdrawal consent or authorization, and no longer handle your corresponding correspondencepersonal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you withdraw consent or authorization, we cannot continue to provide the function and services corresponding to the withdrawal consent or authorization, and no longer process the corresponding personal information."}
{"task": "rw_93.jsonl", "id": 68641, "text": "But your decision to withdraw consent or authorization will not affect the personal information processing we carried out based on your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_93.jsonl", "id": 68642, "text": "7.2 Visit, delete, correct your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68643, "text": "(1) You can visit your avatar, user nickname and personal introduction on the [Mine] page;", "label": ["Edit/Control", "Important"], "rewrite": "View your avatar, user nickname and personal profile on the [Mine] page."}
{"task": "rw_93.jsonl", "id": 68644, "text": "(2) You can change your user's nickname and personal introduction on the page of [Mine]-[Edit Information] page;", "label": ["Important", "Edit/Control"], "rewrite": "Replace the user's nickname and personal profile on the page of [Mine]-[Edit Information]."}
{"task": "rw_93.jsonl", "id": 68645, "text": "(3) You can visit and cancel your collection (like) information in [My]-[Favorites];", "label": ["Important", "Edit/Control"], "rewrite": "Visit and cancel your collection (like) information in [Mine]-[Favorites]."}
{"task": "rw_93.jsonl", "id": 68646, "text": "(4) You can access and query the account information you follow in [Mine]-[Following], click the \"Follow\" button after clicking on the list of followers, you can choose to cancel the account number;", "label": ["Important", "Edit/Control"], "rewrite": "In [Mine]-[Follow], visit and query the account information you follow, click the \"Follow\" button to choose to cancel the account number."}
{"task": "rw_93.jsonl", "id": 68647, "text": "Due to the consideration of security and identification, you may not be able to modify some registered information that submit or use during the registration process (after the real -name authentication information);", "label": ["Edit/Control", "Important"], "rewrite": "You may not be able to modify some registration information submitted during the registration or use during the registration."}
{"task": "rw_93.jsonl", "id": 68648, "text": "If you really need to modify this type of information, please contact us by the homepage of the mobile client [Settings]-[Opinions] The path will contact us. We will respond or deal with it within 15 working days after receiving your contact.Essence", "label": ["Important", "Edit/Control"], "rewrite": "Please follow the first page of the mobile client on the wake-up map [Settings]-[Feedback of Opinions] The path contacts us to modify the registered information that cannot be modified independently."}
{"task": "rw_93.jsonl", "id": 68649, "text": "7.3 Logging out account", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68650, "text": "iOS User: If you need to cancel your \"Awakening\" account, please open the wake-up map, log in to your account, on the [Figure Repair] page-click [Settings]-click [Account to Logarize], follow the prompts for cancellation, For the process and content of the injection, see the \"Instructions for Logging in the Registration of Awakening\";", "label": ["Important", "Edit/Control"], "rewrite": "iOS User: Please open the awakening map, log in to the account, on the [Figure Fix] page-click [Settings]-click [account to cancel], and cancel it according to the prompts."}
{"task": "rw_93.jsonl", "id": 68651, "text": "Android user: If you need to cancel your \"awakening picture\" account, please open the awakening map and log in to your account. You can use the [Figure Fix] page-click on the upper left corner [Settings]-Click [Feedback and Report] DescriptionIf you cancel your account, or contact us to handle your cancellation account requirements by sending emails to support@retouchpics.com.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "Android user: Please open the wake-up map, log in to the account, via the [Figure Fix] page-click [Settings]-click [Opinion Feedback and Report] to describe the needs of the cancellation account, or send an mail to support@retouchpics.comWe deal with the demand for cancellation accounts."}
{"task": "rw_93.jsonl", "id": 68652, "text": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc. you have authorized us.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "Before you cancel your account, we will verify your personal identity, security status, equipment information, etc."}
{"task": "rw_93.jsonl", "id": 68653, "text": "For the process and content of the injection, see the \"Instructions for Logging in to Wake up the Account\".", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68654, "text": "You know and understand that the behavior of canceling the account is irreversible. When you log out the account, we will delete relevant information about you. If you delete personal information, it is difficult to achieve technically, we will perform anonymous processing, or stop removing removing removalIn addition to the storage and necessary safety protection measures, the laws and regulations are otherwise stipulated.", "label": ["Important", "Edit/Control"], "rewrite": "When you cancel your account, we will delete information about you. If it is difficult to delete technology, we will conduct anonymous processing or stop storage and security measures other than the information."}
{"task": "rw_93.jsonl", "id": 68655, "text": "In addition to the above, if you have any claims, requirements or questions to the right to personal information given by relevant laws and regulations, you can use the wake-up mobile client [Settings]-[Feedback and Report] or send emails to SUPPORT to SUPPORT@RetouchPics.com will contact us. We will review the issues involved as soon as possible and reply within 15 working days after verifying your user identity.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact us by waking up the mobile client [Settings]-[Feedback and Report] or send an email to the support@retouchpics.com to exercise your personal information rights."}
{"task": "rw_93.jsonl", "id": 68656, "text": "7.4 Complaint Report", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68657, "text": "In some business functions of wake -up maps and related services, we may make a decision based on the non -artificial automatic decision mechanism, including the information system, algorithm, etc.. If these decisions significantly affect your legitimate rights and interests, you have the right to ask us We will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If the non -artificial automatic decisions we make affect your legitimate rights and interests, you have the right to ask us to explain that we will also provide relief."}
{"task": "rw_93.jsonl", "id": 68658, "text": "For your reasonable requests, we will not charge any fees in principle.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68659, "text": "However, we will charge a certain cost fee depending on the actual situation for requests that repeat and beyond the reasonable limit.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68660, "text": "We may refuse to reject the risks or very unrealistic requests for unseen repetitive and too many technical means (if you need to develop a new system or fundamentally change the current management), bring risks or very unrealistic requests to others.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_93.jsonl", "id": 68661, "text": "You can complain or report in accordance with our publicity system.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68662, "text": "If you think your personal information rights may be infringed, or you can find a clue to infringe the right to personal information, you can move the mobile client by waking up the map [Settings]-[Feedback of Opinions] or send an email to the support@retouchpics.com and us to get us obtainedContact, we will review the issues involved as soon as possible, and reply within 15 working days after verifying your user identity.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "If you think your personal information rights may be infringed or found clues to infringe, you can connect with us by waking up the mobile client [Settings]-[Feedback] or sending emails to support@retouchpics.com."}
{"task": "rw_93.jsonl", "id": 68663, "text": "7.5 Visiting Privacy Policy", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68664, "text": "(1) You can check all the contents of this privacy policy on the [Settings] page, official website, etc. on the login page or on the wake -up mobile client.", "label": ["Important", "Edit/Control"], "rewrite": "View the entire content of this privacy policy on the [Settings] page, official website, etc. on the registered login page or on the wake -map mobile client."}
{"task": "rw_93.jsonl", "id": 68665, "text": "(2) Please understand that the wake -up map and related services described in this privacy policy may be different according to factors such as the equipment models, system versions, and software application versions you use.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68666, "text": "The final product and service are subject to the wake -up map and related services you use.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68667, "text": "7.6 Stopping operations to inform you", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68668, "text": "If we stop operations, we will stop collecting your personal information in time, notify you in the form of notification of operation in the form of delivery or announcement one by one, and delete or processes your personal information.", "label": ["Important", "Cessation of Operations"], "rewrite": "When the operation is stopped, the announcement will be announced in accordance with relevant laws and regulations, and personal information will be deleted or anonymous."}
{"task": "rw_93.jsonl", "id": 68669, "text": "8. Terms of minors", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68670, "text": "(1) If you are a minor under the age of 18, you should read and agree to the privacy policy together under the supervision and guidance of your parents or other guardians before using wake -up maps and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "Minors under the age of 18 should obtain the consent of the guardian before use."}
{"task": "rw_93.jsonl", "id": 68671, "text": "(2) If you are a guardian of a minor under the age of 14, you should read and agree to your privacy policy for your guardian before using wake -up maps and related services.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a guardian under the age of 14, you should help children use services after reading and agreeing to the policy."}
{"task": "rw_93.jsonl", "id": 68672, "text": "(3) In accordance with the provisions of relevant national laws and regulations, we can protect the personal information of minors in accordance with the provisions of the relevant national laws and regulations, and will only collect, use, share or disclose minors to collect, use, share, or disclose minors when legal permission, parents or other guardians need to protect or protect minors.Personal information;", "label": ["Specific Audiences", "Important"], "rewrite": "We will only collect, use, share, or disclose personal information of minors when legal permission, parents or other guardians need to collect or protect minors."}
{"task": "rw_93.jsonl", "id": 68673, "text": "If we find that the personal information of minors is collected without the consent of parents or other guardians who can be proven in advance, we will try to delete relevant information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the parents, he would try to delete relevant information as soon as possible."}
{"task": "rw_93.jsonl", "id": 68674, "text": "(4) If you are the guardian of a minor, when you have any questions about the personal information of the minors you monitor, please contact us through the contact information of the privacy policy.", "label": ["Specific Audiences", "Important"], "rewrite": "If the guardian has relevant questions about the personal information of minors, please contact us."}
{"task": "rw_93.jsonl", "id": 68675, "text": "9. Amendment and Notice of Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68676, "text": "(1) In order to provide you with better services, wake -up maps and related services will be updated and changed from time to time. We will revise the privacy policy in a timely manner. These amendments constitute a part of the privacy policy and have the effect of equivalent privacy policies.Without your clear consent, we will not cut off the rights you should enjoy based on the current privacy policy that take effect.", "label": ["Policy Change", "Important"], "rewrite": "The revision of this privacy policy will constitute a part of the privacy policy and have the effect of equivalent to the privacy policy. Without your clear consent, we will not reduce the rights you should enjoy."}
{"task": "rw_93.jsonl", "id": 68677, "text": "(2) After the privacy policy is updated, we will issue an updated version in the awakening map, and remind you of the updated content in an appropriate manner before the updated terms take effect, so that you can understand the latest version of this privacy policy in time.", "label": ["Policy Change", "Important"], "rewrite": "We will remind you the updated content in an appropriate way before the updated terms take effect."}
{"task": "rw_93.jsonl", "id": 68678, "text": "If you continue to use our service, you agree to accept the content of the policy after the revised, but if the updated content needs to collect personal sensitive information such as audio and video, contact information, geographical location, etc., you will still solicit your consent again in a significant way. Essence", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continuing the use of affairs, it agrees to accept the content of the revised policy. For example, the updated content needs to collect personal sensitive information, and it will once again solicit your consent in a significant way."}
{"task": "rw_93.jsonl", "id": 68679, "text": "(3) For major changes, we will also provide a more significant notice (we will explain the specific changes to the privacy policy through the methods including but not limited to mail, text messages, private messages, or special prompts on the browsing page).", "label": ["Policy Change", "Important"], "rewrite": "For major changes in privacy policies, we will provide a more significant notice."}
{"task": "rw_93.jsonl", "id": 68680, "text": "The \"major changes\" referred to this privacy policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68681, "text": "a. Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68682, "text": "Such as the purpose of handling personal information, the type of personal information of the processing, the way of use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68683, "text": "b. We have changed significantly in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68684, "text": "Such as changes in ownership caused by business adjustment, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68685, "text": "c. The main objects of personal information sharing, transfer or public disclosure have changed;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68686, "text": "d. You participate in the right of personal information processing and its exercise methods have undergone major changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68687, "text": "e. We are responsible for the responsibility department, contact method and complaint channels for handling personal information security.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68688, "text": "10. Scope of application", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68689, "text": "This privacy policy is suitable for all the wake -up related services provided by Shenzhen Facemeng Technology Co., Ltd. and its affiliates. It is not suitable for related parties or third -party products that have a separate privacy policy and have not been included in the privacy policy.Or service.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68690, "text": "This privacy policy is not applicable::", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68691, "text": "(1) Products or services of other related parties or third parties may include other products or websites connected to the products or websites and advertisements or wake -up services that are displayed to you in personalized recommendations;", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68692, "text": "(2) Other third parties to advertising for sober map products and services.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68693, "text": "You use the products and services provided by our related parties or third parties (including any personal information you provided to it), and will be subject to the provision of the service clauses and privacy policy of our affiliated parties or third -party service clauses (not thisPrivacy policy), please read the terms of our affiliated parties or third parties.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68694, "text": "Please protect your personal information properly and provide it with it.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68695, "text": "If you have any questions, opinions, or suggestions for the content of this privacy policy, you can contact us by [Settings]-[Feedback of Opinions] by waking up the mobile client or sending emails to or sub-support@retouchpics.com.", "label": ["Important", "Contact Information"], "rewrite": "If you have any questions, opinions, or suggestions, you can contact us through the [Settings]-[Feedback of Opinions] or sending emails to or sub-support@retouchpics.com through the wake-up map."}
{"task": "rw_93.jsonl", "id": 68696, "text": "Beijing Yanxuan Technology Co., Ltd. and Shenzhen Facemeng Technology Co., Ltd. are the related companies of bytes.", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68697, "text": "11. Contact us", "label": [], "rewrite": []}
{"task": "rw_93.jsonl", "id": 68698, "text": "If you have complaints, suggestions, and questions about personal information protection issues, you can send the problem to (support@retouchpics.com or dataprivacy@bytedance.com) or mail to the following address:", "label": ["Important", "Contact Information"], "rewrite": "Mailbox: support@retouchpics.com or dataprivacy@bytedance.com"}
{"task": "rw_93.jsonl", "id": 68699, "text": "China Satellite Communications Building in Haidian District, Beijing, Ministry of Legal Affairs, Data Security and Privacy Protection Center", "label": ["Important", "Contact Information"], "rewrite": "Mail address: Data Security and Privacy Protection Center, the Ministry of Legal Affairs of China Satellite and Communications Building, Haidian District, Beijing"}
{"task": "rw_93.jsonl", "id": 68700, "text": "We will review the issues involved as soon as possible and reply within 15 working days after verifying your user identity.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 15 working days after verifying the user identity."}
{"task": "rw_93.jsonl", "id": 68701, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
