{"task": "rw_97.jsonl", "id": 69339, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69340, "text": "\"Break 3 User Personal Information and Privacy Protection Policy\" (hereinafter referred to as \"Privacy Policy\") from you (also known as \"user\" or \"you\") and Shanghai Miha You Ying Iron Technology Co., Ltd. (also called below\"Mihayou\" or \"we\") jointly concluded, and this \"Privacy Policy\" has a contract effect.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69341, "text": "You are welcome to use the services provided by Mihayou for you, including your interactive behavior and/or your registered and/or registered products or services provided by Miha You (hereinafter collectively referred to as \"Mihayou service \"or\" service \").", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69342, "text": "In order to ensure the privacy of users during the use of Mihayou service, Mihayoute has formulated this \"Privacy Policy\" to explain to you how to collect, use, store, and share your individuals when using the Mida -yam service.The information, as well as the way we provide access, update, control and protect this information.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69343, "text": "This \"Privacy Policy\" is suitable for the service we provided by us.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69344, "text": "When you use the services we provide, we will process and protect your personal information in accordance with the agreement of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69345, "text": "The points are as follows:", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69346, "text": "• In order to provide you with basic services such as gaming entertainment and interactive and consumption related to this player, we need to collect your account and login information, game log information, equipment information, consumption information, real -name certification information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect account and login information, game log information, equipment information, equipment information, consumption information, and real -name authentication information to provide basic services."}
{"task": "rw_97.jsonl", "id": 69347, "text": "In order to provide you with other value -added services and logistics services, we also need to collect other information such as your delivery address and birthday, as well as the contact information you actively provide us.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect other information such as the delivery address, birthday, contact information and other information you actively provide to provide value -added services and logistics services."}
{"task": "rw_97.jsonl", "id": 69348, "text": "• In the process of providing services, the specific scenarios and functions of service -based services may need to apply for some system permissions to you. You can manage your personal information and related authorization according to the guidelines.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69349, "text": "•, except for the situation stipulated in this \"Privacy Policy\", we will not actively share, transfer, disclose your personal information until third parties other than Mihayou, such as other sharing, transfer, disclose your personal information or youWhen we need to share, transfer, and disclose your personal information to a third party other than Mihayou, we will directly or confirm that the third party obtains your consent of your above behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there is an agreed situation agreed in this policy or your main request to share, transfer, and disclose your personal information, we will directly or confirm that the third party obtains your explicit consent of the above behavior."}
{"task": "rw_97.jsonl", "id": 69350, "text": "•, you can query, correct, delete, copy your personal information, change the scope of your authorization consent or revoke your authorization consent, and cancel the Mihayou service account.", "label": ["Important", "Edit/Control"], "rewrite": "You can query, correct, delete, copy your personal information, change or revoke authorization, and cancel the service account."}
{"task": "rw_97.jsonl", "id": 69351, "text": "• We use multi -directional security protection measures to ensure that your personal information protection is at a reasonable level of security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69352, "text": "You can learn more detailed personal information processing rules through reading the full version of \"Three User Personal Information and Privacy Protection Policy\" to understand the corresponding relationship of personal information type and use.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69353, "text": "If you are a minor under the age of 18 (especially children under the age of 14), Mihayou specifically please pay attention. You need to read this \"Privacy Policy\" with your guardian.Thin fonts are marked with personal information related to the personal information of minors (especially children under the age of 14), please and your guardians must read it carefully;", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please and your guardian to read this policy carefully."}
{"task": "rw_97.jsonl", "id": 69354, "text": "After obtaining your guardian's consent of all the terms of this \"Privacy Policy\", use Midhayou service.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Minors must obtain the consent of the policy before using the Mihayou service."}
{"task": "rw_97.jsonl", "id": 69355, "text": "Children's special description:", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69356, "text": "We suggest: Any child should obtain the consent of the guardian in advance.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69357, "text": "If you are a child under the age of 14, please notify your guardian to read the \"Privacy Policy\" together, especially \"Three Children's Personal Information and Privacy Protection Policy\", and you submit personal information and use Mihayou servicePreviously, seeking and obtaining the consent and guidance of your guardian.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "If you are a child under the age of 14, please read privacy policies with your guardian and use services or information under the consent and guidance of the guardian."}
{"task": "rw_97.jsonl", "id": 69358, "text": "You click to agree to this \"Privacy Policy\", or you use/continue to use Midhayou services and submit personal information, all indicate that you have obtained the permission of your guardian, and your guardian also agreesEspecially the constraints of \"Breaking 3 Children's Personal Information and Privacy Protection Policy\".", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Click to agree to this \"Privacy Policy\" or use/continue to use Mihayou service or submit personal information to indicate that your guardian has permitted and agreed to accept this policy."}
{"task": "rw_97.jsonl", "id": 69359, "text": "We may revise this \"Privacy Policy\" in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69360, "text": "When the terms of this \"Privacy Policy\" have changed significantly, we will prompt you the guidance after the version is updated when the version is updated.", "label": ["Policy Change", "Important"], "rewrite": "We will prompt the updated privacy policy in the form of a pop -up window."}
{"task": "rw_97.jsonl", "id": 69361, "text": "Please read the \"Privacy Policy\" after the change.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69362, "text": "You continue to use the Mihayou service, saying that you agree that we collect, process or use your personal information according to the updated \"Privacy Policy\".", "label": ["Policy Change", "Important", "Risk"], "rewrite": "If you continue to use your service, you will indicate the privacy policy after the update."}
{"task": "rw_97.jsonl", "id": 69363, "text": "After reading the \"Privacy Policy\", if you have any problems with this \"Privacy Policy\" or related matters related to this \"Privacy Policy\", you can contact us through the contact information published by Article 9 of this agreement.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69364, "text": "1. Information collected by Mihayou:", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69365, "text": "When we provide you with services, we will collect, store or use the following information related to you in other legal ways.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69366, "text": "If you do not provide relevant information, you will not be able to register as our user, or to enjoy part or all products or services we provide, or to achieve the effect that related services intend to achieve.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69367, "text": "You understand and agree that some single services may require you to turn on specific access permissions in your device to achieve the collection and use of information involved in these permissions.", "label": ["Usage", "Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69368, "text": "We will collect and use your personal information for the following goals:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69369, "text": "1.1 We will collect the following information when you take the initiative:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69370, "text": "Log in.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect mobile phone numbers or emails to accept the verification code matching the identity of the person to complete the registration/login."}
{"task": "rw_97.jsonl", "id": 69371, "text": "Only when you provide the true and accurate above information can you successfully register your account and use the core function of Midhayou products.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69372, "text": "If you choose not to provide the above -mentioned necessary information to realize Mihayou's core product functions, or it will cause us to not provide you with the core product function.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69373, "text": "1.1.2, in order to meet the \"Notice of the National Press and Publication Administration on Preventing the Independence of Minors\", \"Notice on Further Strict Management and Performing and Preventing Minors to Daling Online Games\" and other relevant laws and regulations and policiesRequires, you need to provide us with name, phone number and identity certificate when registering an account or using the Mihayou service. This type of information is a sensitive information, and refusal to provide real -name authentication information will cause you to be unable to log in or be corresponding during the game.limit.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect names, phone numbers and identity certificates for real -name authentication, otherwise you may not be able to log in to the game or use it."}
{"task": "rw_97.jsonl", "id": 69374, "text": "In order to strengthen minor protection measures, face recognition information of your person is also required under certain circumstances to perform practical verification, refusing to provide real -person authentication information may cause you to be restricted by the corresponding anti -addiction during the game.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collector's face recognition information can be authenticated, otherwise your use may be limited."}
{"task": "rw_97.jsonl", "id": 69375, "text": "1.1.3 In order to provide you with value -added services other than Mihayou services, including gifts, prizes, and birthday wishes, you agree to provide us with relevant personal information, including sending address and birthday. Refusing to provide this information will only cause you to be unable to be unable to provide you.Obtaining related value -added services does not affect other functions of your normally use Miha You;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect personal information such as the delivery address and birthday you provide to provide value -added services such as gifts and prizes."}
{"task": "rw_97.jsonl", "id": 69376, "text": "1.1.4, to provide you with logistics services for third -party logistics service providers, you agree to provide us with relevant personal information, including names, mobile phone numbers, address information, etc., refusing to provide this information, it will only cause you to obtain relevant logistics services.It does not affect other functions of Mihayou normally.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect personal information such as the name, mobile phone number, address information you provide to provide logistics services."}
{"task": "rw_97.jsonl", "id": 69377, "text": "1.2 In order to provide you with services and protect account security, we will collect the information you actively provided when using the service or because of the service of the service:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69378, "text": "1.2.1 Device or software information.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69379, "text": "In order to ensure your normal use of our services, maintain the normal operation of the basic functions of the game and ensure your account security, we will collect your mobile devices, web browsers, or the configuration provided by other programs that connect to our products or servicesInformation, your IP address, terminal device (including mobile phones, tablets, computers, mobile smart devices, customer devices, wireless routers, operating systems and other must -have, other must -have, hardware or Internet devices), network status, IMSI, IMSI,MAC address, Android ID, installation unique logo, application unique logo, equipment name, equipment type and version, equipment model, equipment manufacturer and brand, CPU information, battery and charging status, system country, timestamp, jailbreak/jailbreak/jailbreak/jailbreak, Application name and version, SDK version, simulator information (only Android), device horizontal and vertical screen information (only iOS), the unique logo of ROM, device screen resolution and size, system startup time, whether it runs in the simulator, language area, Memory size and remaining memory, remaining built -in and external SD card spatial capacity, equipment application software installation list, running process information, host file, SD card applicable cache file list list, system type and version, application ID, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, network, and networkInformation (including network type information, network environment), UUID, IDFA, IDFV, national code, WiFi list, SSID, device unique identification information (IMEI), SIM card serial number.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect the basic configuration information, equipment information, system information, etc. of your device, web browser or other programs connected to our products or services to maintain the basic functions of the game and ensure account security."}
{"task": "rw_97.jsonl", "id": 69380, "text": "That is, the only identification information of the device is used only to provide you with a security guarantee function in the process of using the Midhayou service;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The unique identification information of the collection device is only used for security during the game."}
{"task": "rw_97.jsonl", "id": 69381, "text": "This type of information is the basic information that must be collected for services;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69382, "text": "In order to provide you with accurate transaction services, we will also obtain your SSID to ensure your transaction security. Collecting the above information is necessary to realize the consumption function of the Mida game product, otherwise the transaction will not be completed;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your SSID to ensure your transaction security."}
{"task": "rw_97.jsonl", "id": 69383, "text": "1.2.2 User's game behavior log.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69384, "text": "In order to enable you to view your game history records on the client, and at the same time used for game operation statistical analysis, customer service complaint processing, and game security analysis, we will collect your login logs, item logs, game -to -game information, purchase records, friendsRecords, after obtaining your consent, we may synchronize the aforementioned information to the subsequent version of the game or other Mihayou services you are using.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your login log, item log, game -to -game information, purchase records, dating records for game operation statistical analysis, customer service complaint processing, and game security analysis, and use the subsequent version or other Mihayou services after you agree."}
{"task": "rw_97.jsonl", "id": 69385, "text": "In addition, in order to ensure your account security, in the login verification scenario, we will collect and use the cursor movement speed and click position of the cursor generated during the operation verification process;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In the login verification scenario, collect and use your cursor to move speed and click position information."}
{"task": "rw_97.jsonl", "id": 69386, "text": "1.2.3 When you use the consumer function of Mihayou game products, we will collect your recharge records and consumer record information in order to check your transaction records, provide you with payment functions, and at the same time to protect your virtual virtual to the greatest extentItem safety.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your recharge records and consumer record information for you to query or provide you with payment functions."}
{"task": "rw_97.jsonl", "id": 69387, "text": "The recharge record and consumption record are sensitive information. Collecting the above information is necessary to achieve the consumption function of Mihayou game products, otherwise the transaction will not be completed;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect recharge records and consumer records are necessary to achieve consumption functions."}
{"task": "rw_97.jsonl", "id": 69388, "text": "1.2.4 Based on providing security guarantee for your account, we will collect your game recognition information, hardware and operating system information, processes and game collapse record information, application lists, and current operating task information to combat the damage to the fair environment of the gameOr interference and destroying the normal behavior of game services are used to detect pirated, scanned plug -in, and prevent cheating;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your game recognition information, hardware and operating system information, process and game crash record information, application lists, and current operating task information to maintain the fairness of the game and ensure the security of the game."}
{"task": "rw_97.jsonl", "id": 69389, "text": "1.2.5, when you interact with other players through text and voice in the game, we may collect and preserve the above information content you sent to filter the improper content of pornography, violence, politics, abuse, and malicious advertisements in orderPurify the game environment and maintain a healthy Internet environment;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and save the content of the interactive information you sent to filter the improper content of pornography, violence, politics, abuse, and malicious advertisements."}
{"task": "rw_97.jsonl", "id": 69390, "text": "1.2.6 Equipment rights.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69391, "text": "In the process of providing services, the specific scenarios and functions of the service may require you to turn on some equipment access rights.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69392, "text": "Under normal circumstances, we will collect and use your following permissions in the following scenarios:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69393, "text": "1) Camera (camera) access permissions. When you take pictures in the software to upload graphic content, actual authentication and/or scan our product or service, we need to authorize us to access your album and///Or camera (camera) permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your album and/or camera (camera) permissions for taking pictures and uploading text content, actual authentication and/or scanning QR code login products or services."}
{"task": "rw_97.jsonl", "id": 69394, "text": "If you refuse to authorize, it will affect your normal use of taking pictures, code -scanning login functions, and real -person authentication functions, but it will not affect other functions in your software;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69395, "text": "2) Reading and storage space (album) permissions. When you need to upload pictures or files in your device in the software, store game screens or videos to your device, perform realistic authentication or obtain game resources, we we can obtain game resources, we, we obtain game resources, we can obtain game resources, we can obtain game resources, we can obtain game resources, we can obtain game resources, we can obtain game resources, we can obtain game resources, weYou need to authorize us to access your storage space (album) permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your read and write storage space (album) permissions for uploading pictures or files in the device, and store the game screen or video to the device."}
{"task": "rw_97.jsonl", "id": 69396, "text": "If you refuse to authorize, it will affect your normal use of pictures, files or video upload/or download functions, actual authentication, and normal acquisition of game resources, but it will not affect other functions in your software;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69397, "text": "3) Audio recording (microphone) permissions. When you need to turn on the voice function in the software, we need to authorize us to visit your device recording (microphone) related permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your audio recording (microphone) permissions for providing voice functions."}
{"task": "rw_97.jsonl", "id": 69398, "text": "If you refuse to authorize, it will affect your normal use of voice chat function, but it will not affect other functions in your software;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69399, "text": "4) Flash light authority, when you take pictures or scan the QR code to log in to our products or services in the software, we need you to authorize us to visit your flashing authority.", "label": ["Permission Acquisition", "Important"], "rewrite": "Obtain your flashing light authority to provide photos or scanning QR code login products or services."}
{"task": "rw_97.jsonl", "id": 69400, "text": "If you refuse to authorize, it will affect your normal use of shooting and code -scanning login function, but it will not affect other functions in your software;", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69401, "text": "5) Network permissions, when you use the network function in the software, we need to authorize us to access the network permissions, otherwise, you will not be able to connect normally and use the Internet, but it will not affect other functions in your software;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your network permissions to provide connected functions in the software."}
{"task": "rw_97.jsonl", "id": 69402, "text": "6) Telephone permissions, when you use the real authentication function in the software, we need to authorize us to access your phone permissions. If you refuse to authorize, you will not be able to complete the action interaction normally to complete the user identity verification, but it will not give you you not to youUsing other functions in the software to have an impact.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your phone permission to provide real -person authentication functions in the software."}
{"task": "rw_97.jsonl", "id": 69403, "text": "7) Mobile phone/telephone status access permissions. When you log in to our game product with the game link channel, we need to authorize us to access your mobile phone/phone status to obtain your unique device recognition code, so as to better protect youThe account number is safe, but when you cancel the authorization, we will no longer collect the information, and we can no longer provide you with the above -mentioned services;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your mobile phone/telephone status access permission to obtain the unique device recognition code so that you can log in to the game product with the game link channel."}
{"task": "rw_97.jsonl", "id": 69404, "text": "But unless you delete your personal information in accordance with the law, your cancellation behavior will not affect the processing and storage of our personal information based on your previous authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Deleting personal information will not affect the processing and storage of personal information based on authorization."}
{"task": "rw_97.jsonl", "id": 69405, "text": "8) The permissions of the shear plate. When you copy the content from the outside to our products, the contents of the contents of the product are pasted inside or outside the product, including copying content from the product to the Miyou Society APPWhen dynamic and transition dynamics, we will call your shear function.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your scissors permissions and make it convenient for you to copy and paste."}
{"task": "rw_97.jsonl", "id": 69406, "text": "2. How to use your information on Mihayou", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69407, "text": "2.1 For the necessary personal information, we will use the business functions of Mihayou services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69408, "text": "2.2 For non -necessary personal information, we will use the following purposes, including real -time weather, picture upload functions for customer service consulting complaints, user questionnaires, user research telephone interviews, user return invitations or other activities invitations, voice chat.", "label": ["Usage"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69409, "text": "You can contact us at any time to cancel your unnecessary personal information and authorize us.", "label": ["Edit/Control", "Important"], "rewrite": "You can cancel the use of non -necessary personal information."}
{"task": "rw_97.jsonl", "id": 69410, "text": "Canceling authorization may cause you to be unable to realize some of the corresponding functions of Mihayou services.", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation of authorization will cause the corresponding function to be unable to implement."}
{"task": "rw_97.jsonl", "id": 69411, "text": "2.3 If we use your information in other uses that have not been stated in this \"Privacy Policy\", we will solicit your consent in advance.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69412, "text": "However, according to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and openly disclose personal information without requiring your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69413, "text": "1) Directly related to national interests such as national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing, commissioning, transfer, and disclosure of national security and national defense security and other national interests do not need to be authorized."}
{"task": "rw_97.jsonl", "id": 69414, "text": "Directly related to the major public interests such as public safety, public health, and public knowledge;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing, entrustment, transfer, and openly directly related public interests such as public safety, public health, and public knowledge, no authorization consent is required."}
{"task": "rw_97.jsonl", "id": 69415, "text": "2) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Directly related to sharing, commissioning, transferring, and disclosure with criminal investigation, prosecution, trial, and judgment execution, there is no need to authorize consent."}
{"task": "rw_97.jsonl", "id": 69416, "text": "3) For major legitimate rights and interests such as maintaining your life, property, and reputation of you or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of maintaining major legitimate rights and interests such as life, property, and reputation of you or other individuals, it is difficult to obtain sharing, entrustment, transfer, and disclosure of my consent, and no need to authorize consent."}
{"task": "rw_97.jsonl", "id": 69417, "text": "4) The collected personal information is made by your own public;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is publicly disclosed to the public by itself and does not need to authorize consent."}
{"task": "rw_97.jsonl", "id": 69418, "text": "5) Collect personal information from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, there is no need to authorize consent."}
{"task": "rw_97.jsonl", "id": 69419, "text": "6) Signing and fulfilling the contract according to your requirements;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to your request to sign and perform the contract, there is no need to authorize consent."}
{"task": "rw_97.jsonl", "id": 69420, "text": "7) The necessary and stable operation of the products or services provided by the maintenance of the products provided, including the failure of the discovery and disposal of the product or service;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The safety and stable operation of the products or services provided by maintaining the sharing, commission, transfer, and disclosure of the necessary operations, no authorization consent is required."}
{"task": "rw_97.jsonl", "id": 69421, "text": "8) It is necessary to carry out legal news reports;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "To carry out legal news reports necessary sharing, commission, transfer, and disclosure, no need to agree."}
{"task": "rw_97.jsonl", "id": 69422, "text": "9) When the statistics or academic research institutes are needed for public interests, and the results of academic research or descriptions are provided, the personal information contained in the result is identified by", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When the public interest is necessary to carry out statistics or academic research, and the results of academic research or descriptions are provided, the personal information contained in the results is to identify, commission, transfer, open, and no authorization consent."}
{"task": "rw_97.jsonl", "id": 69423, "text": "10) Other circumstances stipulated in laws and regulations.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69424, "text": "3. How to share, transfer or disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69425, "text": "Except for the situation stipulated in this \"Privacy Policy\", we will not actively share, transfer, disclose your personal information to third parties other than Mihayou, such as other sharing, transfer, disclosure of your personal information or you need us to need us need us.When sharing, transfer, disclose your personal information to a third party outside Mihayou, we will directly or confirm that the third party obtains your consent of your behavior.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there is an agreed situation agreed in this policy or your main request to share, transfer, and disclose your personal information, we will directly or confirm that the third party obtains your explicit consent of the above behavior."}
{"task": "rw_97.jsonl", "id": 69426, "text": "3.1 How do we share your information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69427, "text": "We follow the provisions of laws and regulations and strictly restrict the sharing of personal information.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69428, "text": "Unless the Treaty of 2.3, or we get your clear consent, we will not share your personal information with any other companies, organizations and individuals.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69429, "text": "Based on the following situations, we will ask you to authorize your personal information to agree:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69430, "text": "3.1.1 In order to facilitate you to check the binding information, play data, and role data of the broken 3 account at the Miyou Club APP, we may share your aforementioned information from the Miyou Society APP;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your binding information, play data, and character data from Miyou APP for you to view."}
{"task": "rw_97.jsonl", "id": 69431, "text": "3.1.2 Provide our products or services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69432, "text": "We may share your information with partners and other third parties to help us provide you with more complete services, including: the purpose of sending gifts, providing corresponding order information to logistics service providers;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share your order information to a third party to send gifts or provide other more complete services."}
{"task": "rw_97.jsonl", "id": 69433, "text": "For the purpose of real -name verification, provide the corresponding contact information to the communication service provider;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Provide contact information to communication service providers for real -name verification."}
{"task": "rw_97.jsonl", "id": 69434, "text": "3.1.3 Mihayou provides users with a wealth of online interactive activities. In order to facilitate your participation in interactive activities and get interactive prizes, Mihayou usually requires you to be in addition to the contact method (mailing address and telephone).Fill in the form.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the form information you filled in according to your personal interests to provide online interactive activities."}
{"task": "rw_97.jsonl", "id": 69435, "text": "Such information is used by Miha to accumulate data from its users.", "label": ["Important", "Usage"], "rewrite": "The form information you filled in according to your personal interests is used to accumulate user data."}
{"task": "rw_97.jsonl", "id": 69436, "text": "Whether you provide the required information and participating in such activities, this is completely determined by your own;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69437, "text": "3.1.4 The purpose of fulfilling our obligations in this \"Privacy Policy\" or we reached with you;", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69438, "text": "3.1.5 When you use the Mihayou service, you will also use the SDK that provides us with some other services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69439, "text": "The above SDK may collect your personal information for the purpose of providing the above services.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Provide us other SDKs that collect your personal information to provide services."}
{"task": "rw_97.jsonl", "id": 69440, "text": "The SDK list is like an attachment.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The SDK list is like an attachment."}
{"task": "rw_97.jsonl", "id": 69441, "text": "For specific conditions such as SDK's legal liability, please see the privacy policy of the SDK operator;", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69442, "text": "Third -party company name products/services involve personal information use scenarios to use the purpose of sharing method of third -party links", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69443, "text": "Beijing Jiyun Technology Co., Ltd., trackingio_android, the advertising logo, equipment hardware information, network environment information, user behavior information, when tracking the effect of advertising, user behavior analysis, advertising cheating analysis, SDK machine collection, https collection, https, https: //www.trackingio.com/#/policy", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Trackingio_android collects your equipment hardware information, network environment information, user behavior information for advertising attribution, user behavior analysis, advertising cheating analysis."}
{"task": "rw_97.jsonl", "id": 69444, "text": "Beijing Jiyun Technology Co., Ltd., trackingio_ios, the advertising logo, equipment hardware information, network environment information, user behavior information, when tracking advertising effects, advertising attribution, user behavior analysis, advertising cheating analysis, SDK machine collection, https collection, https: //www.trackingio.com/#/policy", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Trackingio_ios collects your equipment hardware information, network environment information, user behavior information for advertising attribution, user behavior analysis, advertising cheating analysis."}
{"task": "rw_97.jsonl", "id": 69445, "text": "Shenzhen Tencent Computer System Co., Ltd. MTP (ACE), device model, system version, IMEI, IMSI, Android, ID, MAC address, network type, WIFI name, nearby WIFI name, brand, CPU architecture, ROOT, ROM, ROMThe unique logo, device screen resolution, system startup time, whether it runs in simulator, language area, remaining memory, remaining built -in and external SD card space capacity, installed APK information, running process information, host files, SD cards, SD cardsList of files in the application cache directory, after user login account, use during the game, anti-cheating, SDK's collection, https://www.anticheatexpert.com/doc-doc-doc-8fc4c1195346e47281bc410698921", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "MTP (ACE) collects basic information such as your device model, system version, network type, etc. for the game to cheat."}
{"task": "rw_97.jsonl", "id": 69446, "text": ": //www.jiguang.cn/en/license/privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Jpush collects the basic information of your IMEI, IDFA, Android ID and other devices for push messages."}
{"task": "rw_97.jsonl", "id": 69447, "text": "Shanghai Youkun Information Technology Co., Ltd., SharesDK, system operation information, network status information, iOS advertising identifier (IDFA), MAC address, international mobile device recognition code (IMEI), anonymous device logo (OAID), international mobile user recognition identificationCode (IMSI), application list information, base station information, social platform OpenID, when users conduct content sharing, content sharing, SDK This machine collection, https://www.mob.com/about/policy", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Sharesdk collects basic information such as systematic operation information, network status information, IDFA and other equipment for content sharing."}
{"task": "rw_97.jsonl", "id": 69448, "text": "Alipay (China) Network Technology Co., Ltd., Alipay Payment, IMEI/IMSI, SIM card serial number/MAC address, Android_id, network information, use Alipay payment when users use Alipay, help users use Alipay in the application, collect Alipay, collect machine collection, collection of this machine, collecting the machine collection, collection of this machine, collecting machine collection, collection of this machine, collecting machine collection, collecting machine collection, collection of this machine, collecting machine collection, collection of this machine, collection of this machine, collecting the machine collection, collection of this machine, collecting the machine, and collecting the machine.https://opendocs.alipay.com/open/01g6qm", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Alipay payment collects your IMEI/IMSI, SIM card serial number/MAC address, Android_id, and network information so that users can use Alipay to pay."}
{"task": "rw_97.jsonl", "id": 69449, "text": "Shenzhen Tencent Computer System Co., Ltd., BUGLY, network information, equipment information (operating system), device identification code (Androidid/IDFV, national code), log information, capture the error bug information in the game operation process, collect collapse information, SDKCollection of this machine, https://bugly.qq.com/v2/contract", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Bugly collects your network information, equipment information, equipment identification code, log information to collect collapse information."}
{"task": "rw_97.jsonl", "id": 69450, "text": "Alibaba Cloud Computing Co., Ltd., Alibaba Cloud Performance Certification SDK, device information (including equipment models, operating system versions, device settings, MAC addresses and IMEI, IDFA and other feature information, equipment environment and other characteristics), facial features, real persons, real personsUse when authentication identity, face recognition and real person verification, SDK collection, https://help.aliyun.com/document_detail/171604.html#tital-FGG-J3S-4SR", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Alibaba Cloud Performance Certificate SDK collects your equipment information and face characteristics to face face recognition and real person verification."}
{"task": "rw_97.jsonl", "id": 69451, "text": "Beijing Weimeng Chuangke Network Technology Co., Ltd., Weibo SDK, MAC address, Android ID, use when users share content to Weibo, help users share content to third -party applications, SDK This machine collection, https:// weibo.COM/SIGNUP/V5/Privacy", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Weibo SDK collects your MAC address and Android ID so that users can share content to third -party applications."}
{"task": "rw_97.jsonl", "id": 69452, "text": "Wuhan Jiyi Network Technology Co., Ltd., polar test SDK, application name, power status, equipment version, network type, network environment, national, screen height, device information (classification, name, model, pixel), SDK version number, SDK version number, Whether to jailbreak, memory size, system type, system version, APP version, time stamp, installation unique logo, the speed of application, the speed of the clicks, iOS, unique: device horizontal and vertical screen, Android, unique, uniquely unique: Simulator information, battery index, whether there is a power supply in the device, before the user's account login or send a mobile phone/SMS verification code, log in verification function, SDK machine collection, http://www.geetest.com/private", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Extreme SDK collects your application name, network information, equipment information, etc. to achieve login verification functions."}
{"task": "rw_97.jsonl", "id": 69453, "text": "3.1.6 If you obtain software and access the Mikhayou service through the non -Mihayou platform such as the game joint transportation channel (such as brand mobile phones or third -party app stores), some channels will access the joint transport channel SDK in the software, and use it.Log in to our game products through this channel to achieve payment and real -name system functions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Those who obtain software and access Mihayou services through the channels other than Mihayou platform will access the joint transport channel SDK in the software to achieve payment and real -name system."}
{"task": "rw_97.jsonl", "id": 69454, "text": "In order to ensure that you can log in to the game product and use related services, you need to authorize the channel Fang SDK to provide the corresponding services;", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69455, "text": "After you authorize, the channel party will collect your relevant personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The channel party will collect your personal information after obtaining your authorization."}
{"task": "rw_97.jsonl", "id": 69456, "text": "Regarding the types of information, use, personal information protection rules and exit mechanism collected by the channel party, please understand according to the specific transport channels of your software, refer to the codes of the council SDK privacy policy in the table below, and understand the specific collection of users of the channel SDKInformation and scope of use, and the legal responsibility it bear.", "label": ["Important"], "rewrite": "The channel party collects the rules of information types, uses, personal information protection, and exit mechanisms. The following table corresponds to the terms of the SDK privacy policy of the joint transportation SDK."}
{"task": "rw_97.jsonl", "id": 69457, "text": "That is, if the channel you obtain the software is Xiaomi App Store, the corresponding channel SDK is Xiaomi SDK, and so on.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69458, "text": "Third -party company name products/services involve personal information use scenarios to use the purpose of sharing method of third -party links", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69459, "text": "Beijing Wali Network Technology Co., Ltd., Xiaomi SDK, personal common equipment information (including hardware serial number, hardware model, equipment MAC address, operating system type, software list, unique device identification code)Use real -name services, provide account login, ⽀ payment, and real -name service, SDK This machine collection, https://privacy.mi.com/xiaomigame/zh_cn/", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Xiaomi SDK collects your personal commonly used equipment information to provide account login, ⽀ 小, and real -name services."}
{"task": "rw_97.jsonl", "id": 69460, "text": "Shanghai Kuanyu Digital Technology Co., Ltd., Bilibili, SDK, personal commonly used equipment information (including hardware serial number, hardware model, equipment MAC address, operating system type, software list, unique device recognition code), Bilibili channel provides account login login login, Payment and real-name services, provide account login, payment and real-name service, SDK This machine collection, https://www.bilibili.com/blackboard/privacy-html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Bilibili SDK collects your personal common equipment information to provide account login, payment and real -name services."}
{"task": "rw_97.jsonl", "id": 69461, "text": "Guangdong Huan Tai Technology Co., Ltd., OPPO, SDK, device recognition code, real -name authentication name and age, account recognition code, payment order, storage permissions for caching data, and provide account login and payment for players entering the game through OPPO channelsAnd when real -name services, provide account login, payment and real -name services, SDK This machine collection, https://cdofs.heytapimage.com/cdoactivity/stative/gameCenter/heytap/privacy.html? 2020 & C = 0 & LS = 1", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "OPPO SDK collects your device identification code, real -name authentication name and age, account recognition code, payment order, storage permissions for caching data to provide account login, payment, and real -name services."}
{"task": "rw_97.jsonl", "id": 69462, "text": "Guangdong Tianxun Network Technology Co., Ltd., vivo, SDK, device recognition code, real -name authentication information, account number UID, order number and other payment information For players entering the game via vivo channels, provide Huantai account login, payment and real -name services.Too account login, payment and real-name service, SDK This machine collection, https://www.vivo.com.cn/about-divo/privacy-policy", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Vivo SDK collects your device identification code, real -name authentication information, and payment information to provide Huantai account login, payment and real -name services."}
{"task": "rw_97.jsonl", "id": 69463, "text": "Shenzhen Tencent Computer System Co., Ltd., application treasure, 1. We will collect IMEI/OAID, device models, manufacturers, mobile phone serial numbers, MAC addresses, screen resolution and pixel density, android density, android density, android density, and AndroidSystems and SDK versions, Android, ID are used to provide game services adapted to different devices and software versions; 2. According to the requirements of laws and regulations, users need to be authenticated when logging in.The user's name and ID number is used for real -name authentication.For players who enter the game through application treasures and channels, provide WeChat, QQ and stand -alone login, payment and real -name authentication services, provide WeChat, QQ and stand -alone login, payment and real -name authentication services, SDK This machine collection, Master Master: https: https: //wiki.midas.qq.com/post/index/1/32/280/0,qq: https://wiki.connect.qq.com/qq%E4%BA pate92%81%94sdkkk%E9%9A%90%E7%A7%81%E4%BF%9d%E6%8A%A3%A3%B0%E6%98%8E, WeChat: https://privacy.qq.com/policy/TENCENT-PRIVACYPOLICY", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Application treasure collects basic information of your device and software to provide game services that adapt to this, collect your name and ID number for real -name authentication."}
{"task": "rw_97.jsonl", "id": 69464, "text": "Guangzhou Aiji You Information Technology Co., Ltd., Jiuyou (UC) SDK, personal commonly used equipment information (including hardware serial number, hardware model, equipment MAC address, operating system type, software list, unique device recognition code)Players who enter the game when they enter the game, provide Jiuyou account login, ⽀ and real -name services, provide Jiuyou account login, ⽀ and real -name service, SDK This machine collection, https://www.9game.cn/tpl/pc/app/private.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Jiuyou (UC) SDK collects your personal commonly used equipment information to provide Jiuyou account login, paid, and real -name system services."}
{"task": "rw_97.jsonl", "id": 69465, "text": "Meizu Technology Co., Ltd., Meizu SDK, 1. The only identification code of the mobile phone; 2. Mobile phone storage permissions, 3. Request network connection.For players who enter the game through Meizu channels, provide Flyme account login, Payment, and real -name system services, provide Flyme account login, ⽀, and real -name service, SDK This machine collection, http://game.meizu.com/fileServer/game_copyright/1/3DDE3BCE52954495B7283425FA96B976.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Meizu SDK collects your mobile phone's unique identification code, obtain your mobile phone storage permissions, network permissions to provide FlyMe account login, paid, and real -name service."}
{"task": "rw_97.jsonl", "id": 69466, "text": "Huawei Software Technology Co., Ltd., Huawei, SDK, personal commonly used equipment information (including hardware serial numbers, hardware models, equipment MAC addresses, operating system types, software lists, and unique device identification codes).When the Huawei account login, payment and real-name services, provide Huawei's account login, payment and real-name system, SDK This machine collects https://consumer.huawei.com/minisite/legal/statement.htm?code=zh-CN", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Huawei SDK collects your personal common equipment information to provide Huawei's account login, payment and real -name services."}
{"task": "rw_97.jsonl", "id": 69467, "text": "Screen resolution, network type, operator information.For players who enter the game through Lenovo channels, provide account login, ⽀ ⽀, and real -name services, provide account login, ⽀ payment, and real -name service, SDK This machine collection, https://hd.lenovomm.com/activity01/privacy/index.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Lenovo SDK collects equipment information and network types such as Lenovo accounts, equipment unique identification code, and operator information to provide account login, puppet payment, and real -name system services."}
{"task": "rw_97.jsonl", "id": 69468, "text": "Beijing Qihoo Technology Co., Ltd., Qihoo 360, SDK, mobile phone number, mailbox, user name, real -name information; positioning permissions; obtain equipment IMEI, OAID permissions; device memory read and write permissions, players who enter the game through Qihu 360 channels entering the game: //sqhd.u.360.cn/ue_plan.html", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Qihoo 360 SDK collects your mobile phone number, mailbox, user name, real -name information, obtain positioning permissions, equipment IMEI, OAID permissions, device memory read and write permissions for initialization SDK, login, payment, push Push message, storage log information information, storage log information, Customer service feedback, data statistics."}
{"task": "rw_97.jsonl", "id": 69469, "text": "3.1.7 We provide you with a link to connect to the Mihayou service through SMS, so that you can access the Mihayou service through the third -party platform (such as the game joint transportation channel).", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69470, "text": "3.1.8 Tips on sharing information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69471, "text": "Some of the Mihayou service functions we provide allows you to share your relevant information with all users who also use the service.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69472, "text": "Including the information you uploaded or published in the Mihayou service (including your personal information, your photos), the response to the information you uploaded or published by others, and the location related to this informationData and log information.", "label": ["Important", "Edit/Control"], "rewrite": "You can share the information uploaded or published, respond to the information uploaded or published by others, and the relevant location data and log information."}
{"task": "rw_97.jsonl", "id": 69473, "text": "Other users who use Mihayou services may also share information related to you (including location data and log information).", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69474, "text": "Especially in our APP chat system, it is designed to allow you to share information with other users, so that the shared information can be passed in real time and extensively.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69475, "text": "As long as you do not delete the shared information, the relevant information has always left the public field;", "label": ["Important", "Risk"], "rewrite": "As long as you do not delete the shared information, the relevant information has always left the public field."}
{"task": "rw_97.jsonl", "id": 69476, "text": "Even if you delete sharing information, the relevant information may still be cached, replicated or stored independently by other users or the third party that is not controlled by us, or is preserved by other users or such third parties in the public.", "label": ["Important", "Risk"], "rewrite": "After deleting the information you share, it may still be independently preserved by other users or the third parties that are not controlled by us."}
{"task": "rw_97.jsonl", "id": 69477, "text": "Therefore, please consider the content of uploading, publishing and communicating through our products or services.", "label": ["Important"], "rewrite": "Consider it!Whether to share or public information."}
{"task": "rw_97.jsonl", "id": 69478, "text": "You can also control the scope of user -sharing information through the privacy settings of some of our services.", "label": ["Important", "Edit/Control"], "rewrite": "You can control the scope of sharing information through privacy settings."}
{"task": "rw_97.jsonl", "id": 69479, "text": "3.2 How do we transfer your information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69480, "text": "With the sustainable development of our business, we may conduct merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your information may be transferred as a part of mergers, acquisitions, asset transfer or similar transactions."}
{"task": "rw_97.jsonl", "id": 69481, "text": "We will inform you that the relevant situation will continue to protect your personal information in accordance with the laws and regulations and not lower than the standards required by the Privacy Policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will inform you of the situation of information transfer and continue to protect or request new controller to protect your personal information."}
{"task": "rw_97.jsonl", "id": 69482, "text": "3.3 How do we disclose your information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69483, "text": "We will only disclose your information only under the following circumstances and adopt the premise that we meet the industry standards:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69484, "text": "1) After getting your clear consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After obtaining your clear consent and adopting security measures that meet industry standards, you may disclose your information."}
{"task": "rw_97.jsonl", "id": 69485, "text": "2) In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may publicly disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, and adopting security protection measures that meet industry standards, we may disclose your personal information publicly."}
{"task": "rw_97.jsonl", "id": 69486, "text": "3.4 No need to authorize sharing, transfer, disclosure", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69487, "text": "According to relevant laws and regulations and national standards, in the following circumstances, we may share, transfer, and publicly disclose personal information without obtaining your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69488, "text": "1) Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_97.jsonl", "id": 69489, "text": "2) Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_97.jsonl", "id": 69490, "text": "3) Directly related to criminal investigation, prosecution, trial and judgment execution;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be authorized."}
{"task": "rw_97.jsonl", "id": 69491, "text": "4) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_97.jsonl", "id": 69492, "text": "5) The subject of personal information disclose personal information to the public by itself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_97.jsonl", "id": 69493, "text": "6) Collect personal information from legal public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The personal information shared and disclosed is collected from the legal disclosure information without authorization."}
{"task": "rw_97.jsonl", "id": 69494, "text": "3.5 How do we retain, store and protect your information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69495, "text": "We only retain your personal information during the time limit for the purpose of the \"Privacy Policy\" and the time limit required by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information only during the necessary periods of the \"Privacy Policy\" and the time limit required by laws and regulations."}
{"task": "rw_97.jsonl", "id": 69496, "text": "We will take the following means to protect your information:", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69497, "text": "3.5.1 Data security technical measures.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69498, "text": "We use various security technologies and procedures to prevent information loss, improper use, unauthorized reading or disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69499, "text": "Including, in certain services, we will use encryption technology to protect the personal information you provide to us.", "label": ["Important", "Data Security"], "rewrite": "Use encryption technology to protect your personal information."}
{"task": "rw_97.jsonl", "id": 69500, "text": "Due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_97.jsonl", "id": 69501, "text": "I hope you can understand that your system and communication networks used in your products or services may have problems due to the situation outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_97.jsonl", "id": 69502, "text": "3.5.2 We have taken other security measures to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69503, "text": "We manage the storage and use of information by establishing a data classification classification system, data security management specifications, and data security development specifications;", "label": ["Important", "Data Security"], "rewrite": "Establish a data classification hierarchical system, data security management specifications, and data security development specifications to store and use the management specifications."}
{"task": "rw_97.jsonl", "id": 69504, "text": "Our confidentiality agreement, monitoring and auditing mechanism through information contacts to comprehensively control the data;", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms, the data is fully securely controlled."}
{"task": "rw_97.jsonl", "id": 69505, "text": "By strengthening the awareness of security and strengthening employees' awareness of protecting the importance of information;", "label": ["Important", "Data Security"], "rewrite": "Strengthen employees' understanding of the importance of protecting information."}
{"task": "rw_97.jsonl", "id": 69506, "text": "We only allow Miha tourists and partners to visit your information, and we have set up strict access to control and monitoring mechanisms for this reason;", "label": ["Important", "Data Security"], "rewrite": "Strictly limit the scope of the personnel who access information."}
{"task": "rw_97.jsonl", "id": 69507, "text": "We also require all personnel who may contact your information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "All personnel who may be exposed to your information fulfill the confidentiality obligations."}
{"task": "rw_97.jsonl", "id": 69508, "text": "We will strive to ensure that the aforementioned personnel complies with the \"Privacy Policy\" and other appropriate confidentiality measures and security measures we ask them to follow.Termid the cooperative relationship with Mihayou.", "label": ["Important", "Data Security"], "rewrite": "If all those who may be exposed to your information, if they fail to comply with this \"Privacy Policy\" or other confidentiality and security measures, they may be held accountable or terminated."}
{"task": "rw_97.jsonl", "id": 69509, "text": "3.5.3 Please understand that we will try our best to ensure the security of your personal information, but the Internet environment is not 100 % security.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69510, "text": "Due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that information is 100 % security.", "label": ["Important", "Data Security"], "rewrite": "Although there are security measures, it is impossible to fully guarantee that there is no security problem."}
{"task": "rw_97.jsonl", "id": 69511, "text": "I hope you can understand that your system and communication networks used in your products or services may have problems due to the situation outside the control scope.", "label": ["Important", "Data Security"], "rewrite": "Systems and communication networks may have problems due to unprepared factors."}
{"task": "rw_97.jsonl", "id": 69512, "text": "If security incidents such as personal information leakage occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "The emergency plan will be launched in a timely manner to deal with personal information security incidents."}
{"task": "rw_97.jsonl", "id": 69513, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification emails, and SMS, and we are about or already adopted.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_97.jsonl", "id": 69514, "text": "If it is difficult to achieve one by one, we will issue warnings by announcement.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69515, "text": "3.5.4 Method and period of information storage.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69516, "text": "We guarantee that we collect and generate personal information in the territory of the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_97.jsonl", "id": 69517, "text": "We will not transfer your personal information out of the country without obtaining your explicit authorization, the clear stipulation of laws and regulations, and the requirements of/or the requirements of/or relevant competent authorities.", "label": ["Data Retention", "Important"], "rewrite": "We will not transfer your personal information out of the country, you explicitly say authorization, laws and regulations clearly stipulate, or as required by relevant competent authorities."}
{"task": "rw_97.jsonl", "id": 69518, "text": "We will store your information in a safe way, including local storage (using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "Store your information through local storage, database and server logs."}
{"task": "rw_97.jsonl", "id": 69519, "text": "We guarantee that you will only store your personal information within the time required for service purposes or the conditions and periods stipulated by laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Reserves your personal information within the time limit required for the purpose of the cost of reaching the cost of the cost, unless the law has other requirements."}
{"task": "rw_97.jsonl", "id": 69520, "text": "After below the above storage period, we will delete or processes your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the preservation period, you will delete or treat your personal information, except for other provisions of the law."}
{"task": "rw_97.jsonl", "id": 69521, "text": "However, you exercise the right to delete the right to delete, cancel accounts or other laws and regulations (for example: the \"E -commerce Law\" stipulates that the saving time of goods and service information and transaction information is not less than three years from the date of the transaction completion).", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69522, "text": "4. How to manage your information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69523, "text": "4.1 Personal information query.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69524, "text": "When you need to query your information, you can check your personal information binding and other information through the Mida Travel Pass account system https://user.mihoyo.comBinding the mobile phone.", "label": ["Important", "Edit/Control"], "rewrite": "Find your personal information binding situation and other information through the Midyou Pass account system https://user.mihoyo.com."}
{"task": "rw_97.jsonl", "id": 69525, "text": "Before the inquiry, we may ask you to verify your identity to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Identity verification is required before querying personal information."}
{"task": "rw_97.jsonl", "id": 69526, "text": "For specific operation methods, you can operate by logging in to the Mihayou Pass account system https://user.mihoyo.com or according to the specific guidelines of the single service. We will handle your request within 15 working days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69527, "text": "4.2 Personal information correction.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69528, "text": "When you need to correct your information, you can modify and.Essence", "label": ["Important", "Edit/Control"], "rewrite": "Modify and supplement the corresponding information by https://user.mihoyo.com through the Mikhayou Pass account system."}
{"task": "rw_97.jsonl", "id": 69529, "text": "Before correction, we may ask you to verify your identity to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "Correct personal information needs to pass identity verification."}
{"task": "rw_97.jsonl", "id": 69530, "text": "For specific operation methods, you can operate by logging in to the Mihayou Pass account system https://user.mihoyo.com or according to the specific guidelines of the single service. We will handle your request within 15 working days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69531, "text": "4.3 Copy for personal information.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69532, "text": "When you need to obtain your personal information copy, you can check your personal information binding through the Mikhayou Pass account system https://user.mihoyo.com and obtain the corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "Obtain a copy of personal information binding through the Mikhayou Pass account system https://user.mihoyo.com."}
{"task": "rw_97.jsonl", "id": 69533, "text": "At the same time, through the above -mentioned Mihayou Pass account account system https://user.mihoyo.com, you can also access your information and obtain a copy of the avatar, nickname, gender, birthday, and binding mobile phone.", "label": ["Important", "Edit/Control"], "rewrite": "Obtain a copy of personal information through the above Mihayou Pass account system https://user.mihoyo.com."}
{"task": "rw_97.jsonl", "id": 69534, "text": "Before obtaining a copy, we may ask you to verify your identity to ensure information security.", "label": ["Important", "Data Security"], "rewrite": "You need to pass the authentication before obtaining the information."}
{"task": "rw_97.jsonl", "id": 69535, "text": "For specific operation methods, you can operate by logging in to the Mihayou Pass account system https://user.mihoyo.com or according to the specific guidelines of the single service. We will handle your request within 15 working days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69536, "text": "4.4 Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69537, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Edit/Control", "Important"], "rewrite": "You can exercise the right to delete personal information."}
{"task": "rw_97.jsonl", "id": 69538, "text": "1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69539, "text": "2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69540, "text": "3) If our behavior of handling your personal information violates this \"Privacy Policy\";", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69541, "text": "4) If you no longer use Mihayou service, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69542, "text": "5) If we no longer provide you with Mihayou service.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69543, "text": "You can use the internal information interface-customer service & help-account question-click \"to cancel the account?", "label": ["Important", "Edit/Control"], "rewrite": "You can use the internal information interface-customer service & help-account question-click \"to cancel the account?"}
{"task": "rw_97.jsonl", "id": 69544, "text": "How to cancel the account \"get customer service contact or call customer service phone 400-666-6312 to contact us, we will answer your request within 15 working days.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69545, "text": "If we decide to respond to your deletion request, we will also notify the third parties that obtain your personal information from our personal information, asking them to delete timely, unless the laws and regulations have an agreement, or the third party has obtained your separate authorization.", "label": ["Important", "Edit/Control"], "rewrite": "If we decide to respond to your deletion request, it will also require a third party to delete information from the information from us, unless the laws and regulations have other provisions or you have authorized it alone."}
{"task": "rw_97.jsonl", "id": 69546, "text": "When you delete the information from our services, we may not immediately delete the corresponding information in the backup system, but will delete these information when the backup is updated.", "label": ["Important", "Risk"], "rewrite": "We may delete the corresponding information in the backup system when the backup update."}
{"task": "rw_97.jsonl", "id": 69547, "text": "4.5 Change the scope of your authorization consent or revoke your authorization consent", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69548, "text": "If such authorizations agree that it is not necessary to use the Mikhayou service, you can use the internal information interface-customer service & help-account question-click to \"cancel the account number?", "label": ["Important", "Edit/Control"], "rewrite": "Through the application of internal information interface-customer service & help-account question-click \"what is cancellation account? How to cancel the account\" obtain the customer service contact information or call the customer service phone 400-666-6312 to contact us to ask for change or cancel your authorization consent."}
{"task": "rw_97.jsonl", "id": 69549, "text": "How to cancel the account \"get customer service contact or call customer service 400-666-6312 to contact us to change or revoke your authorization consent to some personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69550, "text": "We will answer your request within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69551, "text": "When you revoke the authorization consent, we will no longer deal with the corresponding personal information, but your decision to revoke the authorization consent will not affect personal information processing carried out based on your authorization.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_97.jsonl", "id": 69552, "text": "4.6 Logging out", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69553, "text": "You have the right to cancel the Midyou service account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69554, "text": "We provide you with the way to cancel the Mihayou service account. You can enter the \"Mihayou Pass Account System\" interface by applying an internal account interface (game level)-account-user center, click \"account cancellation\" for cancellation operation,Or through the internal information interface of the game-customer service & help-account question — click to \"cancel the account number?", "label": ["Important", "Edit/Control"], "rewrite": "By applying an internal account interface (game level)-account-user center, enter the \"Mihayou Pass Account Account System\" interface, click \"Account Logging out\" for cancellation operation, or through the internal information interface of the game\"What is the cancellation account? How to cancel the account\" to get the customer service contact information or call the customer service phone 400-666-6312 to make a request."}
{"task": "rw_97.jsonl", "id": 69555, "text": "How to cancel the account \"get customer service contact information or call customer service 400-666-6312 to make a request.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69556, "text": "After you cancel the Mihayou service account, you will no longer log in and use Mihayou services with this account;", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69557, "text": "The equity that has been generated during the use of Mihayou's service but not consumed will be cleared;", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation of the account will cause the unparalleled rights and interests to be cleared."}
{"task": "rw_97.jsonl", "id": 69558, "text": "The content, information, data, records, etc. under this account will be deleted or anonymous (but the laws and regulations have other regulations or the regulatory authorities are required);", "label": ["Important", "Edit/Control"], "rewrite": "The content, information, data, records, etc. under the cancellation account will be deleted or anonymous."}
{"task": "rw_97.jsonl", "id": 69559, "text": "At the same time, once the Mihayou service account is canceled, it will not be recovered.", "label": ["Important", "Edit/Control"], "rewrite": "Once the account is canceled, it will not be recovered."}
{"task": "rw_97.jsonl", "id": 69560, "text": "The processing period for account cancellation is 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "The processing period for account cancellation is 15 working days."}
{"task": "rw_97.jsonl", "id": 69561, "text": "When you choose to cancel the Midyou service account, or, when the \"User Service Agreement\" that meets Mihayou's single services occurs, or stipulated in relevant national laws and regulations, your Mihayou service account will beLogging out.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69562, "text": "When the account is canceled, we will delete your personal information according to your requirements, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After the account is canceled, the personal information will be deleted, except for other provisions of laws and regulations."}
{"task": "rw_97.jsonl", "id": 69563, "text": "4.7 respond to your above request", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69564, "text": "4.7.1 To ensure safety, you may need to provide written requests or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69565, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69566, "text": "We will respond within 15 working days.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69567, "text": "If you are not satisfied, you can also contact us and complain through the contact information released by Article 9 of the Privacy Policy.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69568, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69569, "text": "For those unprooped and needed too much technical means (for example: need to develop new systems or change the current practice fundamentally), bring risks to others' legitimate rights and interests or very unrealisticWe may refuse.", "label": ["Important", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_97.jsonl", "id": 69570, "text": "4.7.2 In the following circumstances, we will not be able to respond to your request:", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69571, "text": "1) What is related to the obligation stipulated in the performance of personal information controller;", "label": ["Important", "Edit/Control"], "rewrite": "If your request is related to the obligation stipulated by the Personal Information Controller to fulfill its obligations, it may not be responding."}
{"task": "rw_97.jsonl", "id": 69572, "text": "2) Directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_97.jsonl", "id": 69573, "text": "3) Directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_97.jsonl", "id": 69574, "text": "4) Directly related to criminal investigation, prosecution, trial, and execution judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to criminal investigation, prosecution, trial, and execution judgment, and may not be responded."}
{"task": "rw_97.jsonl", "id": 69575, "text": "5) Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights;", "label": ["Edit/Control", "Important"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malice or abuse of rights, and may not respond to the request."}
{"task": "rw_97.jsonl", "id": 69576, "text": "6) For major legitimate rights and interests such as the life and property of the subject of personal information or other individuals, it is difficult to get my consent;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_97.jsonl", "id": 69577, "text": "7) The request to respond to the subject of the personal information will cause the legitimate rights and interests of the personal information subject or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "In response to the request of the subject of the personal information, the legitimate rights and interests of the personal information subject or other individuals and organizations will be severely damaged, and we may not be able to respond to the request."}
{"task": "rw_97.jsonl", "id": 69578, "text": "8) Involved in business secrets.", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond."}
{"task": "rw_97.jsonl", "id": 69579, "text": "5. Cookies policy", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69580, "text": "Cookie is a neutral technology that allows website server to store data on the client or read data from the client.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69581, "text": "Safe cookies can provide you with more convenient services when surfing the Internet.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69582, "text": "By using cookies, Mihayou provides users with a simple and easy network experience.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69583, "text": "We may collect and use your information through cookies and store these information.", "label": ["Important", "First Party Collection Information"], "rewrite": "We collect, use and store your information through cookies."}
{"task": "rw_97.jsonl", "id": 69584, "text": "We use our own cookies to remember your identity and log in for your user.", "label": ["Important", "Usage"], "rewrite": "We use cookies to remember your identity and user login."}
{"task": "rw_97.jsonl", "id": 69585, "text": "You can reject cookies through the user selection mechanism, such as the browser settings. If you choose to refuse, you will not be able to log in to the Miha You Pass.", "label": ["Important", "Edit/Control"], "rewrite": "You can reject cookies through the user selection mechanism such as browser settings."}
{"task": "rw_97.jsonl", "id": 69586, "text": "6. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69587, "text": "Mihayou attaches great importance to the information security and protection of minors. We follow the regulations and requirements of the relevant national anti -addiction policies and implement the anti -addiction system.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69588, "text": "We will determine whether the real -name information of the relevant account is a minor and your age through the real -name information verification, and then decide whether this account is included in the anti -addiction system.", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "We judge whether the user is a minor and their age interval through real -name information verification."}
{"task": "rw_97.jsonl", "id": 69589, "text": "In addition, we will collect your login time, game duration information to judge and decide to take anti -addiction measures, guide minors to make reasonable games, and try to contact their guardians to remind, confirm and handle it after suspected minors consumption to helpMinors are healthy online.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Collect information such as login time, game duration, etc. to judge and decide to take anti -addiction measures, and contact their guardians after suspected minor consumption."}
{"task": "rw_97.jsonl", "id": 69590, "text": "If you are a guardian under the age of 14, when you use our service or the user information you provide to us when you are guarded by your career, pleaseThe contact information provided by the Policies will contact us in time.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a guardian under the age of 14, please contact us in time if you have any questions."}
{"task": "rw_97.jsonl", "id": 69591, "text": "We will protect the confidentiality and security of children's user information in accordance with relevant national laws and regulations and the provisions of the \"Breaking 3 Children's Personal Information and Privacy Protection Policy\".", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69592, "text": "Mihayou has the full -time department of personal information protection and designated the person in charge of specialized child personal information protection. It will protect personal information in strict accordance with the \"Personal Information and Privacy Protection Policy of Breaking 3 Children and Privacy Protection Policy\".", "label": ["Specific Audiences", "Important"], "rewrite": "Mihayou has the full -time department of personal information protection and designated the person in charge of the special child personal information protection."}
{"task": "rw_97.jsonl", "id": 69593, "text": "Such as the guardian and children's complaints about network information security, or any issues, opinions or opinions on the rules of children's personal information protection and measures for the protection of personal information of children in/or/or MihayouSuggestions, please contact us at any time through minor growth care hotline 021-60371740.", "label": ["Important", "Contact Information"], "rewrite": "Minor Growth Care Hotline: 021-60371740."}
{"task": "rw_97.jsonl", "id": 69594, "text": "7. Change of privacy policy changes", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69595, "text": "We may revise policies in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69596, "text": "When the terms change, we will show you the change of privacy policy after you log in.", "label": ["Policy Change", "Important"], "rewrite": "We will show you the transformed privacy policy after you log in."}
{"task": "rw_97.jsonl", "id": 69597, "text": "8. Other regulations", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69598, "text": "8.1 As any clause in this \"Privacy Policy\", regardless of whether it is completely or partially invalid or not executive, the remaining terms of this \"Privacy Policy\" should still be valid and binding and executive.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69599, "text": "8.2 The titles of all the terms of the Privacy Policy are only for easy reading. There is no actual meaning in itself. It cannot be used as the basis for explaining the meaning of this \"Privacy Policy\" and the meaning of related terms.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69600, "text": "8.3 Mita Traveling does not exercise, fails to exercise in time, or fails to fully exercise this agreement or the rights enjoyed in accordance with the laws and regulations. It should not be considered to abandon the right, nor does it affect Mihayou in the future to exercise such rights.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69601, "text": "8.4 Mihayou retains the relevant rights of the amendment, supplementing, deleting and updating the relevant rights of this \"Privacy Policy\".", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69602, "text": "8.5 This \"Privacy Policy\" is enforced, fulfilled, explained, and controversial resolution. The laws of the People's Republic of China are applicable and the application of all his conflict law is excluded.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69603, "text": "This agreement is established in Xuhui District, Shanghai.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69604, "text": "If the two parties have any controversy in the content of the \"Privacy Policy\" or their execution, the two parties should be friendly and negotiated;", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69605, "text": "When the negotiation fails, the two parties agreed to be handed over to the Shanghai Xuhui District People's Court and handled it.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69606, "text": "Nine, contact information", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69607, "text": "If you have any opinions or suggestions on this \"Privacy Policy\" or other personal information protection related matters, you can contact our data protection team through the official customer service contact information published by Mihayou or the following contact information. We will give you the necessary helpThe", "label": ["Important", "Contact Information"], "rewrite": "Contact our data protection team with the official customer service contact information or the following contact information of the official customer service."}
{"task": "rw_97.jsonl", "id": 69608, "text": "Contact email: privacy@mihoyo.com", "label": ["Important", "Contact Information"], "rewrite": "Contact email: privacy@mihoyo.com."}
{"task": "rw_97.jsonl", "id": 69609, "text": "We will review the problems involved as soon as possible and deal with it in time after verifying our identity.", "label": ["Important", "Contact Information"], "rewrite": "We will reply within 15 working days or the period of the provisions of laws and regulations."}
{"task": "rw_97.jsonl", "id": 69610, "text": "Shanghai Mihayou Ying Tie Technology Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69611, "text": "Customer service phone 400-666-6312", "label": ["Important", "Contact Information"], "rewrite": "Customer service phone: 400-666-6312."}
{"task": "rw_97.jsonl", "id": 69612, "text": "Unit 103, 1st Floor, No. 83, Building, No. 700, Yishan Road, Xuhui District, Shanghai", "label": ["Important", "Contact Information"], "rewrite": "Address: Unit 103, 1st floor of Building 83, No. 700, Yishan Road, Xuhui District, Shanghai."}
{"task": "rw_97.jsonl", "id": 69613, "text": "Update date: August 18, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69614, "text": "Latest version Effective Date: August 18, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_97.jsonl", "id": 69615, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
