{"task": "rw_98.jsonl", "id": 69616, "text": "Creating Mengtiantian Personal Information Protection Policy", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69617, "text": "Release time: March 03, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69618, "text": "Effective time: March 03, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69619, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69620, "text": "You are welcome to choose the network service provided by Shenzhen Chuangmengtian Di Science and Technology Co., Ltd. (hereinafter referred to as \"our company\" or \"us\").\"), So that you can understand how we collect, store, use, share, transfer, publicly disclose, delete your personal information, and related rights you enjoy.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69621, "text": "We attach great importance to your personal information protection and fully respect your user rights. Please read this policy carefully and make a proper choice in accordance with the guidance of this policy.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69622, "text": "Before using our products and services, please be sure to read this policy carefully, especially the terms of the bodies. You should focus on reading, and then start using our products and services after fully understanding this policy and agreed.", "label": ["Policy Change", "Important"], "rewrite": "Please read this policy carefully, and then start using our products and services after fully understanding this policy and agreed."}
{"task": "rw_98.jsonl", "id": 69623, "text": "If you do not agree with any content of this policy, you should immediately stop using our products and services.", "label": ["Policy Change", "Important"], "rewrite": "If you do not agree with any content of this policy, you should immediately stop using products and services."}
{"task": "rw_98.jsonl", "id": 69624, "text": "This policy is part of the \"Creating Mengtian User Agreement\". The unspoken issues in this policy applies the agreement on the \"Creating Dream World User Agreement\".", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69625, "text": "The main points of this policy are as follows:", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69626, "text": "▪ In order to provide you with products and services, we need to collect your basic information, personal identity information, equipment information, log information, and obtain permissions related to personal information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your basic information, personal identity information, equipment information, log information, and obtain authority related to personal information in order to provide you with products and services."}
{"task": "rw_98.jsonl", "id": 69627, "text": "▪ We will store the collected personal information in the People's Republic of China and take a variety of security protection measures to ensure your personal information security.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Personal information is stored in the People's Republic of China and adopted a variety of security protection measures to ensure personal information security."}
{"task": "rw_98.jsonl", "id": 69628, "text": "▪ We attach great importance to the protection of minors. If you are a minor or their legal guardians, please carefully read the regulations on minors in Chapter 8 of this policy;", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor or its legal guardian, please read the regulations on the juvenile in Chapter 8 of this policy."}
{"task": "rw_98.jsonl", "id": 69629, "text": "If you are a minor or its legal guardian under the age of 14, please visit the \"Personal Information Protection Policy of Children Children Children\".", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor or its legal guardian under the age of 14, please visit the \"Personal Information Protection Policy of Children Children Children\"."}
{"task": "rw_98.jsonl", "id": 69630, "text": "▪, you can check your personal collection and sharing in this policy.", "label": ["Edit/Control", "Important"], "rewrite": "You can check your personal collection and sharing in this policy."}
{"task": "rw_98.jsonl", "id": 69631, "text": "▪ You can manage your personal information and related authorization in accordance with this policy.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage your personal information and related authorization in accordance with this policy."}
{"task": "rw_98.jsonl", "id": 69632, "text": "1. The personal information we collect", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69633, "text": "When you use our company's products and services, we will collect personal information you actively provide, or due to the service.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69634, "text": "You have the right to choose which personal information to provide us, but in some cases, if you choose not to provide, you may not be able to get some services you need, or the questions you encounter cannot be responded or solved.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69635, "text": "1.1 The information you may actively provide", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69636, "text": "1.1.1, when you use your account registration or login function, we will get the basic information you provided to us when registering or logging in, including mobile phone numbers and SMS verification codes. If you choose not to provideOr log in to use our products or services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you register or log in with your account, we collect your personal basic information."}
{"task": "rw_98.jsonl", "id": 69637, "text": "1.1.2, in order to meet the relevant laws and regulations and the requirements of relevant competent authorities, you need to conduct real -name certification when you start or continue to use the company's game services.", "label": ["Important", "Usage"], "rewrite": "You need to perform real -name authentication when you start or continue to use our company's game services."}
{"task": "rw_98.jsonl", "id": 69638, "text": "We will collect your personal basic information and personal identity information when obtaining your consent or proactive, including your name, ID number, and personal identity information.As a result, you cannot use our game service, or you are restricted in the process of using the game service.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the basic information and personal identity information you agree with or proactively provide, so that you can use our services, otherwise your use will be restricted."}
{"task": "rw_98.jsonl", "id": 69639, "text": "In order to achieve the purpose of real -name certification, you agree that we can provide, inquire, and check your aforementioned identity information on our own or entrust the relevant agencies in the third direction.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "You agree that we can or entrust the relevant agencies in the third direction to provide real -name certification to you."}
{"task": "rw_98.jsonl", "id": 69640, "text": "1.1.3, if you are willing to participate in the relevant activities or questionnaires organized by the company, you may need to provide additional personal basic information and personal education work information, including your gender, occupation, industry, personal interests, game use behavior and behavior behavior, and game use behavior and game use behavior and game use behavior and game use behavior.Habits, this information will help us understand the operation of our products and improve our service design according to feedback.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you participate in an event or questionnaire survey, collect your personal capital information and personal education work information you provide to understand the operation of the product and the feedback improvement service design."}
{"task": "rw_98.jsonl", "id": 69641, "text": "We will get your authorization before you invite you to participate in related activities. If you choose not to provide this information, you may not be able to participate in the event, but it will not affect your basic service functions.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to be authorized to provide additional personal basic information and personal education work information may lead to failure to participate in activities but does not affect the use of basic service functions."}
{"task": "rw_98.jsonl", "id": 69642, "text": "1.1.4, if you use the information production, release, sharing, and communication functions in our product or service, you may take the initiative to provide relevant graphic, videos, sharing, and interactive behavior information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use information production, publishing, sharing, and communication and interactive functions, collect the information, videos, sharing, and interactive behavior information you actively provide."}
{"task": "rw_98.jsonl", "id": 69643, "text": "We will collect your above information and show your nicknames, avatars, and published information content in order to provide you with social functions and save historical records.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and display your nicknames, avatars, and publish information to provide you with social functions and preserve historical records."}
{"task": "rw_98.jsonl", "id": 69644, "text": "Please note that the information you uploaded or published in the open area may be collected and used by others, and this information may include personal sensitive information. To ensure your personal and property security, please provide it with caution.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Please note that the information uploaded or published in the open area may be collected and used by others, and it may include personal sensitive information."}
{"task": "rw_98.jsonl", "id": 69645, "text": "If you do not agree with us to collect the above information, you will not be able to use our social functions, but it does not affect your use of other functions in our products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to collect your nicknames, avatars, and published information content will cause unavailable social functions, but does not affect the normal use of other functions."}
{"task": "rw_98.jsonl", "id": 69646, "text": "1.1.5, when you interact with our customer service or use the user response function, including online submission opinion feedback, communicate with online/artificial customer service, for your account number and system security, we may need you to provide account information first, and and with you with you and you.The personal information you provided before is matched to verify your user identity.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use a customer service or user response function, collect your account information for authentication."}
{"task": "rw_98.jsonl", "id": 69647, "text": "When you use customer service or user response function, we may also need to collect your contact information (the phone number, email, contact information you use when you contact us), and your communication records and usThe necessary information, where the communication records and content are personal sensitive information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you use customer service or user response function, collect your contact information and the necessary information related to our communication records and needs."}
{"task": "rw_98.jsonl", "id": 69648, "text": "We collect this information to investigate the facts and help you solve the problem.", "label": ["Important", "Usage"], "rewrite": "Collect your contact information, communicate with our communication records to investigate facts and solve problems."}
{"task": "rw_98.jsonl", "id": 69649, "text": "1.2 The information we get during your service process", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69650, "text": "1.2.1, in order to maintain basic business functions and ensure your normal use of our services, we will collect the following information during your service process:", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect information during your use to maintain basic business functions."}
{"task": "rw_98.jsonl", "id": 69651, "text": "▪ In order to ensure your account security and prevent user account data loss after changes in user accounts, we will collect the equipment information you use, the brand, model, version, configuration (including storage memory), device MAC address, platform, platform, platform, platform, platform, platform, platform, platform, platform, platformLanguage, IP address, OAID (Android system), Android, ID (Android system), UUID (iOS system).", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect your basic information, system information, network information, etc. to ensure account security and prevent user data loss."}
{"task": "rw_98.jsonl", "id": 69652, "text": "▪ In order to check your historical records on the client, at the same time, we can collect your log information, including login logs, item logs, dating records, and gamesLog information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your log information so that you can view historical records, operate statistical analysis, customer complaint processing and service experience analysis."}
{"task": "rw_98.jsonl", "id": 69653, "text": "▪ When you use the consumption function, we will collect your recharge records and consumer records so that you can check your transaction records and protect your property security to the greatest extent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your recharge records and consumer record so that you can query the transaction record."}
{"task": "rw_98.jsonl", "id": 69654, "text": "Please note that recharge records and consumption records are personal sensitive information. Collecting the above information is necessary to achieve consumption functions. If you refuse to provide, you will not be able to complete the transaction.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect recharge records and consumer records as necessary for consumption functions."}
{"task": "rw_98.jsonl", "id": 69655, "text": "▪ When you visit the specific functional page of the product, we will read your clipboard content to determine whether there is a related oral code (including the invitation code and the exchange code) information.Will collect the order code to provide you with what you need. We will not store other information of your clipboard. Among them, the redemption code is a personal sensitive information. Please provide it with caution.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you visit the product specific functional page, we will collect the password information in the shear plate, but it will not store other information."}
{"task": "rw_98.jsonl", "id": 69656, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide the password code in the shear plate, it will only cause this function, but it does not affect other functions."}
{"task": "rw_98.jsonl", "id": 69657, "text": "1.2.2, when you use our products or services, we will apply to you system permissions related to personal information.Select whether to authorize us to collect relevant information. If you turn on the corresponding permissions, you deepen that you authorize us to access, obtain, collect, and use personal information involved. When you cancel this authorizationProvide you with the corresponding features:", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "When you use your product or service, we will obtain system permissions related to your personal information, and stop collecting the information after you cancel the authorization and no longer provide the corresponding function."}
{"task": "rw_98.jsonl", "id": 69658, "text": "▪ In order to save game data and realize resource downloads, we need to obtain the storage authority of the Android system to read and write external memory, and obtain the documents, pictures, and media content you store. This information may include personal sensitive information.To ensure your personal and property safety, please provide it with caution.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the storage permissions of the Android system to read and write external memory, and obtain the documents, pictures, and media content you store."}
{"task": "rw_98.jsonl", "id": 69659, "text": "If you refuse to provide it, it will only make you unable to use the corresponding functions, but it does not affect other functions of your normal use of products or services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69660, "text": "▪ In order to achieve a one -click login function, we need to obtain the phone permissions of the Android system to read the phone number of this machine and obtain your mobile phone number.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the phone permissions to read the phone number to achieve one -click login function."}
{"task": "rw_98.jsonl", "id": 69661, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products or services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69662, "text": "▪ In order to help you add nearby people as friends, we need to obtain the position permissions of the Android system to obtain precise geographical location information. The precise geographical location information is personal sensitive information. Please provide it with caution.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get location permissions to obtain accurate geographical location information to help you add people nearby as friends."}
{"task": "rw_98.jsonl", "id": 69663, "text": "If you refuse to provide it, it will only make you unable to use this function, but it does not affect other functions of your normal use of products or services.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69664, "text": "1.3 Your information we obtained through a third party", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69665, "text": "In order to facilitate your login and use the services we provide, we may obtain relevant information from third -party partners.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may obtain relevant information that you are authorized and shared from third -party partners to provide you with services."}
{"task": "rw_98.jsonl", "id": 69666, "text": "We will reasonably collect your information on the premise of complying with relevant laws and regulations and based on the agreement with related partners or third -party partners, and convinced the source of information provided, including the following situations:", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your information reasonably after the legal sources are legally legal and confident in accordance with the law."}
{"task": "rw_98.jsonl", "id": 69667, "text": "1.3.1, when you download or buy company product services through Apple App Store and major Android app stores, your information obtained from these app stores may include your mobile phone number and account information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you download or buy product services through the app store, we will get your information from the application store."}
{"task": "rw_98.jsonl", "id": 69668, "text": "1.3.2, if you authorize a third -party account, including Weibo, WeChat, QQ, or mobile phone brand user accounts to log in to use our services, we will get the relevant information under the third -party account you authorized, including avatars, including avatars, including avatars, including avatars, Nickname, and identity verification information, which are specifically based on your authorization content, and your third -party account is bound to our service account so that you can log in and use our service directly through a third -party account. If you refuse to refuseIf you authorize such information, you will not be able to log in to and use our service with a third -party account.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you log in to the third -party account number, we will get the relevant information under the account authorized by you, and bind the account with the service account so that you can log in to the service directly with the account."}
{"task": "rw_98.jsonl", "id": 69669, "text": "If you want to invite you and your friends to use our products or services, or share it with your friends, after you have authorized, we will get a list of friends who have authorized your third -party license to log in, so that you will interact with your friends.Personal sensitive information, please provide it with caution. If you refuse to provide it, you will not be able to add friends to our products or services to our products or services through third -party authorized login accounts, but it will not affect your other functions that use our products or services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you want to invite friends to use or share with your friends, we will authorize the list of friends who have authorized your third -party account to interact with your friends."}
{"task": "rw_98.jsonl", "id": 69670, "text": "1.4 Exception of authorization consent.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69671, "text": "According to relevant laws and regulations and national standards, we may not be able to solicit your authorization consent in the following circumstances to collect and use your personal information:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to relevant laws and regulations and national standards, we may not be able to solicit your authorization consent in the following circumstances to collect and use your personal information:"}
{"task": "rw_98.jsonl", "id": 69672, "text": "1.4.1, to make or fulfill the contract between you and us;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to set up or fulfill the collection and use information that you and us are necessary, there is no need to solicit authorization consent."}
{"task": "rw_98.jsonl", "id": 69673, "text": "1.4.2, the company's fulfillment of statutory duties or the requirements of the legal voluntary office;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "It is not necessary to solicit authorization consent for the company's fulfillment of statutory duties or collecting information necessary for the legal duty."}
{"task": "rw_98.jsonl", "id": 69674, "text": "1.4.3, to deal with emergencies, or in urgent situations to protect the health and property security of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_98.jsonl", "id": 69675, "text": "1.4.4, the implementation of news reports and public opinion supervision for public interests handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_98.jsonl", "id": 69676, "text": "1.4.5, directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to national security and national defense security does not need to solicit authorization consent."}
{"task": "rw_98.jsonl", "id": 69677, "text": "1.4.6, directly related to public safety, public health, public network security, network environment governance, and major public interests;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The collection and use information directly related to public safety, public health, public network security, network environment governance, and direct public interests does not need to solicit authorization consent."}
{"task": "rw_98.jsonl", "id": 69678, "text": "1.4.7, directly related to criminal investigations, prosecution, trial and execution of judgment;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Direct related collection and use information such as criminal investigation, prosecution, trial, and execution of judgments does not need to solicit authorization consent."}
{"task": "rw_98.jsonl", "id": 69679, "text": "1.4.8, because of maintaining major legitimate rights and interests such as life and property of your or other individuals, it is difficult to get your consent;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Out of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to obtain the collection and use information you agree with, without requiring the consent of authorization."}
{"task": "rw_98.jsonl", "id": 69680, "text": "1.4.9, the personal information involved is what you disclose to an unspecified public by yourself;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "The personal information involved in use is publicly disclosed to an unspecified public by itself, and no authorization consent is required."}
{"task": "rw_98.jsonl", "id": 69681, "text": "1.4.10, used to maintain the safety, quality and stable operation of products or services, and prevent hazardous operational safety behavior;", "label": ["Important", "First Party Collection Information", "Usage", "Risk"], "rewrite": "The collection and use information necessary for maintaining the safety, quality and stable operation of products or services, and preventing the safety of operating safety behaviors does not need to solicit authorization consent."}
{"task": "rw_98.jsonl", "id": 69682, "text": "1.4.11, the need for statistics or academic research institutions for statistics or academic research institutes for public interests, and the results of academic research or descriptions are identified by the personal information contained in the results;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When the scientific research institutions of statistics or academic research are carried out by public interests, and the results of academic research or descriptions are provided outside, they are collected and used for identifying the personal information contained in the results without authorization."}
{"task": "rw_98.jsonl", "id": 69683, "text": "1.4.12, collect personal information from the information disclosed by legal and publicly disclosed", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you collect personal information from the legal disclosure information, you do not need to solicit authorization consent."}
{"task": "rw_98.jsonl", "id": 69684, "text": "1.4.13, other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_98.jsonl", "id": 69685, "text": "2. How do we use your personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69686, "text": "We will use your personal information reasonably within the scope of the content of this article, and fully respect your user's independent choice.", "label": ["Usage"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69687, "text": "If we use your personal information to exceed the scope of the purpose of the collection, we will tell you and re -obtain your authorization consent before use.", "label": ["Important", "Usage"], "rewrite": "If we use personal information to claim the scope, we will inform you and regain your authorization consent."}
{"task": "rw_98.jsonl", "id": 69688, "text": "2.1 We may use the collected information as the following purpose:", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69689, "text": "2.1.1, provide you with various functions and services in the product;", "label": ["Important", "Usage"], "rewrite": "The collected information is used to provide you with various functions and services in the product."}
{"task": "rw_98.jsonl", "id": 69690, "text": "2.1.2, when we provide services, for identity verification, customer service, security precautions, fraud monitoring, archiving and backup to ensure the safety of the products and services we provide;", "label": ["Important", "Usage"], "rewrite": "Your information will be used for authentication, customer service, security precautions, fraud monitoring, archiving and backup to ensure the safety of products and services."}
{"task": "rw_98.jsonl", "id": 69691, "text": "2.1.3, statistics on the situation of our services to show the overall trend of our service, but these statistical information does not include any identity information information;", "label": ["Important", "Usage"], "rewrite": "Statistics the situation of your service to show the overall trend of service."}
{"task": "rw_98.jsonl", "id": 69692, "text": "2.1.4, evaluate the effects of advertising and promotion and promotion activities in our services, and improve;", "label": ["Important", "Usage"], "rewrite": "Collect information to evaluate the effects of advertising and promotion and promotion activities in services."}
{"task": "rw_98.jsonl", "id": 69693, "text": "2.1.5, software authentication or management software upgrade;", "label": ["Important", "Usage"], "rewrite": "Collect information for software authentication or management software upgrades."}
{"task": "rw_98.jsonl", "id": 69694, "text": "2.1.6, invite you to participate in surveys on our products and services.", "label": ["Important", "Usage"], "rewrite": "The collected information is used to invite you to participate in surveys on our products and services."}
{"task": "rw_98.jsonl", "id": 69695, "text": "2.2, we may send you advertising marketing information to you through your email, mobile phone SMS, and contact information, and provide or promote the company's or third -party products and services. You can find the relevant prompt in the information you receive.Select the withdrawal or cancel the subscription according to the prompts.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "Sending advertising marketing information through your email, mobile phone text message, and contact information, you can choose to unsubscribe."}
{"task": "rw_98.jsonl", "id": 69696, "text": "2.3, we may issue an announcement related to service when our service changes.", "label": ["Important", "Usage"], "rewrite": "We will issue an announcement related to service when the service changes."}
{"task": "rw_98.jsonl", "id": 69697, "text": "You may not be able to cancel and limit these announcements related to services and nature.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69698, "text": "2.4 We will use the collected information in the purpose of this policy.", "label": ["Usage"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69699, "text": "If we use your personal information to exceed the purpose of the collection and the scope of direct or reasonable connection, we will tell you again before using your personal information and obtain your explicit consent.", "label": ["Important", "Usage"], "rewrite": "If we use the information that exceeds the purpose of the original collection purpose, we will tell you again and obtain the consent."}
{"task": "rw_98.jsonl", "id": 69700, "text": "3. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69701, "text": "In order to statistics and analyze the operating effects of the network products and network services we provide, we have used several automatic data collection tools, including Cookie and Web, Beacon.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We use Cookie and Web Beacon statistics and analyze the operating effects of network products and services."}
{"task": "rw_98.jsonl", "id": 69702, "text": "With these technologies, we can identify your product usage and prevent fraud.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69703, "text": "We promise that the above technology will not be used for any purpose outside the purpose of this policy.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69704, "text": "If your device or related program allows, you can turn off or delete the above technology by changing the settings or the webpage of the provider, but your move may affect your service experience, and some services may not be able to use it normally normallyEssence", "label": ["Important", "Edit/Control"], "rewrite": "You can turn off or delete cookie and beacon by changing the settings, or through the web page of the provider."}
{"task": "rw_98.jsonl", "id": 69705, "text": "4. How do we store personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69706, "text": "In accordance with the requirements of relevant laws and regulations, we will follow the principle of minimizing personal information preservation and reasonably preserve your personal information.", "label": ["Data Retention", "Important"], "rewrite": "We will keep your personal information follow the principle of minimizing personal information preservation."}
{"task": "rw_98.jsonl", "id": 69707, "text": "4.1 The way to save", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69708, "text": "We will store your information through AES and RSA encryption, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "Store your information through AES and RSA encryption."}
{"task": "rw_98.jsonl", "id": 69709, "text": "We will continue to save your personal information during your use of company services.", "label": ["Data Retention", "Important"], "rewrite": "We will save your personal information during your service."}
{"task": "rw_98.jsonl", "id": 69710, "text": "If you cancel your account or the company's product shutdown, we will save the network log from the date of cancellation or stop service for 3 years.", "label": ["Data Retention", "Important"], "rewrite": "If you cancel your account or product shutdown, we will save the network log from the date of cancellation or suspension for 3 years."}
{"task": "rw_98.jsonl", "id": 69711, "text": "For the storage period of other data, we promise to achieve the minimum period for providing services. After exceeding the above period, we will delete or processes your relevant information.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required for the service purpose. After the storage period is exceeded, your personal information will be deleted or anonymous."}
{"task": "rw_98.jsonl", "id": 69712, "text": "4.2 Save area", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69713, "text": "The personal information we collected and generated in the People's Republic of China will be stored in the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_98.jsonl", "id": 69714, "text": "4.3 How can your personal information be transferred globally", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69715, "text": "Since we provide products or services throughout the global resources and servers, this means that after obtaining your authorization consent, your personal information may be transferred to an overseas jurisdiction in your country/region where your product or service is located, orAccess received from these jurisdictions.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "Your personal information may be transferred to the overseas jurisdiction of the country/region of the product or service to the country/region, or it is visited by these jurisdictions."}
{"task": "rw_98.jsonl", "id": 69716, "text": "There may be different data protection laws in such jurisdictions, and no relevant laws are set up.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "There may be different data protection laws in the country/region where products or services are located, and no relevant laws are set up."}
{"task": "rw_98.jsonl", "id": 69717, "text": "In such circumstances, we will ensure that your personal information is sufficiently protected in the People's Republic of China.", "label": ["Important", "Data Security", "Risk"], "rewrite": "We will ensure that your personal information is sufficiently protected by the People's Republic of China in overseas jurisdictions."}
{"task": "rw_98.jsonl", "id": 69718, "text": "For example, we will ask you to agree to cross -border transfer of personal information, or implement security measures such as data to identify data before cross -border data transfer.", "label": ["Important", "Data Security"], "rewrite": "For cross -border transfer of personal information, we will request your consent in advance, or take security measures such as remarking the logo before the transfer."}
{"task": "rw_98.jsonl", "id": 69719, "text": "5. How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69720, "text": "We attach great importance to the protection of your personal information and use AES and RSA technology to ensure the security of your personal information.", "label": ["Important", "Data Security"], "rewrite": "Use AES and RSA technology to ensure your personal information security."}
{"task": "rw_98.jsonl", "id": 69721, "text": "5.1, we have used security measures that are in line with industry standards to protect your personal information, prevent data from being unauthorized, publicly disclosed, used, modified, damaged or lost.", "label": ["Important", "Data Security"], "rewrite": "We take security measures that meet industry standards to protect your personal information."}
{"task": "rw_98.jsonl", "id": 69722, "text": "We have used the following various security technologies and procedures to protect your personal information", "label": ["Data Security"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69723, "text": "5.1.1, we enable the SSL protocol to provide encryption protection when you exchange data (such as credit card information) between your browser or application and server;", "label": ["Important", "Data Security"], "rewrite": "SSL protocols are enabled to provide encrypted protection when switching data between browsers or applications and servers."}
{"task": "rw_98.jsonl", "id": 69724, "text": "5.1.2, we have adopted encrypted technologies such as transport layer security protocols to provide browsing services through HTTPS and other methods to ensure the security of your data during transmission;", "label": ["Important", "Data Security"], "rewrite": "Provide viewing services through HTTPS and other methods to ensure the security of data during transmission."}
{"task": "rw_98.jsonl", "id": 69725, "text": "5.1.3, we ensure that third parties can only access the API interface we shared through HTTPS. We only provide an account verification function, so the third party cannot retrieve your personal information;", "label": ["Important", "Data Security"], "rewrite": "Make sure that third parties can only access shared API interfaces through HTTPS, and only provide account verification functions."}
{"task": "rw_98.jsonl", "id": 69726, "text": "At the same time, we have adopted a comprehensive anti -SQL injection method to prevent the database system from being attacked by the outside world;", "label": ["Important", "Data Security"], "rewrite": "The anti -SQL injection method is used to prevent the database system from being attacked by the outside world."}
{"task": "rw_98.jsonl", "id": 69727, "text": "5.1.4, we use encryption technology to encrypt your personal information. Your password is encrypted by secondary MD5 and other technologies, which is ciphertext information;", "label": ["Important", "Data Security"], "rewrite": "The encrypted technology is used for encryption and preservation of personal information. The password is encrypted by secondary MD5 and other technologies."}
{"task": "rw_98.jsonl", "id": 69728, "text": "5.1.5, in certain services, we may also remind you to change the password by phone, SMS and other methods.", "label": ["Important", "Data Security"], "rewrite": "In some services, remind you to change your password through telephone, text messages, etc."}
{"task": "rw_98.jsonl", "id": 69729, "text": "5.2, we have obtained the following certification in the field of information security:", "label": ["Important", "Data Security"], "rewrite": "In the field of information security, \"Information Security Technology-Cyber Security Level Protection-Level 3\" certification has been obtained."}
{"task": "rw_98.jsonl", "id": 69730, "text": "\"Information Security Technology-Cyber Security Level Protection-Level 3\"", "label": ["Data Security"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69731, "text": "5.3, we only allow employees and partners of the company and company related parties to visit your personal information, and set up strict access control and monitoring mechanisms for this.", "label": ["Important", "Data Security"], "rewrite": "Deploy access to the control mechanism and try to ensure that only persons that are required to be known can access personal information."}
{"task": "rw_98.jsonl", "id": 69732, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "All personnel who may be exposed to your personal information to fulfill their obligations of confidentiality."}
{"task": "rw_98.jsonl", "id": 69733, "text": "5.4, the Internet is not an absolutely secure environment, and the communication method of email, instant messaging, and social software cannot determine whether it is completely encrypted. We recommend that you use such tools to use complex passwords or modify the account password from time to time.And pay attention to protect your personal information security.", "label": ["Important", "Data Security"], "rewrite": "It is recommended that you modify the account password with complex passwords or irregularly, and pay attention to protecting personal information security."}
{"task": "rw_98.jsonl", "id": 69734, "text": "5.5, we will try our best to ensure the security you send to us.", "label": ["Important", "Data Security"], "rewrite": "We will try our best to ensure the security you send to us."}
{"task": "rw_98.jsonl", "id": 69735, "text": "If our physics, technology, or management protection facilities are maliciously damaged, the information is caused by unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": ["Important", "Data Security"], "rewrite": "For example, our physical, technical, or management protection facilities are damaged, resulting in unauthorized access, public disclosure, tampering, or destruction, leading to damage to your legitimate rights and interests, we will bear the corresponding legal responsibility."}
{"task": "rw_98.jsonl", "id": 69736, "text": "5.6, if there is a personal information security incident, we will inform you in a timely manner in accordance with the requirements of laws and regulations: the basic situation and possible impact of security incidents, the disposal measures we have taken or will take, you can prevent and reduce the riskSuggestions, remedy measures, etc.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_98.jsonl", "id": 69737, "text": "We will timely inform you that the incident -related situation is informing the email, letter, telephone, push notification, etc. When it is difficult to inform the subject of the personal information one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_98.jsonl", "id": 69738, "text": "At the same time, we will also actively report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_98.jsonl", "id": 69739, "text": "6. How can we share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69740, "text": "6.1 Sharing", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69741, "text": "To achieve business functions, we may share your personal information from a third party to achieve the service or specific function you need.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information to achieve service or specific functions."}
{"task": "rw_98.jsonl", "id": 69742, "text": "If we need to share your personal sensitive information, we will solicit your authorization consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you share your personal sensitive information, we will solicit your authorization consent again."}
{"task": "rw_98.jsonl", "id": 69743, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will only share the necessary personal information for legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_98.jsonl", "id": 69744, "text": "We will strictly limit the behavior of third -party use of your personal information by signing an agreement to ensure that third parties handle personal information in accordance with our requirements, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will limit the behavior of third parties using your personal information and ensure that third parties deal with personal information in accordance with confidentiality and security measures."}
{"task": "rw_98.jsonl", "id": 69745, "text": "At the same time, we will also take effective technical protection measures to ensure the security of your personal information during sharing.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will take technical protection measures to ensure the safety of personal information sharing."}
{"task": "rw_98.jsonl", "id": 69746, "text": "We will try to be anonymous to the personal information in the shared content. You understand and agree that the information after anonymous processing cannot be identified or associated to you.There is no need to obtain your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will try to be anonymous to the personal information in the shared content, and the information after anonymous processing does not need to obtain your authorization consent."}
{"task": "rw_98.jsonl", "id": 69747, "text": "At present, we need to share your personal information in the following situations:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69748, "text": "6.1.1, in order to facilitate our unified account system of the company to provide you with consistent services and facilitate your unified management, ensure system and account security, your personal information may be necessary to share within the company's products.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your personal information may be shared within the company's products so that you can manage your account uniformly."}
{"task": "rw_98.jsonl", "id": 69749, "text": "6.1.2, in order to ensure the realization of our product -related functions and the safe and stable operation of our product, some services will be provided by third parties. We need to share your personal information to the third party when you use the corresponding functionSDK) or other similar applications.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of providing some services in third parties, we may share your personal information from third parties."}
{"task": "rw_98.jsonl", "id": 69750, "text": "When you use the services provided by these third parties in our products, you agree to collect and process your personal information directly. We will strive to review the business access qualifications of the third party and strive to require it to be legally compliant and compliant and compliant.safety.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Risk"], "rewrite": "When you use the services provided by a third party, you agree to collect and process your personal information directly.We will review the qualifications of third parties and require their legitimate compliance and security."}
{"task": "rw_98.jsonl", "id": 69751, "text": "In order to ensure your information security to the greatest extent, we strongly recommend that you check your privacy clauses before using the services provided by a third -party service provider.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69752, "text": "In order to protect your legitimate rights and interests, if you find that the service provided by a third -party service provider is risky, it is recommended that you immediately terminate the relevant operations and contact us in a timely manner.", "label": ["Important", "Data Security"], "rewrite": "If you find a risk of third -party services, it is recommended that you immediately terminate the operation and contact us in time."}
{"task": "rw_98.jsonl", "id": 69753, "text": "At present, our products sharing personal information with third -party sharing for personal information, please refer to the \"Sharing Personal Information List with a Third Party\". The access path of the product is set -shared the personal information list with the third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the situation of sharing personal information, please check the \"Sharing Personal Information List with Third Party\" through \"Settings -Sharing Personal Information List with Third Party\"."}
{"task": "rw_98.jsonl", "id": 69754, "text": "6.2 Transfer", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69755, "text": "We will not transfer your personal information to any company, organization or individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not transfer your personal information to any company, organization or individual, except the following situations: except:"}
{"task": "rw_98.jsonl", "id": 69756, "text": "6.2.1, in case of special circumstances, after obtaining your clear authorization consent, we will transfer your personal information to other parties;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In special circumstances, we transfer your personal information to other parties after obtaining your clear authorization consent."}
{"task": "rw_98.jsonl", "id": 69757, "text": "6.2.2, when involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, we will ask new companies and organizations that hold your information to continue to be subject to this policy.Solving your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, companies and organizations that require your personal information will continue to be subject to this policy, otherwise it will request it to re -authorize your authorization consent."}
{"task": "rw_98.jsonl", "id": 69758, "text": "6.3 Public disclosure", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69759, "text": "We will only publicly disclose your personal information in the following circumstances:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only publicly disclose your personal information in the following circumstances:"}
{"task": "rw_98.jsonl", "id": 69760, "text": "6.3.1, after obtaining your clear authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear authorization consent, disclose your information publicly."}
{"task": "rw_98.jsonl", "id": 69761, "text": "6.3.2, disclosure based on the prizes: If we announce the list of winning activities, we will desensitize the winner's mobile phone number or login name;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In a prize event, we may disclose your information."}
{"task": "rw_98.jsonl", "id": 69762, "text": "6.3.3, based on legal disclosure: under the circumstances of legal, legal procedures, litigation or government authorities, we may disclose your personal information publicly;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the case of compulsory requirements of legal, legal procedures, litigation, or government authorities, we may disclose your personal information publicly."}
{"task": "rw_98.jsonl", "id": 69763, "text": "6.4 social network", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69764, "text": "Our social network services are designed to make you communicate with users around the world. You can make communication information in real time and extensively.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69765, "text": "When you use the social network function in our service, you will may share some personal information. We provide you with the scope of users that can control personal information in some services. At the same time, you can also ask us to delete yourRelated personal information.", "label": ["Important", "Edit/Control"], "rewrite": "When you use social network functions, you can share personal information within the range you set, and you can also require deleting relevant information."}
{"task": "rw_98.jsonl", "id": 69766, "text": "6.4.1, you may share personal information through social networks: including the information that you uploaded or published in our services (including your public personal information), and the response you uploaded or posted by others, youThe records, rankings, and location data and log information related to this information;", "label": ["Edit/Control", "Important"], "rewrite": "You can share your information uploaded or published through social networks, response to other people, your records, rankings, and location data and log information, including information related to this information."}
{"task": "rw_98.jsonl", "id": 69767, "text": "If you do not agree to disclose your personal information in the product, you can close it according to the guidance of the product.", "label": ["Important", "Edit/Control"], "rewrite": "You can close and share."}
{"task": "rw_98.jsonl", "id": 69768, "text": "6.4.2, other users may share information related to you through social networks;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other users may share information related to you through social networks."}
{"task": "rw_98.jsonl", "id": 69769, "text": "6.4.3, deletion of shared information: As long as you do not delete the shared information, the relevant information will always leave the public domain;", "label": ["Important", "Edit/Control"], "rewrite": "The information you shared will always stay in the public domain before deleting."}
{"task": "rw_98.jsonl", "id": 69770, "text": "Even if you delete the sharing information, the relevant information may still be cached, copied or stored by other users or non -associated third parties that are not controlled by the company, or preserved by other users or such third parties in the public field;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "After deleting the information you share, it may still be independently preserved by other users or the third parties that are not controlled by us."}
{"task": "rw_98.jsonl", "id": 69771, "text": "6.4.4, the protection of your sharing information on social networks: In some cases, you can control the scope of user scope of your sharing information through the privacy settings of some of our services;", "label": ["Important", "Edit/Control"], "rewrite": "You can control the scope of users with the right to browse your shared information through the privacy settings of the service."}
{"task": "rw_98.jsonl", "id": 69772, "text": "You can also ask for deleting your relevant information from our service, please contact us through the contact information described in Chapter 10.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us to delete relevant information."}
{"task": "rw_98.jsonl", "id": 69773, "text": "6.5 Share, transfer, and publicly disclose the exception of authorized consent in the case of personal information.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69774, "text": "According to the relevant laws and regulations, in the following situations, we shared, transferred, and publicly disclosed personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the relevant laws and regulations, in the following situations, we shared, transferred, and publicly disclosed personal information."}
{"task": "rw_98.jsonl", "id": 69775, "text": "6.5.1, related to the obligations stipulated in the performance of the company's fulfillment of laws and regulations;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure related to the obligations stipulated by the company's performance of laws and regulations does not need to be authorized."}
{"task": "rw_98.jsonl", "id": 69776, "text": "6.5.2, directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The sharing or disclosure directly related to national security and national defense security does not require authorization."}
{"task": "rw_98.jsonl", "id": 69777, "text": "6.5.3, directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure directly related to public safety, public health and major public interests does not need to be authorized."}
{"task": "rw_98.jsonl", "id": 69778, "text": "6.5.4, directly related to criminal investigations, prosecution, trial and execution of judgment;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Sharing or disclosure related to criminal investigation, prosecution, trial, and judgment execution does not need to be solicited."}
{"task": "rw_98.jsonl", "id": 69779, "text": "6.5.5, in maintaining major legitimate rights and interests such as life and property of your or other individuals, but it is difficult to get your authorization consent;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Out of the major legitimate rights and interests of the life and property of the subject of personal information or other individuals, it is difficult to get shared or disclosed by my consent, and there is no need to solicit."}
{"task": "rw_98.jsonl", "id": 69780, "text": "6.5.6, personal information that you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The collected personal information is the sharing or disclosure of the subject of the personal information to the public by themselves without authorization."}
{"task": "rw_98.jsonl", "id": 69781, "text": "6.5.7, collecting personal information from the legal and public information, such as legal news reports and government information disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you collect personal information from the legal disclosure information, no authorization is required."}
{"task": "rw_98.jsonl", "id": 69782, "text": "7. Your rights", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69783, "text": "During your use of us to provide you with services, we may provide you with the corresponding operation settings depending on the specific situation of the service so that you can inquire, correct, delete your relevant personal information, cancel your user account, revoke the authorized authorization authorized authorized authorization, Get a copy of personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can query, correct, delete your relevant personal information, cancel your user account, revoke the authorized authorization, and obtain a copy of personal information."}
{"task": "rw_98.jsonl", "id": 69784, "text": "In accordance with relevant laws and regulations, we guarantee the following rights to exercise your personal information.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69785, "text": "In addition, we also set up a complaint report channel. You can contact us through the contact information described in Chapter 10, and your opinion will be dealt with in a timely manner.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69786, "text": "7.1 You have the right to access your personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69787, "text": "You can log in to your personal account through our products or services, access the personal information in your account at any time, including the mobile phone number that binds our product or service.Angle settings -user center -mobile phone binding.", "label": ["Important", "Edit/Control"], "rewrite": "You can access your personal data information and bind the mobile phone number through the \"main interface of the game -the upper left corner -user center -mobile phone binding\"."}
{"task": "rw_98.jsonl", "id": 69788, "text": "You can also check the summary of our personal information in \"Has Collected Personal Information List\".", "label": ["Important", "Edit/Control"], "rewrite": "You can collect the personal information list to see the \"Personal Information List\"."}
{"task": "rw_98.jsonl", "id": 69789, "text": "If you cannot access your personal information in the aforementioned method, you can access your account information under the channel of the channel party, such as you still cannot access your personal information in the aforementioned method, or you need to obtain the aforementioned methodIf you can't know the personal information content, you can contact us through our customer service phone (4008400188) or the email address (Kefu@idreamsky.com), and we will reply to you within 15 working days.", "label": ["Important", "Edit/Control"], "rewrite": "You can access your account information under this channel through the channel of the channel side, or you can contact us with our customer service phone (4008400188) or an email address (Kefu@idreamsky.com) to contact us to get personal information."}
{"task": "rw_98.jsonl", "id": 69790, "text": "7.2 You have the right to correct your personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69791, "text": "You can log in to your personal account through our products or services to correct the basic information and information of your account at any time, including the mobile phone number that binds our product or service. The operation path in the official website package is: the main interface of the game-Set up in the upper left corner -user center -mobile phone binding -replace the mobile phone number.", "label": ["Edit/Control", "Important"], "rewrite": "You can correct your personal information, and change the mobile phone number bound to the binding through the \"main interface of the game -the upper left corner -user center -mobile phone number\"."}
{"task": "rw_98.jsonl", "id": 69792, "text": "If you cannot correct your personal information through the aforementioned method, you can correct your account information under this channel through the account of the channel party. If you can still correct your personal information through the previous way, you can pass our customer service phone call.(4008400188) or email (kefu@idreamsky.com) contact us, we will reply to you within 15 working days.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can correct your account information under this channel through the account of the channel, or you can contact our customer service telephone (4008400188) or the email (Kefu@idreamsky.com) to contact us to correct personal information."}
{"task": "rw_98.jsonl", "id": 69793, "text": "7.3 You have the right to delete your personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69794, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) If our behavior of handling personal information violates laws and regulations; (2) If we collect and use your personal information, it has not obtained your consent.; (3) If our behavior of handling personal information violates your agreement; (4) If you no longer use our products or services, or you cancel the account; (5) If we no longer provide you with a product orServe."}
{"task": "rw_98.jsonl", "id": 69795, "text": "7.3.1 If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69796, "text": "7.3.2 If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69797, "text": "7.3.3 If our behavior of handling personal information is violated with your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69798, "text": "7.3.4 If you no longer use our products or services, or you cancel your account;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69799, "text": "7.3.5 If we no longer provide you with products or services", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69800, "text": "You can contact us to delete your personal information through our customer service telephone (4008400188) or email (kefu@idreamsky.com). If we decide to respond to your delete request, we will delete within 15 working days.At the same time, the entity that obtains your personal information is notified to delete it in time, unless the laws and regulations have other regulations, or these entities have obtained your independent authorization.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can contact us to delete our personal information through our customer service phone (4008400188) or email address (kefu@idreamsky.com). We will also notify the entities that we get your personal information to delete it.except."}
{"task": "rw_98.jsonl", "id": 69801, "text": "When you delete the information from our services, we may not back up the corresponding information in the system, but will delete these information when the backup is updated.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Delete the information you require delete in the backup update."}
{"task": "rw_98.jsonl", "id": 69802, "text": "7.4 You have the right to change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69803, "text": "We need some of your basic personal information to complete each business function you provided to complete. You can check the personal information permissions application and usage of our products in the \"Personal Information Permanent List\".", "label": ["Important", "Edit/Control"], "rewrite": "You can check the application and usage of personal information per personal information in the \"Personal Information Permanent List\"."}
{"task": "rw_98.jsonl", "id": 69804, "text": "If you want to withdraw your authorization consent, you can modify it in the device you use. The specific operation path is: setting -application -permissions management, or setting -privacy, or check personal information through privacy authority in our products, or check personal information through privacy permissions.The consent of the permissions application and usage and the use of permissions, the access path is set -privacy permissions management.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the authorization consent through \"setting -application -permissions management\", \"setting -privacy\", \"setting -privacy permission management\"."}
{"task": "rw_98.jsonl", "id": 69805, "text": "If you cannot change the scope of your authorization consent in the aforementioned method, you can also apply to us through our customer service phone (4008400188) or email (key)Request.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can submit an application for changing authorization through our customer service phone (4008400188) or email (kefu@idreamsky.com)."}
{"task": "rw_98.jsonl", "id": 69806, "text": "Please note that after your decision to recover the consent, it will not affect personal information processing based on your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_98.jsonl", "id": 69807, "text": "7.5 You have the right to cancel your user account", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69808, "text": "You can cancel the previously registered account at any time. You can submit a cancellation application to us on our product or service related feature setting page. We will cancel your account within 15 days.", "label": ["Edit/Control", "Important"], "rewrite": "You can submit an application for cancellation to us, and we will cancel your account within 15 days."}
{"task": "rw_98.jsonl", "id": 69809, "text": "The cancellation path in the official website package is: Settings -User Center -Account Logging or Settings -Account Logging.", "label": ["Important", "Edit/Control"], "rewrite": "The cancellation path is: setting -user center -account logout or setting -account cancellation."}
{"task": "rw_98.jsonl", "id": 69810, "text": "If you cannot cancel your account in the aforementioned method, you can also apply for us through our customer service phone (4008400188) or email (key) (Kefu@idreamsky.com).", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can submit an account cancellation application through our customer service phone (4008400188) or email (kefu@idreamsky.com)."}
{"task": "rw_98.jsonl", "id": 69811, "text": "After canceling the account, we will stop providing you with products or services and delete your personal information according to your requirements, except for other provisions of laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, it will stop providing products or services to you and delete your personal information."}
{"task": "rw_98.jsonl", "id": 69812, "text": "7.6 You have the right to apply for a copy of personal information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69813, "text": "If you need to get a copy of your personal information, you can apply to us through our customer service phone (4008400188) or email (Kefu@idreamsky.com), and we will reply to your application within 15 working days.", "label": ["Edit/Control", "Important"], "rewrite": "You can submit an application to obtain a copy of your personal information through our customer service phone (4008400188) or email (kefu@idreamsky.com)."}
{"task": "rw_98.jsonl", "id": 69814, "text": "7.7 Personal information transfer", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69815, "text": "If you need to transfer your personal information to the designated third party, you can apply to us through our customer service phone (4008400188) or email (kefu@idreamsky.com), we will reply to you within 15 working daysApplication.", "label": ["Important", "Contact Information", "Edit/Control"], "rewrite": "You can submit an application for transfer personal information through our customer service phone (4008400188) or email (kefu@idreamsky.com)."}
{"task": "rw_98.jsonl", "id": 69816, "text": "In the case of technical feasibility and conditions stipulated by the national network information department, we can transfer your personal information to your designated third party according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "In the case of technical feasibility and conditions stipulated by the national network information department, we can transfer your personal information to the designated third party."}
{"task": "rw_98.jsonl", "id": 69817, "text": "7.8 The constraints of automatic decision -making of the information system", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69818, "text": "If the information system we use makes a decision based on the automatic decision -making mechanism, and these decisions have a significant impact on your legitimate rights and interests, you have the right to pass our customer service phone (4008400188) or email (kefu@idreamsky.com,) to toward our customer service. We feedback or complain, we will manually review the automatic decision -making results or provide other appropriate relief methods.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "If the non -artificial automatic decisions we make affect your legitimate rights and interests, you have the right to feedback or complain, and we will review or provide relief."}
{"task": "rw_98.jsonl", "id": 69819, "text": "7.9 Response your request", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69820, "text": "You can make a request to our personal information through customer service calls (4008400188) or email (kefu@idreamsky.com), and we will respond within 15 working days.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can make a request related to personal information through customer service calls (4008400188) or email (kefu@idreamsky.com), and we will respond within 15 working days."}
{"task": "rw_98.jsonl", "id": 69821, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": ["Important", "Data Security"], "rewrite": "You may need to provide written personal information requests or prove your identity in other ways."}
{"task": "rw_98.jsonl", "id": 69822, "text": "We may ask you to verify your identity first, and then process your request.", "label": ["Important", "Data Security"], "rewrite": "We will verify your identity before processing your request."}
{"task": "rw_98.jsonl", "id": 69823, "text": "For your reasonable request, we do not charge fees in principle, but for requests that repeat and beyond the reasonable limit, please understand that we will charge a certain cost fee depending on the situation.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_98.jsonl", "id": 69824, "text": "Regarding the unprecedented repetition, too much technical means, bringing risks or unrealistic requests to the legitimate rights and interests of others, sorry we may refuse.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_98.jsonl", "id": 69825, "text": "7.10 Special circumstances", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69826, "text": "In accordance with the requirements of laws and regulations, I'm sorry that in the following situations, we will not be able to respond to your request:", "label": ["Edit/Control", "Important"], "rewrite": "In accordance with the requirements of laws and regulations, I'm sorry that in the following situations, we will not be able to respond to your request:"}
{"task": "rw_98.jsonl", "id": 69827, "text": "7.10.1, related to the obligations stipulated by the company's performance of laws and regulations;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is associated with the obligation stipulated in the company's fulfillment of laws and regulations, it may not be responded."}
{"task": "rw_98.jsonl", "id": 69828, "text": "7.10.2, directly related to national security and national defense security;", "label": ["Edit/Control", "Important"], "rewrite": "If your request is directly related to national security and national defense security, you may not be responded."}
{"task": "rw_98.jsonl", "id": 69829, "text": "7.10.3, directly related to public safety, public health, and major public interests;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to public safety, public health, and major public interests and may not be responded."}
{"task": "rw_98.jsonl", "id": 69830, "text": "7.10.4, directly related to criminal investigation, prosecution, trial, and execution of judgment;", "label": ["Important", "Edit/Control"], "rewrite": "Your request is directly related to criminal investigation, prosecution, trial and judgment execution, and may not be responded."}
{"task": "rw_98.jsonl", "id": 69831, "text": "7.10.5, there is sufficient evidence that you have subjective malicious or abuse of rights;", "label": ["Important", "Edit/Control"], "rewrite": "Personal information controller has sufficient evidence to indicate that the subject of personal information has subjective malicious or abuse of rights, and may not be able to respond to personal requests."}
{"task": "rw_98.jsonl", "id": 69832, "text": "7.10.6, because of maintaining major legitimate rights and interests such as life and property of you or other individuals, it is difficult to get your consent;", "label": ["Important", "Edit/Control"], "rewrite": "Out of the major legitimate rights and interests of the life and property of personal information subjects or other individuals, but it is difficult to get my consent, we may not be able to respond to the request."}
{"task": "rw_98.jsonl", "id": 69833, "text": "7.10.7, responding to your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Edit/Control"], "rewrite": "We may not be able to respond to the request that the legitimate rights and interests of you or other individuals and organizations are seriously damaged."}
{"task": "rw_98.jsonl", "id": 69834, "text": "7.10.8, involved business secrets.", "label": ["Edit/Control", "Important"], "rewrite": "We may not be able to respond to personal information requests involving business secrets."}
{"task": "rw_98.jsonl", "id": 69835, "text": "8. Tips on the service of minors", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69836, "text": "The company attaches great importance to the protection of personal information of minors. Under 18 years of age, minors under the age of 18 are not allowed to use our services without the consent of the legal guardian.", "label": ["Specific Audiences", "Important"], "rewrite": "Under 18 years of age, minors must obtain the consent of legal guardians."}
{"task": "rw_98.jsonl", "id": 69837, "text": "If you are a legal guardian under the age of 18, you should supervise and control the behavior of the minor to use our service, and the minor to create an account should be agreed by your premise.", "label": ["Specific Audiences", "Important"], "rewrite": "The legal guardian is requested to pay attention to whether the guardian is used after obtaining your authorization consent and supervise and control its use of their behaviors."}
{"task": "rw_98.jsonl", "id": 69838, "text": "If you are the legal guardian of minors under the age of 14 (inclusive), please visit the \"Personal Information Protection Policy of Children Children Children\".", "label": ["Specific Audiences", "Important"], "rewrite": "If you are the legal guardian of minors under the age of 14 (inclusive), please visit the \"Personal Information Protection Policy of Children Children Children\"."}
{"task": "rw_98.jsonl", "id": 69839, "text": "8.1, for the case of collecting minors with the consent of the legal guardian, we will only use or disclose this information if they are allowed to be allowed to be allowed to be allowed to be allowed to be used by law, the legal guardian clearly agrees or protects the necessary minors.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "We will only use or publicly disclose the information collected by the law that are permitted by law and the legal guardians clearly consent or protect the minors."}
{"task": "rw_98.jsonl", "id": 69840, "text": "8.2, if the minor uses our service without the consent of the legal guardian, the legal guardian of the minor has the right to contact us and ask us to delete the personal information of the minor, and we will delete immediately after verification.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If minors use services without the consent of the legal guardian, we will immediately delete the personal information of the minor after verification."}
{"task": "rw_98.jsonl", "id": 69841, "text": "8.3, if we find that the company collects personal information of minors without the consent of the company that can be confirmed in advance, it will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the legal guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_98.jsonl", "id": 69842, "text": "9. Scope, changes and exceptions to the scope of application of privacy policies", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69843, "text": "9.1 Scope of application", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69844, "text": "This policy is applicable to the network service provided by the company. When you use any single service provided by us, if the single service has a specific privacy policy, we will be in the corresponding privacy policy (\"specific policy\" in this single service (\"specific policy\") It also specifically explains how we use your personal information in these services. This specific policy constituted a part of the policy and has the effect with this policy at the same time.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69845, "text": "If the specific policy is inconsistent with the inconsistency of similar clauses in this policy, the specific policy is subject to specific policies within the scope of this specific policy constraint.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69846, "text": "Our products may include links to third parties to help you access third -party services or websites.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69847, "text": "We please pay special attention to these third -party services provided by related third -party operators. To protect your legitimate rights and interests, please read the guidance of related third -party privacy policies.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69848, "text": "9.2 Change of this policy", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69849, "text": "We may revise this policy based on the adjustment of the company's business or related policies. In order to protect your user's right to know the right, we will prompt you to read through an internal pop -up window before the revision of this policy, and re -obtain your authorization.agree.", "label": ["Policy Change", "Important"], "rewrite": "We will prompt you to read through the application of the internal pop -up window before the revision of this policy and re -obtain your authorization consent."}
{"task": "rw_98.jsonl", "id": 69850, "text": "For major changes, we will also provide a more significant notice. The major changes referred to this policy include, but not limited to:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69851, "text": "9.2.1 When our service model has changed significantly, such as the purpose of handling personal information, the type of personal information processing, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69852, "text": "9.2.2 When we have changed significantly in the aspects of ownership structure and organizational structure, such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69853, "text": "9.2.3 When the main objects of our personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69854, "text": "9.2.4 When you participate in the right of personal information processing and its exercise methods, major changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69855, "text": "9.2.5 When we are responsible for handling the responsible departments, contact methods and complaint channels of personal information security;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69856, "text": "9.2.6 When our personal information security impact assessment report shows high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69857, "text": "10. Contact information", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69858, "text": "If you have any questions, opinions or suggestions on this policy, you can contact us in the following ways.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69859, "text": "If you have any complaints or complaints on our personal information processing behavior, you can also contact us through the following ways, and we will reply to the handling opinions or results within 15 working days.", "label": ["Important", "Contact Information"], "rewrite": "You can contact us through the following ways, and we will reply within 15 working days."}
{"task": "rw_98.jsonl", "id": 69860, "text": "Company Name: Shenzhen Chuangmengtiandi Technology Co., Ltd.", "label": ["Important", "Contact Information"], "rewrite": "Company Name: Shenzhen Chuangmengtiandi Technology Co., Ltd."}
{"task": "rw_98.jsonl", "id": 69861, "text": "Customer Service Tel: 4008400188", "label": ["Important", "Contact Information"], "rewrite": "Customer Service Tel: 4008400188"}
{"task": "rw_98.jsonl", "id": 69862, "text": "Email address: kefu@idreamsky.com", "label": ["Important", "Contact Information"], "rewrite": "Email address: kefu@idreamsky.com"}
{"task": "rw_98.jsonl", "id": 69863, "text": "Registration address: 16th floor of the A3 unit A3 unit of Kexing Science Park, Keyuan North Road, Nanshan District, Shenzhen", "label": ["Important", "Contact Information"], "rewrite": "Registration address: 16th floor of the A3 unit A3 unit of Kexing Science Park, Keyuan North Road, Nanshan District, Shenzhen"}
{"task": "rw_98.jsonl", "id": 69864, "text": "Postcode: 518057", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 518057"}
{"task": "rw_98.jsonl", "id": 69865, "text": "In order to better protect your personal information, the company set up the person in charge of personal information protection to docking your personal information protection work.", "label": ["Important", "Contact Information"], "rewrite": "The company set up the person in charge of personal information protection to docking your personal information protection work."}
{"task": "rw_98.jsonl", "id": 69866, "text": "The specific contact is: Wang Lina, contact number: 0755-86685111, contact the mailbox: lily.wang@idreamsky.com", "label": ["Important", "Contact Information"], "rewrite": "The specific contact is: Wang Lina, contact number: 0755-86685111, contact the mailbox: lily.wang@idreamsky.com"}
{"task": "rw_98.jsonl", "id": 69867, "text": "If you and us have disputed and disputes on personal information processing behavior and cannot be resolved, you can filed a lawsuit with the Shenzhen Nanshan District People's Court. The court phone: 0755-86608312.", "label": [], "rewrite": []}
{"task": "rw_98.jsonl", "id": 69868, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
