{"task": "rw_90.jsonl", "id": 67466, "text": "Personal information protection guidelines", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67467, "text": "Version 4.0", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67468, "text": "Update date: October 29, 2021", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67469, "text": "Effective date: November 1, 2021", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67470, "text": "Zhihu products and/or services are Beijing Wise World Technology Co., Ltd. (Registration Address: No. 5, Building 5, Line A, Haidian District, BeijingNo. 1 three-story 1#plant 3-010) and Wise Sei (Beijing) Technology Co., Ltd. (Registration Address: No. 5, Building 1, No. 5, No. 5, No. 5, 1#Factory 3-011;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67471, "text": "Contact address: Koujia, 5, No. 1, Building three floors, 1#factory, 3-011), which are jointly handled by Beijing Haixian District College, provided them together (hereinafter referred to as \"Zhihu\" or \"We\").", "label": ["Important", "Contact Information"], "rewrite": "Contact address: 3-011, Building 1, Building 5, No. 5, Line A, Haidian District, Beijing, 3-011."}
{"task": "rw_90.jsonl", "id": 67472, "text": "We are users (hereinafter referred to as \"you\") through Zhihu app, Zhihu website (https://www.zhihu.com), applet, and other programs, software, clients or clients or clients or we may still provide from time to time.Other similar products (hereinafter collectively referred to as \"this platform\") provide products and services in the online network community (including content products and/or related services organized by Q & A products or other forms), in order to \"let people better share knowledge, experience and experience, andOpinions, find your own answers \"as the mission, aiming to provide users with trusted content through community products in the form of sustainable development, independent operations, and obtaining healthy growth.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67473, "text": "In accordance with the laws and regulations such as the \"People's Republic of China Network Security Law\", \"Personal Information Protection Law of the People's Republic of China\", \"Data Security Law of the People's Republic of China\", \"Common types of mobile Internet applications, the requirements for personal information scope\" and other laws and regulations, and refer to the \"Information Security Technology TechnologyStandards such as personal information security regulations \"(GB/T 35273-2020) and other national standards, formulate the\" Personal Information Protection Guidelines \"(hereinafter referred to as\" this guidelines \") and are committed to protecting your personal information security.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67474, "text": "Please read and fully understand the guidance before using this platform.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67475, "text": "We have adopted a thick body mark on the key content, I hope you pay special attention.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67476, "text": "If you have any questions about this guideline, you can contact us through the contact information provided by \"How to contact us\" through the 9th section of this guideline.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67477, "text": "We will revise the guidelines from time to time.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67478, "text": "When a substantial change occurs in accordance with the eighth section of this guideline, we will show you the contents of the change after the version is updated with pushing notifications, pop -ups, system notifications, and private messages in the station.", "label": ["Policy Change", "Important"], "rewrite": "When a substantial change occurs, after the version is updated, it will show you the content of the change after push notification, pop -up window, system notification, private message in the station."}
{"task": "rw_90.jsonl", "id": 67479, "text": "Table of contents:", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67480, "text": "How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67481, "text": "We will collect and use your personal information in the following business scenarios:", "label": ["Important", "First Party Collection Information"], "rewrite": "It will collect and use your personal information in the following business scenarios:"}
{"task": "rw_90.jsonl", "id": 67482, "text": "Know the system permissions called by APP", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67483, "text": "Except for other legitimacy reasons that agree", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67484, "text": "How can we entrust your personal information to deal with, share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67485, "text": "Entrust your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67486, "text": "Share your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67487, "text": "Transfer your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67488, "text": "Publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67489, "text": "How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67490, "text": "Technical measures and data security measures", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67491, "text": "safety certificate", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67492, "text": "Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67493, "text": "How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67494, "text": "Manage account number, content and related records", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67495, "text": "Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67496, "text": "Get your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67497, "text": "Withdrawal of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67498, "text": "Logging out Zhihu account", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67499, "text": "Limit processing your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67500, "text": "Respond to your above request", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67501, "text": "How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67502, "text": "How do we use cookie and other technologies", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67503, "text": "How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67504, "text": "How do we update and modify this guideline", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67505, "text": "How do you contact us", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67506, "text": "Dispute Resolution", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67507, "text": "Concept and definition", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67508, "text": "How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67509, "text": "We will follow the principles of legitimacy, lawfulness, and necessity to collect and use personal information that you voluntarily provide during the use of services or generated by using Zhihu products and/or services for the following purposes described in this guideline.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "It will follow the principles of legitimacy, legal, and necessary, and collect and use personal information that you actively provide or due to the use of product services."}
{"task": "rw_90.jsonl", "id": 67510, "text": "If we want to use your personal information for other purposes that are not stated in this guideline, or use the collected information for other purposes based on specific purposes, we will inform you in a reasonable way and obtain you againagree.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you use personal information for other purposes that are not stated in this guideline, or use information for other purposes based on specific purposes, you will inform you in a reasonable way and obtain your consent again."}
{"task": "rw_90.jsonl", "id": 67511, "text": "If you have questions about the concepts in the following content, please refer to the definition and explanation of Article 11.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67512, "text": "When you use Zhihu products and/or services, we need/may need to collect and use your personal information in the following two cases: to provide you with basic business functions that provide you with basic business functions (belongPart of business functions), you must authorize the necessary information we collect and use.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67513, "text": "If you refuse to provide the corresponding information, you will not be able to use the most basic functions of the product and/or service of the corresponding knowledge, that is, participating in the most basic activities of the Q & A community, including questioning and answeringEssence", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67514, "text": "When you use Zhihu products and/or services, we need/may need to collect and use your personal information in the following two cases: in addition to providing relatively basic business functions, we have been working hard to provide richer ZhihuProducts and/services to expand, improve and strengthen your experience;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67515, "text": "Such business functions need to collect and use corresponding necessary personal information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67516, "text": "If you refuse to provide it, you will not be able to use the business functions of these extended experiences or the best extension effect effects and experience we are going to achieve, but it will not affect your normal use of Zhihu products and/or service basic business functionsEssence", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67517, "text": "If you refuse to collect any personal information of your personal information, Zhihu will not be able to provide you with any features including the platform including basic business functions.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67518, "text": "In this case, Zhihu provides you with a \"only browse\" mode, aiming to help you get the preliminary experience of this platform before deciding to accept this guide, that is, some content browsingProvide the content of their necessary personal information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67519, "text": "Note that you note that because the personal information required for different products or services is different, we will also solicit your consent through page prompts and interactive processes before you use specific products and/or services.The protocols or rules you agree with the specific products and/or services you agree are subject to.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will solicit your consent through page prompts and interactive processes before you use specific products and/or services. The scope of personal information is subject to the specific products and/or services of your consent."}
{"task": "rw_90.jsonl", "id": 67520, "text": "Since the products and/or services we provide to you are constantly updated, if a certain product or service is not explained in the aforementioned content and collected your information, we will use page prompts, interactive processes, website announcements, etc.You explain the content of the information collection to obtain your alone consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a certain product or service does not explain in the aforementioned content and collects your information, it will explain the content of the information collection to you to obtain your separate consent."}
{"task": "rw_90.jsonl", "id": 67521, "text": "This description is part of the guidance of the composition, and the information applies to the agreement of this guideline.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67522, "text": "We will collect and use your personal information in the following business scenarios:", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67523, "text": "Account registration, login, account binding and security", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67524, "text": "When you register and log in to Zhihu account, we need to provide you with valid Chinese mobile phone numbers in accordance with the relevant laws and regulations of the real -name system.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67525, "text": "Please note that you provide us with your mobile phone number to us in mainland China. We provide you with the personal information necessary to provide you with basic business functions. If you refuse to provide it, we cannot provide you with basic business functions. You will only use \"Browse only \"mode.", "label": ["Important", "First Party Collection Information"], "rewrite": "Mainland China ’s mobile phone number is a personal information necessary for basic business functions. If it refuses to provide it, we cannot provide you with basic business functions. You will only use the“ browse ”mode."}
{"task": "rw_90.jsonl", "id": 67526, "text": "You can also register and log in to log in by mailboxes and overseas mobile phone numbers, but in the legal scenario after you log in successfully, we will ask you to further provide mainland mobile phone numbers to meet the relevant regulations of the real -name system.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67527, "text": "When you log in to Zhihu with a third -party account (including WeChat, QQ, Weibo, Apple ID), you need to authorize to read and share your announcement on the third -party platform on the premise of compliance with relevant laws and regulations.The public information of the record (including one or more in the nickname, avatar, area, gender, contact mailbox) in order to bind your third -party account with Zhihu account, and remember that you log in as a knowledgeable user loginidentity.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67528, "text": "When you need to modify the account password, please enter the new password to complete the reset.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67529, "text": "When you need to modify the mobile phone number, please enter the new mobile phone number and SMS verification code.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67530, "text": "You can voluntarily bind your mailbox on the setting page. At this time, you need to provide your mailbox account and the SMS verification code we sent to you for verification operation.", "label": ["Important", "First Party Collection Information"], "rewrite": "To set the page to bind the mailbox, you need to collect the mailbox account and the SMS verification code for verification operation."}
{"task": "rw_90.jsonl", "id": 67531, "text": "If you need to set up a trust device, you need to provide us with the device name, equipment type, and final use time you are using.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to set up a trust device, you need to provide the device name, equipment type, and final use time you are using."}
{"task": "rw_90.jsonl", "id": 67532, "text": "When you open Zhihu institutional number, you need to provide us with your mailbox address and login password.", "label": ["Important", "First Party Collection Information"], "rewrite": "When opening Zhihu's institutional number, you need to provide us with your mailbox address and login password."}
{"task": "rw_90.jsonl", "id": 67533, "text": "When your account cannot be used, you can retrieve it through an account appeal.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67534, "text": "At this time, you can choose to provide your account number binding mobile phone number, mailbox, password, registration time, common access city, mobile phone login commonly used equipment, PC, Duanjun commonly used browser, Zhihu consumer record, once used once, used to use it, once usedName, once introduced in one sentence or any of the personal profile, so that we can verify your identity.", "label": ["Important", "First Party Collection Information"], "rewrite": "Introduction or any brief introduction to do one of them so that we can verify your identity."}
{"task": "rw_90.jsonl", "id": 67535, "text": "Please know that you can choose to fill in one or more in the aforementioned information by yourself, but the information you provide must be enough to determine that you have the right to use the account.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67536, "text": "Topic discussion, information sharing and attention interaction", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67537, "text": "When you register as a user and log in to this platform, you can use basic business functions on this platform, including (1) reading, browsing other users or published \"Questions and answers, videos, columns, articles, courses, courses published, Books, Live \"and other content;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67538, "text": "(2) Release \"Questions, answers, articles, columns, ideas, videos\" and other content;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67539, "text": "(3) Interact with other users, including editing questions from other users, invite other users to answer questions, send private messages to other users, and evaluate the content published by other users (including agreeing, opposing, liked, collecting and reviewing), subscribing subscriptions, subscriptionsQuestions and follow other users.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67540, "text": "In order to ensure the security, stability, and the sustainability and healthy growth of the service of service, we will collect the network log information generated during this process, and retain the content you posted (including pictures, text, audio and video information).Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect online log information and keep the content you posted (including pictures, text, audio and video information)."}
{"task": "rw_90.jsonl", "id": 67541, "text": "When you read and browse the content of the platform through the knowledge of the applet (including the WeChat platform applet, Baidu platform applet, etc.) or other programs, software, clients, etc., other programs, software, clients, etc., because of different product functions, specific functions, etc.If you can only read and browse some content. If you need to continue reading and browse the remaining content, you need to copy the specified password displayed on the page and open the Zhihu APP, and continue your reading and browsing in Zhihu APP.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67542, "text": "To achieve this function, we need to access your shear plate and read the password contained in it.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We need to visit your shear board and read the password contained in it."}
{"task": "rw_90.jsonl", "id": 67543, "text": "In the case you share or receive the content, short chain, etc., we may need to access your shear board and read the passwords, sharing code, and links contained in it to achieve automatic jump, password jump, sharing, etc.Function or service.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "It may be necessary to access your shear plate and read the passwords, sharing code, and links contained in it to achieve automatic jumping, password jump, sharing and other functions or services."}
{"task": "rw_90.jsonl", "id": 67544, "text": "To facilitate the users and content you have paid attention to, we will summarize your attention records and show you on the \"My\" homepage.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67545, "text": "At the same time, we provide the function of viewing the communication recording friends. To turn on this function, you need to agree with us to use mobile phone communication records so that you can see if your communication record friend knows if it is known to users, but at the same time, it also meansOthers can also find your Zhihu account from its address book.", "label": ["Permission Acquisition", "Important"], "rewrite": "To start viewing the function of the communication records, you need to agree with us to use mobile phone communication records separately."}
{"task": "rw_90.jsonl", "id": 67546, "text": "In addition, when you answer questions, if you choose to upload the files in the Baidu network disk, after your separate authorization, we will also read and write your data on the Baidu network disk.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After your separate authorization, we will also read and write your data on the Baidu network disk."}
{"task": "rw_90.jsonl", "id": 67547, "text": "When you post content with location information, we will obtain the location information of the device after the device positioning permissions will be enabled after receiving your separate consent.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "After obtaining your separate consent, you will obtain the location information of the device after opening the device positioning permissions."}
{"task": "rw_90.jsonl", "id": 67548, "text": "When you need to upload pictures, we will obtain your album permissions or camera permissions after obtaining your separate consent.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get your album permissions or camera permissions after obtaining your separate consent for uploading pictures."}
{"task": "rw_90.jsonl", "id": 67549, "text": "When you use Zhihu's video creation tools to recording and publishing dubbing content, Zhihu provides you with a \"sound recovery\" service.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67550, "text": "If you need to use the service, you need to authorize and turn on, microphone rights.", "label": ["Permission Acquisition", "Important"], "rewrite": "Make authorization and turn on microphone rights for sound re -engraving services."}
{"task": "rw_90.jsonl", "id": 67551, "text": "After getting your individual consent, we will collect and analyze a very small amount of audio recorded and uploaded by you, and generate virtual sounds exclusive to you and only by your personal use.", "label": ["Important", "First Party Collection Information"], "rewrite": "After getting your individual consent, we will collect and analyze a very small amount of audio you record and upload."}
{"task": "rw_90.jsonl", "id": 67552, "text": "You can use the virtual sound to automatically add dubbing to the content released by you.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67553, "text": "In order to ensure that you can realize interaction, communication, and information sharing, we will invite you to sign, cooperate, publish content, participate in creation or knowledge in various forms, participate in creation or conduct knowledge through the mobile phone number you provided by you.Share, authorized and authorized activities of property rights and other rights;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67554, "text": "Invite you to participate in investigations, customer surveys, and after -sales return visits;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67555, "text": "Introduce and explain the products and services of Zhihu.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67556, "text": "If you don't want us to contact you, you can refuse or withdraw the aforementioned information sent by or the operator in accordance with the method of this guideline.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67557, "text": "Account public information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67558, "text": "Homepage", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67559, "text": "To show your personal image and recommend content to you, you can select and edit your basic information, including gender, birthday, address, personal profile, personal occupation, work experience, education experience.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67560, "text": "You can also choose to certify. For details, please check the functional description of \"identity certification\" below.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67561, "text": "In addition, in order to enrich your basic information, you can also set account nicknames. Your nickname can be replaced with other users. Zhihu will set and record system recognition marks exclusive to this account so that the system and other users can accurately distinguish.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67562, "text": "You can choose whether to set an avatar, but not to set the avatar does not affect your use.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67563, "text": "When you set the avatar, you can choose to use the avatar of your binding third -party account, or upload the avatar or use the photos in your device as the avatar.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67564, "text": "If you choose to take a picture and upload your head, we will apply for your camera permissions;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply for your camera permissions for taking pictures upload your avatars."}
{"task": "rw_90.jsonl", "id": 67565, "text": "If you choose to use the photos in your device as the avatar, we will apply for your photo/album permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you choose to use the photos in the device as the avatar, you will apply for your photo/album permissions."}
{"task": "rw_90.jsonl", "id": 67566, "text": "Blessings of birthday: Knowing that you always attach importance to the humanistic care of users and expect surprises to give users a sense of rituals in various ways.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67567, "text": "If you fill in your birthday information on your personal homepage, we may send you birthday wishes and birthday exclusive benefits to you on the day of the date you filled in.Essence", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67568, "text": "Published, interactive account dynamics", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67569, "text": "Thoughts, articles, columns, video collections, live, lectures, etc.), your approval content, your attention content (including the column, topic, problem, collection clip, etc.), your collection content, the goods in your product window(If yes), and other dynamics of your account (such as participating in the salt selection column, borrowing e -book, etc.), it will be displayed publicly on your personal homepage of your account.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your attention and attention list, the number and list of attention, your praise, your favorite number, the number of collections, the number of professional recognition, the content you publish, your agreeing content, your content, your content, your content, your contentPay attention to content, your collection content, the products (if.) And other developments of your account will be displayed publicly in your personal homepage of your account."}
{"task": "rw_90.jsonl", "id": 67570, "text": "If other users pay attention to you or you are concerned about other users, when the account is concerned about new dynamics, the follower will see the dynamic details on a specific page or a specific location (such as the \"dynamic\" channel).", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67571, "text": "If you don't want some users to pay attention to you or interact with you, you can choose to add the user to the blacklist.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67572, "text": "Please know that users who are added to the blacklist can only interact with you, but you can still view your public information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67573, "text": "Identity authentication (personal certification)", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67574, "text": "Zhihu's services to provide authentication personal identity information currently include academic certification, vocational certification, public figure certification, and outside station creator certification.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67575, "text": "When you apply for identity authentication for you, after you agree, you need to provide us with a name, ID number, or other documents, and information about identity certificates.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you agree, you need to provide us with information, ID number or other documents, and information about identity certificates for identity authentication."}
{"task": "rw_90.jsonl", "id": 67576, "text": "Specifically:", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67577, "text": "If you choose to perform your degree certification, you also need to fill in your degree, degree, and education experience (including the full name of the school, professionalism, and uploading certification materials).", "label": ["Important", "First Party Collection Information"], "rewrite": "If you choose to perform your degree certification, you also need to fill in your degree, degree, and education experience (including the full name of the school, professionalism, and uploading certification materials)."}
{"task": "rw_90.jsonl", "id": 67578, "text": "If you choose to conduct occupational certification, you also need to fill in your industry, occupation, work unit, position, work experience, and upload work certification materials (including paper business cards/work cards/job certificates).", "label": ["Important", "First Party Collection Information"], "rewrite": "Occupation certification needs to fill in your industry, occupation, work unit, position, and work experience, and upload work certification materials (including paper business cards/business cards/job certificates)."}
{"task": "rw_90.jsonl", "id": 67579, "text": "If you choose public figure certification, you also need to fill in social identity, awarded award, won honor, and your identity certificate on other platforms.", "label": ["Important", "First Party Collection Information"], "rewrite": "Public figure certification needs to fill in social identity, awarded award, honored honor, and your identity certificate on other platforms."}
{"task": "rw_90.jsonl", "id": 67580, "text": "If you choose to certify other website creators, you need to authorize us to share your account link or ID from third -party platforms (including WeChat, Bilibili, Douyin, Kuaishou) on the third -party platform.", "label": ["Third Party Sharing/ Disclosure", "Permission Acquisition", "Important"], "rewrite": "Other website creators certification, you need to authorize us to share your account link or ID on your third -party platform from a third -party platform."}
{"task": "rw_90.jsonl", "id": 67581, "text": "If you apply for a service related to identity authentication, please read and confirm the \"Summary of Frequently Asked Issues of Knowing Personal Certification\" published by Zhihu for the service.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67582, "text": "Personalized display/recommendation", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67583, "text": "When you use Zhihu, app, to help us know how to access and use our products and/or services, maintain our products and/or services, maintain knowledge, APP, the most basic business operation orTo make other aspects of response, we may collect and use our products and/or services when using our products and/or services.ID).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect and use your IP address, software use records, and device information."}
{"task": "rw_90.jsonl", "id": 67584, "text": "Please understand that you can use the corresponding business functions after you agree with us to collect the above information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67585, "text": "In order to realize the content or advertisement that shows or recommended to you or recommended (rather than generally pushed), we will collect your browsing and use records, equipment information (device model, MAC, address, operating system, network environment, equipment positioning information information, Equipment's network operators, equipment, ID, IMEI), IP), IP, address, OAID, log information, location information (we will collect precise positioning information of the device when you open the device's position permissions).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your browsing records, device information (device model, MAC address, operating system, network environment, equipment positioning information, network operators, device ID, IMEI), IP address, OAID, log information, location information."}
{"task": "rw_90.jsonl", "id": 67586, "text": "Please note that the aforementioned separate information is information that cannot identify a specific natural person.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67587, "text": "If we can identify this kind of information with other information to identify specific natural persons after use, during the combination of use, this kind of information will be regarded as personal information. In addition to obtaining other provisions of your authorization or laws and regulations, we willAnonymous and de -identification processing of this kind of information.", "label": ["Important", "Data Security"], "rewrite": "Those who can identify specific natural persons after the combination of such information with other information can be regarded as personal information during the combination of use. Except for obtaining your authorization or laws and regulations, we will use this type ofInformation is anonymous and de -identified."}
{"task": "rw_90.jsonl", "id": 67588, "text": "Online shopping and payment functions", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67589, "text": "When you recharge or pay consumption during the use of Zhihu products and/or services (including Zhihu Coin recharge or payment), we will collect your transaction and consumption records (including transaction content, transaction status, payment method, transaction, transaction, transaction, transactionTime, amount, transaction order number), and flow records in order to check and check your recharge and consumption situation.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your transactions and consumption records, and running records in order to check with you to check your recharge and consumption."}
{"task": "rw_90.jsonl", "id": 67590, "text": "If you open your fingerprint or face recognition payment, when you pay, you need to use fingerprints or face information for payment verification.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67591, "text": "Please know that the function of fingerprint or face recognition payment is provided by a third party, knowing that it will not collect and store your information.", "label": ["Important", "First Party Collection Information"], "rewrite": "The function of fingerprints or face recognition payment is provided by third parties, knowing that it will not collect and store your type of information."}
{"task": "rw_90.jsonl", "id": 67592, "text": "When you need to bind the bank card to withdraw the balance in the wallet, you also need to provide your name, bank card number, ID number, and bank's mobile phone number and verification code reserved to ensure the security and security and of your accountPerform relevant regulations for anti -money laundering in the country.", "label": ["Important", "First Party Collection Information"], "rewrite": "Provide your name, bank card number, ID number, and bank's mobile phone number and verification code reserved for binding bank cards for withdrawal."}
{"task": "rw_90.jsonl", "id": 67593, "text": "In order to ensure that your transaction is safe, you can modify your mobile phone number, set/modify the payment password. At this time, you need to provide your mobile phone number that you have already binded, the verification code we sent to youYou modify the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your mobile phone number, verification code and new payment passwords that have been bound to modify information."}
{"task": "rw_90.jsonl", "id": 67594, "text": "When you buy self -employed or third -party platform products in Zhihu, you need to provide us with recipients, names, mobile phone numbers, and receiving addresses to send products for you.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the names of the recipient, mobile phone number, and receiving address for you to send products."}
{"task": "rw_90.jsonl", "id": 67595, "text": "If you buy or receive a public course and enter the course study, after your separate authorization, we will retrieve your calendar authority and collect your schedule information in order to remind you of the course situation.", "label": ["Permission Acquisition", "Important"], "rewrite": "With your separate authorization, you will retrieve your calendar authority and collect schedule information in order to remind you of the course."}
{"task": "rw_90.jsonl", "id": 67596, "text": "We will also collect your learning records in order to verify your learning situation and make it easier for you to continue learning.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your learning records in order to verify your learning."}
{"task": "rw_90.jsonl", "id": 67597, "text": "customer service", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67598, "text": "When you lift a complaint, appeal, or conduct consultation with Zhihu, in order to contact you or help you solve the problem, we may need you to provide your name, mobile phone number and/or e -mail and other contact information, and you may use this information and other contact informationYou get in touch.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your name, mobile phone number and/or email and other contact information."}
{"task": "rw_90.jsonl", "id": 67599, "text": "We may also use the mobile phone number you provided when you register.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67600, "text": "If you submit an infringement complaint, Zhihu will also require you to submit your ID card, authorize entrustment, and ownership certificate in accordance with the law, to clarify your qualifications as the subject of the complaint and determine whether your complaint is established.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your ID card, authorized commission, and ownership certificate to clarify your qualifications as the subject of the complaint."}
{"task": "rw_90.jsonl", "id": 67601, "text": "If your aforementioned information is required to submit your aforementioned information to the court or other regulatory agencies or judicial departments, we will provide it in accordance with the law.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67602, "text": "You do not provide the above information, our customer service will not be able to provide you with the aforementioned service, but it does not affect the other services you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67603, "text": "When you are the complaint or the dispute -related party, in order to verify the content you posted in the Zhihu station and clarify whether the content affects and damages the rights or other people's rights, we may also use the mobile phone number you provided when registering.contact you.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67604, "text": "Search function", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67605, "text": "When you use the search function provided by Zhihu, we will collect and store the keywords you inquire about and the click situation of your search results.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and store the keywords you query and your click on the search results."}
{"task": "rw_90.jsonl", "id": 67606, "text": "These keyword information usually cannot identify your personal identity alone, not your personal information, and not within the scope of the specifications of this guideline.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67607, "text": "Only when the keyword information you searched is connected with your other information and can recognize your personal identity, during the combination of use, we will use your search keyword information as your personal information, according to this guideline, right?It is treated and protected.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "When the keyword information you searched is connected to your other information and can identify your personal identity, during the combination of use, you will use the search keyword information as personal information, and process it according to this guideline."}
{"task": "rw_90.jsonl", "id": 67608, "text": "Live broadcast function", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67609, "text": "If you apply for a live broadcast function, after you agree, we need you to submit your name and ID number for real -name authentication, and you also need to pass the face recognition to determine your qualifications to be engaged in live broadcast business. Please know, we don’t know, we don’tWill collect and store your facial recognition feature information.", "label": ["Important", "First Party Collection Information"], "rewrite": "After you agree, we need you to submit your name and ID number for real -name authentication."}
{"task": "rw_90.jsonl", "id": 67610, "text": "When you live as an anchor, we will collect and store your live broadcast content in accordance with laws and regulations, including your portrait and other identity information you disclosed during the live broadcast.", "label": ["Data Retention", "Important"], "rewrite": "We will collect and store your live content in accordance with laws and regulations, including your portrait and other identity information you disclosed during the live broadcast."}
{"task": "rw_90.jsonl", "id": 67611, "text": "In view of the particularity of the live broadcast function, once you open the live broadcast function, your live broadcast content in the live broadcast will be made public. Please be careful to disclose your personal information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67612, "text": "When you interact with the anchor voice as an audience, we will recognize your sound pattern, but we will not store such information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you interact with the anchor voice with the anchor voice, we will recognize your sound pattern, but we will not store such information."}
{"task": "rw_90.jsonl", "id": 67613, "text": "Please pay attention and understand that only after you become an anchor, the video can be turned on.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67614, "text": "When you give a gift to the anchor or you receive a gift from other users as an anchor, for normal settlement, we will collect transaction records (including transaction content, transaction status, payment method of transaction content, transaction status, payment method for your purchase and consumption virtual currency (live salt particle)., Amount, transaction time, transaction number number).", "label": ["Important", "First Party Collection Information"], "rewrite": "In order to carry out normal settlement, we will collect trading records (including transaction content, transaction status, payment method, amount, transaction time, transaction order number) of your purchase and consumer virtual currency (live salt particle)."}
{"task": "rw_90.jsonl", "id": 67615, "text": "Fault report", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67616, "text": "When a system failure or other issues that affect your normal use of this platform, you can inform Zhihu's system failure by \"shaking\" or contacting the \"Zhihu Small Butler\" method.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67617, "text": "We will collect your device model, IP, address, operator name, network type, software version, log information, fault description, and the pictures, page screenshots or other materials you uploaded to analyze and deal with system problems.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your device model, IP address, operator name, network type, software version, log information, fault description, and pictures, page screenshots or other materials uploaded to analyze and deal with system problems."}
{"task": "rw_90.jsonl", "id": 67618, "text": "Assessment", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67619, "text": "In order to understand the user's needs and improve the user experience, we will invite you to participate in the questionnaire survey so that we can provide you with better service quality. We may collect the personal information contained in your feedback content in the questionnaire in the questionnaire according to the actual situation.", "label": ["Important", "First Party Collection Information"], "rewrite": "You will invite you to participate in the questionnaire survey, and we may collect personal information in the questionnaire according to the actual situation."}
{"task": "rw_90.jsonl", "id": 67620, "text": "Because each questionnaire requires different contents of your reply, we will obtain your authorization consent again before sending the questionnaire to you.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67621, "text": "In order to improve the user experience, we may also initiate product evaluation. If you take the initiative to participate in the evaluation, we will collect your recipients, names, mobile phone numbers, and receiving addresses to send you products participating in the evaluation.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your recipient's name, mobile phone number, and delivery address in order to send you products participating in the evaluation."}
{"task": "rw_90.jsonl", "id": 67622, "text": "We will obtain your authorization consent again before launching a product evaluation.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67623, "text": "Guarantee service stability and safety", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67624, "text": "In order to ensure the stability and security of the service, we will collect your hardware model, operating system version number, device name, equipment configuration, international mobile device identification code, unique device identifier, network device hardware address, IP, address, WLAN, WLAN, wlan, Access points, Bluetooth, base station, software version number, network access method, type, status, network quality data, operation, use, service log.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will collect your hardware model, operating system version number, device name, equipment configuration, international mobile device identification code, unique device logo, network device hardware address, IP address, WLAN access point, Bluetooth, base station, software version number number number, Network access method, type, status, network quality data, operation, use, service log."}
{"task": "rw_90.jsonl", "id": 67625, "text": "We may associate your device information or phone number with your Zhihu account to be used for authentication, security prevention, fraud monitoring, prevention or prohibition of illegal activities, reducing risks, archiving and backup purposes.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67626, "text": "Know the system permissions called by APP", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67627, "text": "In order to provide you with products and/or services, we may need to use system permissions in your device to collect relevant personal information.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "We may need to use system permissions in your device to collect relevant personal information."}
{"task": "rw_90.jsonl", "id": 67628, "text": "This section will be summarized and organized all the system permissions involved in Article 1.1 of Article 1 to facilitate you to be more systematic, complete and transparent.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67629, "text": "You can choose whether to authorize us to use the relevant authority of your device, even if you are authorized, you are allowed to close or open it by yourself.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can choose whether to authorize us to use the relevant authority of your device, even if you are authorized, you are allowed to close or open it by yourself."}
{"task": "rw_90.jsonl", "id": 67630, "text": "For specific information about permissions, please refer to \"Zhihu, APP, Permanent List\" for details.", "label": ["Permission Acquisition", "Important"], "rewrite": "For specific information about permissions, please refer to the \"Zhihu APP permissions list\" for details."}
{"task": "rw_90.jsonl", "id": 67631, "text": "Except for other legitimacy reasons that agree", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67632, "text": "According to the provisions of relevant laws and regulations, in the following circumstances, we can collect and use some necessary personal information without obtaining your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following circumstances, we can collect and use some necessary personal information without obtaining your authorization consent:"}
{"task": "rw_90.jsonl", "id": 67633, "text": "(1) It is necessary for the contract to establish and fulfill the person as a party as one party;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for the establishment and fulfilling the contract, there is no need to obtain consent."}
{"task": "rw_90.jsonl", "id": 67634, "text": "(2) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "It is not necessary to obtain consent as a personal information that is collected as a statutory responsibility or a personal information necessary for the law."}
{"task": "rw_90.jsonl", "id": 67635, "text": "(3) In order to deal with emergencies, or in urgent situations to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information of the health and health of natural persons and protecting the lives and health of natural persons, there is no need to obtain consent."}
{"task": "rw_90.jsonl", "id": 67636, "text": "(4) In accordance with the provisions of the Personal Information Protection Law of the People's Republic of China, handle personal information within a reasonable scope or other legitimate personal information;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In accordance with the provisions of the Personal Information Protection Law of the People's Republic of China, deal with disclosure of personal information within a reasonable range, and there is no need to obtain consent."}
{"task": "rw_90.jsonl", "id": 67637, "text": "(5) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and administrative regulations, without obtaining consent."}
{"task": "rw_90.jsonl", "id": 67638, "text": "How can we entrust your personal information to deal with, share, transfer, and publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67639, "text": "Entrust your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67640, "text": "In order to provide you with more complete and high -quality products and / or services, some functions may be provided by our service partners (such as our third -party service providers, contractors, agents, etc.).We handle some of your personal information. For example, third -party suppliers send emails or push notifications on behalf of us, on behalf of us sending investigations invitations, and on behalf of us, we will mail you to you that you have purchased or confirmed the receiving product, and the information that is identified as logo is made.Data statistics analysis.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will entrust the service partner to handle some of your personal information on behalf of us."}
{"task": "rw_90.jsonl", "id": 67641, "text": "For companies, organizations, and individuals that accept our personal information, we will sign strict confidentiality agreement or data processing agreement with them to clarify the entrusted matters, and the purpose of the entrusted processing purpose, the time limit, the type of processing method, the types of personal information, the protection measures, and protection measures.As well as the rights and obligations of both parties, they are required to handle personal information in accordance with our requirements, this guideline, and related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a strict confidentiality agreement or data processing agreement with the client, asking them to handle personal information in accordance with our requirements, this guideline, and related confidentiality and security measures."}
{"task": "rw_90.jsonl", "id": 67642, "text": "If these third parties want to change the purpose of personal information, these third parties should solicit your consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If these third parties want to change the purpose of personal information, these third parties should solicit your consent again."}
{"task": "rw_90.jsonl", "id": 67643, "text": "If you refuse our service partners to collect or use personal information necessary for providing services when providing services, it may cause you to be unable to use the services provided by the partner in some Zhihu products and / or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to collect or use the personal information necessary for the service partner to provide services, it may cause the services provided by the partner that cannot be used."}
{"task": "rw_90.jsonl", "id": 67644, "text": "Regarding our partner (entrusted processing) to collect personal information types and collective purposes, please refer to the \"Sharing Personal Information List with Third Party\" for details.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Regarding our partner (entrusted processing) to collect personal information types and collective purposes, please refer to the \"Sharing Personal Information List with Third Party\" for details."}
{"task": "rw_90.jsonl", "id": 67645, "text": "Share your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67646, "text": "In order to provide you with complete products and services, some of our services or technologies will be provided by authorized partners.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67647, "text": "Please know that we will not take the initiative to provide your personal information to other personal information processors. We will only share your personal information for legal, correct, necessary, specific, and clear purposes, and only share the necessary personal informationEssence", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will not take the initiative to provide your personal information to other personal information processors. We will only share your personal information for legal, fair, necessary, specific, and clear goals, and only share the necessary personal information."}
{"task": "rw_90.jsonl", "id": 67648, "text": "In the following circumstances, we will provide your personal information to other personal information processors, to tell you that the name or name, contact information, processing purpose, processing method, and personal information of the receiver will obtain your separate consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In the following circumstances, we will provide your personal information to other personal information processors, to tell you that the name or name, contact information, processing purpose, processing method, and personal information of the receiver will obtain your separate consent."}
{"task": "rw_90.jsonl", "id": 67649, "text": "At the same time, we will sign a rigorous confidentiality agreement with the partner, asking them to handle your personal information strictly in accordance with our instructions, this guideline, and any other related confidentiality policies and take security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We will sign a rigorous confidentiality agreement with the partner, asking them to handle your personal information strictly in accordance with the confidential policy and take security measures."}
{"task": "rw_90.jsonl", "id": 67650, "text": "We require our partners to use the personal information to be shared for any other purpose.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We require our partners to use the personal information to be shared for any other purpose."}
{"task": "rw_90.jsonl", "id": 67651, "text": "When you check the web pages created by a third party or use the application developed by a third party, these third parties may place their own, cookie, or other technical means. These technical means are not controlled by our control, and their use is not used.Subject to this policy.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Third parties may place their own cookies or use other technical means. These technical means are not controlled by our control, and their use is not bound by this policy."}
{"task": "rw_90.jsonl", "id": 67652, "text": "Cooperators may have their independent personal information protection policies and user agreements. We recommend that you read and abide by third -party personal information protection policies and user agreements.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67653, "text": "Regarding our partner (shared) to collect personal information types and collective purposes, please refer to the \"Sharing Personal Information List with Third Party\" for details.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Regarding our partner (shared) to collect personal information types and collective purposes, please refer to the \"Sharing Personal Information List with Third Party\" for details."}
{"task": "rw_90.jsonl", "id": 67654, "text": "Transfer your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67655, "text": "In principle, we will not transfer your personal information control to other companies, organizations or individuals.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In principle, we will not transfer your personal information control to other companies, organizations or individuals."}
{"task": "rw_90.jsonl", "id": 67656, "text": "If mergers, acquisitions, or bankruptcy liquidation will be involved in the transfer of personal information. In this case, we will tell you that the name or name and contact information of the receiver will be required to continue to sufferThe constraints of this guideline.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you have a merger, acquisition or bankruptcy liquidation, it will involve the transfer of personal information. In this case, we will tell you the name or name and contact information of the receiver."}
{"task": "rw_90.jsonl", "id": 67657, "text": "If any changes in the collection and processing of personal information agreed in this guideline, the company and organization will re -solicit with your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If any changes in the collection and processing of personal information agreed in this guideline, the company and organization will re -solicit with your authorization consent."}
{"task": "rw_90.jsonl", "id": 67658, "text": "Publicly disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67659, "text": "We will not disclose your personal information unless you get your individual consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will not disclose your personal information unless you get your individual consent."}
{"task": "rw_90.jsonl", "id": 67660, "text": "Special reminder: In the process of using Zhihu, you actively publicly share and share personal information, and are not limited by this guideline (such as forwarding content to other Internet platforms).", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67661, "text": "You should note that any information you share can be read, collected and used by any third party, please consider your personal information in the content published and spreading content.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Any information you share can be read, collected and used by any third party, please consider it carefully."}
{"task": "rw_90.jsonl", "id": 67662, "text": "You fully understand that when you disclose yourself, Zhihu only stores content or system logs containing such information, but will not actively identify that such information belongs to your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "When you disclose yourself, Zhihu only stores content or system logs containing such information, but will not actively identify that such information belongs to your personal information."}
{"task": "rw_90.jsonl", "id": 67663, "text": "As long as you do not delete the information you posted publicly, the information may always stay in the public field;", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "As long as you do not delete the information you posted publicly, the information may always leave the public field."}
{"task": "rw_90.jsonl", "id": 67664, "text": "The three parties are preserved in the public field.", "label": ["Data Retention", "Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Even if you delete the information you posted publicly, these information can still be cached, replicated or stored independently by third parties, or preserved in the public field through other users or third parties."}
{"task": "rw_90.jsonl", "id": 67665, "text": "For example, when you forward the answers published by you to other Internet platforms, the platform will independently display, cache, or save your forwarding content. Other Internet users will forward and save your answer, and the corresponding page will not be will not.Controlled.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "When you will forward the answers published by Zhihu to other Internet platforms, the platform will independently display and preserve the content you forward. Other Internet users will also forward and save your answer. The corresponding page will be unknown."}
{"task": "rw_90.jsonl", "id": 67666, "text": "How do we protect your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67667, "text": "Your personal information security is critical to us.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67668, "text": "We will strictly abide by relevant laws and regulations and take reasonable and feasible measures recognized in the industry to protect your personal information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67669, "text": "Prevent information from unauthorized access, disclosure, use, and modification to avoid damage or loss of information.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67670, "text": "Technical measures and data security measures", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67671, "text": "We strive to take various physical, electronics and management security measures that meet industry standards to protect your personal information security.", "label": ["Important", "Data Security"], "rewrite": "Strive to take various physical, electronic and management security measures that meet industry standards to protect your personal information security."}
{"task": "rw_90.jsonl", "id": 67672, "text": "We actively establish data classification and grading systems, data security management specifications, and data security development specifications to manage the storage and use of personal information to ensure that the personal information that has not been related to the services provided by us is not collected.", "label": ["Important", "Data Security"], "rewrite": "Actively establish data classification and grading system, data security management specifications, and data security development specifications to manage the storage and use of personal information to ensure that personal information that has not been related to the services provided by us has not been collected."}
{"task": "rw_90.jsonl", "id": 67673, "text": "We have comprehensively securely controlled the data through signing confidentiality agreements, monitoring and auditing mechanisms with information contactors.", "label": ["Important", "Data Security"], "rewrite": "We have comprehensively securely controlled the data through signing confidentiality agreements, monitoring and auditing mechanisms with information contactors."}
{"task": "rw_90.jsonl", "id": 67674, "text": "Prevent your personal information from unauthorized access, public disclosure, use, modification, damage or loss.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67675, "text": "We have used security protection measures that meet the industry standards to protect your personal information, prevent data from being interviewed, publicly disclosed, used, and modified, and data prevent data from damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Safety protection measures that have been used in the industry to protect your personal information, prevent data from being interviewed, publicly disclosed, used, and modified, and data prevent data from damage or loss."}
{"task": "rw_90.jsonl", "id": 67676, "text": "We will take all reasonable and feasible measures to protect your personal information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67677, "text": "For example, when you exchange data (such as credit card information) between your browser and Zhihu (such as credit card information), SSL, encryption protection;", "label": ["Important", "Data Security"], "rewrite": "Exchange data (such as credit card information) between your browser and Zhihu is protected by SSL."}
{"task": "rw_90.jsonl", "id": 67678, "text": "At the same time, we also provide websites that appear in this guideline, https, safe browsing methods;", "label": ["Important", "Data Security"], "rewrite": "At the same time, we provide HTTPS security browsing methods in the \"Introduction\"."}
{"task": "rw_90.jsonl", "id": 67679, "text": "We will use encryption technology to ensure the confidentiality of the data;", "label": ["Important", "Data Security"], "rewrite": "We will use encryption technology to ensure the confidentiality of data."}
{"task": "rw_90.jsonl", "id": 67680, "text": "We will use a trusted protection mechanism to prevent data from being maliciously attacked;", "label": ["Important", "Data Security"], "rewrite": "We will use a trusted protection mechanism to prevent data from being maliciously attacked."}
{"task": "rw_90.jsonl", "id": 67681, "text": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information;", "label": ["Important", "Data Security"], "rewrite": "We will deploy the access control mechanism to ensure that only authorized personnel can access personal information."}
{"task": "rw_90.jsonl", "id": 67682, "text": "And we will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information.", "label": ["Important", "Data Security"], "rewrite": "We will organize safety and privacy protection training courses to strengthen employees' awareness of protecting the importance of personal information."}
{"task": "rw_90.jsonl", "id": 67683, "text": "When we show your personal information, we will use the methods including content replacement, anonymous processing and other methods to display off -allergies to protect your information security.", "label": ["Important", "Data Security"], "rewrite": "When we show your personal information, we will use the method including content replacement, anonymous processing and other methods to display off -allergies."}
{"task": "rw_90.jsonl", "id": 67684, "text": "safety certificate", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67685, "text": "We have passed the third -level certification of the information security level protection level of the Ministry of Public Security, and established a good coordinated communication mechanism with regulatory agencies and third -party evaluation agencies to timely resist and dispose of various information security threats to provide comprehensive guarantee for your information securityEssence", "label": ["Important", "Data Security"], "rewrite": "We have passed the third -level certification of the information security level protection level of the Ministry of Public Security and established a good coordination and communication mechanism with regulators and third -party evaluation agencies."}
{"task": "rw_90.jsonl", "id": 67686, "text": "Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67687, "text": "We will try our best to ensure the security of any information you send to us, but please understand that due to the technical restrictions and various malicious means in the Internet industry, we cannot guarantee that the information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67688, "text": "You need to understand that you can access the system and communication network we use in our services, which may have problems due to factors outside of our controllable scope.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67689, "text": "To prevent safety accidents, we have formulated a proper early warning mechanism and emergency plan.", "label": ["Important", "Data Security"], "rewrite": "To prevent safety accidents, we have formulated a proper early warning mechanism and emergency plan."}
{"task": "rw_90.jsonl", "id": 67690, "text": "If the personal information security incident occurs unfortunately, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and influence of the security incident, the disposal measures we have taken or we are goingYour remedy and immediately start the emergency plan to minimize the loss.", "label": ["Important", "Data Security"], "rewrite": "If you are unfortunately a personal information security incident, you will inform you in a timely manner: the basic situation and impact, disposal measures, suggestions, and remedial measures, and immediately start the emergency plan to minimize the loss."}
{"task": "rw_90.jsonl", "id": 67691, "text": "We will inform you in a timely manner about the incident -related situation by telephone, push notification, etc. When it is difficult to inform users one by one, we will publish a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "We will inform you in a timely manner that the incident -related situation is called by phone, push notification, etc. When it is difficult to inform users one by one, we will publish a reasonable and effective way."}
{"task": "rw_90.jsonl", "id": 67692, "text": "At the same time, we will also actively report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities, and closely cooperate with the work of government agencies.", "label": ["Important", "Data Security"], "rewrite": "We will also take the initiative to report the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities, and closely cooperate with the work of government agencies."}
{"task": "rw_90.jsonl", "id": 67693, "text": "How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67694, "text": "We attach great importance to your management of personal information and provide a variety of functions to ensure your rights to access, correct, delete, and withdraw consent of personal information.", "label": ["Important", "Edit/Control"], "rewrite": "Very emphasize your management of your personal information and provide a variety of functions to ensure your right to access, correct, delete, and withdraw consent of personal information."}
{"task": "rw_90.jsonl", "id": 67695, "text": "When using the WeChat Mini Program, if the user wants to manage the relevant information of the creation, agreeing, liked, and the collection sector, please operate in Zhihu APP. For details, please refer to the following path description.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67696, "text": "Manage account number, content and related records", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67697, "text": "Query, correction and supplementary account information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67698, "text": "[Settings, →, account and security] You can view and modify the account password through this feature, modify the binding of the mobile phone number, the binding mailbox, and the social account;", "label": ["Important", "Edit/Control"], "rewrite": "[Settings → Account and Security] You can view and modify the account password through this function, modify the binding of the mobile phone number, the binding mailbox, and the social account."}
{"task": "rw_90.jsonl", "id": 67699, "text": "You can access your recent activity history of Zhihu account, and understand your account login equipment and place within a month.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67700, "text": "You can set up trust devices to reduce security verification related to login.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67701, "text": "[Mine, →, personal homepage] You can view and modify your other account information in \"Edit Information\", including avatars, user names, one -sentence introduction, gender, birthday, residential place, industry experience, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, education, educationExperience, personal profile;", "label": ["Important", "Edit/Control"], "rewrite": "Personal profile."}
{"task": "rw_90.jsonl", "id": 67702, "text": "You can add a image keyword to your own or invite your friends, or edit or delete the image keywords.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67703, "text": "You can manage the identification display.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67704, "text": "Management creation related records", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67705, "text": "[Mine, →, creation, →, content management] You can view, modify, delete the data of the content you posted, including the release of answers, articles, live broadcasts, questions, ideas, columns, videos, and you save.Draft.", "label": ["Important", "Edit/Control"], "rewrite": "[My → Creation → Content Management] You can view, modify, and delete the data of the content you posted, including the posted answers, articles, live broadcasts, questions, ideas, columns, videos, and the draft you saved."}
{"task": "rw_90.jsonl", "id": 67706, "text": "However, you delete the published content only to cancel its public display. It is not necessary to keep the background storage reservations on the content of the content you once posted in accordance with the requirements of laws and regulations.", "label": ["Data Retention", "Edit/Control", "Risk", "Important"], "rewrite": "If you delete the published content, you only cancel its public display. It is not necessary to store the background storage reserves of the content you have published (outside the grass manuscript box content)."}
{"task": "rw_90.jsonl", "id": 67707, "text": "You can also check the data you posted under this path.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67708, "text": "[Mine, →, creation, →, content analysis] You can view the data and data trends of the data you posted (including answers, videos, articles).", "label": ["Important", "Edit/Control"], "rewrite": "[My → Creation → Content Analysis] You can view the data and data trends of the data you posted (including answers, videos, and articles)."}
{"task": "rw_90.jsonl", "id": 67709, "text": "Main data includes total reading, total number of playbacks, and the number of interactions (obtained, comments, likes, collection).", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67710, "text": "[Mine, →, creation, →, income analysis] You can view the income and income trend obtained by the Zhihu platform under your current account.", "label": ["Important", "Edit/Control"], "rewrite": "[Mine → Creation → Revenue Analysis] You can view the income and income trend obtained by your current account on the Zhihu platform."}
{"task": "rw_90.jsonl", "id": 67711, "text": "Main data include today's revenue, cumulative income, creative balance, daily list, content income, etc.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67712, "text": "Manage browsing, attention and collection records", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67713, "text": "[Mine, →, recent browsing] You can query/close the recent browsing record, delete it in batches or clear your browsing records in batches.", "label": ["Edit/Control", "Important"], "rewrite": "[My → Recent Browse] You can query/close the recent browsing record, delete it in batches or clear your browsing records."}
{"task": "rw_90.jsonl", "id": 67714, "text": "If you want to delete the recent browsing information in the process of knowing the WeChat Mini Program, you can make a request to delete personal information by sending emails to privacy@zhihu.com.", "label": ["Edit/Control", "Contact Information", "Important"], "rewrite": "You can make a request to delete personal information by sending emails to privacy@zhihu.com."}
{"task": "rw_90.jsonl", "id": 67715, "text": "[My → Follow] You can manage all the lists of attention, including the users, columns, problems, topics, topics, topics, round tables, and collection clips you are concerned about.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67716, "text": "[My → Favorites] You can manage the single topic of your collection or the collection clip you established, the content you chase.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67717, "text": "Management purchase/use record", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67718, "text": "[My → Wallet] You can view the balance of your account balance, Zhihu coin, live salt grains and live salt coins on this platform, transaction records, and gift vouchers you have.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67719, "text": "[My → Purchase] You can view the details of the consumption order on this platform.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67720, "text": "[My → Bookcover] You can view the details of books and curriculum (including payment and free content) that have been read and viewed in Zhihu, and can be downloaded, screened, deleted, and managed.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67721, "text": "Manageed personal certification", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67722, "text": "[Mine, →, personal homepage] You can apply for/cancel personal authentication in the editing information, or view and modify the personal certification information.", "label": ["Important", "Edit/Control"], "rewrite": "[My → Personal Homepage] You can apply for/cancel personal authentication in the editing information, or view and modify the personal authentication information."}
{"task": "rw_90.jsonl", "id": 67723, "text": "Clear the cache information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67724, "text": "[Mine, →, setting, →, clearing the cache] You can remove the cache of Zhihu in your device through this path.", "label": ["Important", "Edit/Control"], "rewrite": "[My → setting → clearing the cache] You can remove the cache of Zhihu in your device through this path."}
{"task": "rw_90.jsonl", "id": 67725, "text": "Delete your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67726, "text": "Except for the ways and situations of your management and deletion of personal information in Article 4.1, and in the following situations, we will actively delete your personal information.", "label": ["Edit/Control", "Important"], "rewrite": "In the following circumstances, we will actively delete your personal information."}
{"task": "rw_90.jsonl", "id": 67727, "text": "If we are not deleted, you can make a request to delete personal information by sending emails to privacy@zhihu.com:", "label": ["Important", "Edit/Control"], "rewrite": "If we have not deleted, you can ask us to make a request to delete personal information by sending emails to privacy@zhihu.com."}
{"task": "rw_90.jsonl", "id": 67728, "text": "(1) The purpose of the treatment has been achieved, unable to achieve or to achieve the purpose of treatment;", "label": ["Edit/Control", "Important"], "rewrite": "If the treatment purpose has been achieved, cannot be achieved, or is not necessary for the purpose of the processing purpose, it can apply for deletion."}
{"task": "rw_90.jsonl", "id": 67729, "text": "(2), we stop providing products or services, or the storage period has expired;", "label": ["Important", "Edit/Control"], "rewrite": "If we stop providing products or services, or the storage period has expired, we can apply for deletion."}
{"task": "rw_90.jsonl", "id": 67730, "text": "(3) You withdraw consent;", "label": ["Important", "Edit/Control"], "rewrite": "If you withdraw your consent, you can apply for deletion."}
{"task": "rw_90.jsonl", "id": 67731, "text": "(4) We violate laws, administrative regulations or deal with personal information in violation of agreed;", "label": ["Edit/Control", "Important"], "rewrite": "We can apply for deletion if we violate laws, administrative regulations or deal with personal information."}
{"task": "rw_90.jsonl", "id": 67732, "text": "(5) Other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "Edit/Control"], "rewrite": "Other circumstances stipulated in laws and administrative regulations may apply for deletion."}
{"task": "rw_90.jsonl", "id": 67733, "text": "After you delete the information, we will adjust the products and/or services provided by you accordingly.", "label": ["Important", "Edit/Control"], "rewrite": "After you delete the information, we will adjust the products and/or services provided by you accordingly."}
{"task": "rw_90.jsonl", "id": 67734, "text": "But please understand that this will not affect personal information processing based on your authorization.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Deleting information will not affect personal information processing based on your authorization."}
{"task": "rw_90.jsonl", "id": 67735, "text": "Get your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67736, "text": "If you need to check your personal information that I have collected, you can view it in [Mine, →, setting, →, collecting personal information list].", "label": ["Edit/Control", "Important"], "rewrite": "If you need to check your personal information that I have collected, you can view it in [My → Settings → Collecting Personal Information List]."}
{"task": "rw_90.jsonl", "id": 67737, "text": "If you need to obtain your personal information copy, you can be in [Mine, →, Settings, →, Privacy Center, Personal Information Download] Page contact \"Zhihu Small Butler\" and apply for downloading you who have collected you who have collected you.personal information.", "label": ["Important", "Edit/Control"], "rewrite": "If you need to obtain your personal information copy, you can apply for downloading personal information on the page of [My → Settings → Privacy Center → Personal Information Download] page."}
{"task": "rw_90.jsonl", "id": 67738, "text": "Withdrawal of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67739, "text": "1. Withdrawing the consent of messages and push", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67740, "text": "[Mine, →, settings] You can choose and manage message settings and push notification settings.", "label": ["Important", "Edit/Control"], "rewrite": "[My → Settings] You can select and manage message settings and push notification settings."}
{"task": "rw_90.jsonl", "id": 67741, "text": "You can also set the exemption mode for push notification settings.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67742, "text": "2. Withdrawal of personalized recommendations for personalized recommendations", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67743, "text": "[Mine, →, settings, →, privacy center, authority authorization settings] You can withdraw the consent of personalized content recommendation and personalized advertising on this page, including:", "label": ["Edit/Control", "Important"], "rewrite": "[My → Settings → Privacy Center → Permanent Authorization Settings] You can withdraw your consent of personalized content recommendation and personalized advertising on this page."}
{"task": "rw_90.jsonl", "id": 67744, "text": "(1) Close personalized content recommendation: You can choose whether to accept the content that you may be interested in.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "You can choose whether to accept the content that may be interested in the basis of knowing algorithms."}
{"task": "rw_90.jsonl", "id": 67745, "text": "After closing, I will cancel the contents of Q & A, articles, courses, books, etc. to you that you may be interested in. Zhihu only push the content to you only, and the recommendation correlation of the content you see will be reduced.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "After closing a personalized recommendation, you will cancel the content that you may be interested in. Knowing that you only push the content from you, the recommendation correlation of the content you see will be reduced."}
{"task": "rw_90.jsonl", "id": 67746, "text": "(2) Close personalized advertising recommendation: You can choose whether to accept personalized advertising recommendations.", "label": ["Important", "Usage", "Edit/Control"], "rewrite": "You can choose whether to accept personalized advertising recommendations."}
{"task": "rw_90.jsonl", "id": 67747, "text": "After closing, the correlation between the advertisement and you, but the number of ads you see will not be reduced.", "label": ["Edit/Control", "Usage", "Important"], "rewrite": "After closing personalized recommendations, the correlation of advertising and you, but the number of advertisements you see will not be reduced."}
{"task": "rw_90.jsonl", "id": 67748, "text": "3. Withdraw other authorization", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67749, "text": "You can on the page of [→, settings, →, privacy center, →, authority authorization setting]:", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw authorization on the page of [My → Settings → Privacy Center → permission authorization setting] page."}
{"task": "rw_90.jsonl", "id": 67750, "text": "(1) Permanent settings: You can manage, set up, and withdraw your system permissions that you have opened when you use the \"permissions settings\" section.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage, set up, and withdraw your system permissions that you have opened when you use the \"permissions settings\" section."}
{"task": "rw_90.jsonl", "id": 67751, "text": "(2) Cover the Guidelines for Protection of Personal Information: You can choose to withdraw the authorization of this guideline by clicking the \"withdrawal of the Privacy Agreement\".", "label": ["Policy Change", "Important", "Edit/Control"], "rewrite": "You can choose to withdraw the authorization of this guideline by clicking the \"withdrawal of the Privacy Agreement\"."}
{"task": "rw_90.jsonl", "id": 67752, "text": "When you withdraw, you need to make a choice of your authorization status so that you can continue to use Zhihu's products or services.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67753, "text": "(3) Withdrawal \"Marketing SMS and Telephone\": After you choose to withdraw, know that you will no longer be based on the purpose of promotion, marketing, and invitation. Use your mobile phone number when you register.SMS notification.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67754, "text": "Please know: When you withdraw or authorize, we will no longer collect and process the corresponding personal information, but please understand that when you withdraw or authorizeSpecific functions and/or services.", "label": ["Edit/Control", "Important"], "rewrite": "After you withdraw your consent or authorization, we cannot continue to provide you with specific functions and/or services corresponding to the corresponding consent or authorization."}
{"task": "rw_90.jsonl", "id": 67755, "text": "The decision you withdraw from consent or authorization will not affect the effectiveness of personal information processing activities based on your consent or authorization.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "The decision to withdraw consent or authorization will not affect the effectiveness of personal information processing activities based on your consent or authorization."}
{"task": "rw_90.jsonl", "id": 67756, "text": "Logging out Zhihu account", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67757, "text": "If you need to cancel your Zhihu account, you need to submit the application in [我 → →, exclusive customer service/feedback and help, →, account cancellation] page, and fill in the information based on the page instruction so that we can verify your request.", "label": ["Edit/Control", "Important"], "rewrite": "Apply for cancellation accounts on the page of [My → Exclusive customer service/feedback and help → account cancellation] Page."}
{"task": "rw_90.jsonl", "id": 67758, "text": "After canceling the account, we will stop providing you all the products and/or services that know you, and process your personal information through anonymous and other methods in accordance with the relevant requirements of laws and regulations, or delete personal information related to your account.Regulations or regulators are otherwise stipulated by user information storage time.", "label": ["Important", "Edit/Control"], "rewrite": "After canceling the account, we will stop providing you all the products and/or services that know you, and process or delete your personal information through anonymous and other methods."}
{"task": "rw_90.jsonl", "id": 67759, "text": "For the relevant rules and processes of accounting accounts, see \"Important Reminder of User Logging\".", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67760, "text": "Limit processing your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67761, "text": "Please know and understand that in order to use Zhihu and/or services normally, you need to provide us with the necessary personal information related to the product and/or service.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67762, "text": "In product settings, you can adjust authorization and functions related to personal information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67763, "text": "If you want to restrict your personal information more specific and personalized, or do not want to accept the business advertisement or marketing information that we send to you, you can send emails to [privacy@zhihu.com].", "label": ["Important", "Contact Information"], "rewrite": "You can send an email to [privacy@zhihu.com]."}
{"task": "rw_90.jsonl", "id": 67764, "text": "Respond to your above request", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67765, "text": "To ensure your account security, we will first verify your identity (if you ask you to provide a written request or other ways), and then process your request.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67766, "text": "We will complete the verification of your identity and response to your request within 15 working days after receiving your request.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67767, "text": "For your reasonable request, we do not charge fees in principle.", "label": ["Edit/Control", "Important"], "rewrite": "For your reasonable request, we do not charge fees in principle."}
{"task": "rw_90.jsonl", "id": 67768, "text": "However, we will charge a certain cost fee depending on the situation for requests that repeat and beyond a reasonable limit.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "However, we will charge a certain cost fee depending on the situation for requests that repeat and beyond a reasonable limit."}
{"task": "rw_90.jsonl", "id": 67769, "text": "For those who are contrary to the requirements of laws and regulations, repetition for no repetition, too much technical means (such as need to develop new systems or fundamentally change the current practice), bring risks or very unrealistic requests to others' legitimate rights and interests, we may give itreject.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may refuse to be contrary to the requirements of laws and regulations, repetition for no repetition, too much technical means, and bringing risks or very unrealistic requests to others, or very unrealistic requests."}
{"task": "rw_90.jsonl", "id": 67770, "text": "If you have further requirements or any questions, opinions, or suggestions on your own rights as the main rights of the data, you can contact us and exercise your relevant rights through the \"how to contact us\" section in this guideline.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67771, "text": "How do we store your personal information", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67772, "text": "We will keep your personal information on the individual information obtained from the People's Republic of China and keep your personal information within the shortest period of time required for the purpose of this guide.", "label": ["Data Retention", "Important"], "rewrite": "The personal information obtained from the People's Republic of China is stored in the territory of the People's Republic of China, and your personal information is retained within the shortest period of the purpose of the purpose of this guideline."}
{"task": "rw_90.jsonl", "id": 67773, "text": "After exceeding the storage period, we will delete or processes your personal information, but national laws, regulations, regulations, standardized documents, or government policies and orders have other requirements or other requirements or to fulfill our compliance obligations.Except for your personal information.", "label": ["Data Retention", "Important", "Data Security"], "rewrite": "After exceeding the storage period, we will delete or processes your personal information."}
{"task": "rw_90.jsonl", "id": 67774, "text": "For example: The E -commerce Law of the People's Republic of China requires that the saving time of goods and service information and transaction information is not less than three years from the date of completion of the transaction;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67775, "text": "The \"Cyber Security Law of the People's Republic of China\" requires technical measures to monitor, record network operating status, and network security incidents, and keep the relevant network logs in accordance with regulations at no less than six months.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67776, "text": "How do we use cookie and other technologies", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67777, "text": "When you use our service, we will store small data files, cookies, and small data files on your computer or mobile device.", "label": ["Important", "First Party Collection Information"], "rewrite": "Small data files named Cookie on your computer or mobile device."}
{"task": "rw_90.jsonl", "id": 67778, "text": "Cookie usually contains identifiers, site names, and some numbers and characters.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67779, "text": "We use these information to determine whether the registered users have logged in to improve services and/or product quality and optimize user experience.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67780, "text": "If you don't want personal information to be saved in, cookies, you can configure the browser, choose disable, cookie, function.", "label": ["Important", "Edit/Control"], "rewrite": "The browser can be configured and selects the cookie function."}
{"task": "rw_90.jsonl", "id": 67781, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete Cookie according to your preferences."}
{"task": "rw_90.jsonl", "id": 67782, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on the computer, and most of the network browsers have the function of preventing cookies."}
{"task": "rw_90.jsonl", "id": 67783, "text": "The following link provides a description of how to control cookies in all mainstream browsers:", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67784, "text": "Google Chrome：https://support.google.com/chrome/answer/95647?", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67785, "text": "hl = one;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67786, "text": "IE：https://support.microsoft.com/en-us/help/260971/description-of-cookies;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67787, "text": "Safari (desktop version): https://support.apple.com/kb/ph5042?", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67788, "text": "Local=en_us;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67789, "text": "Safari (mobile version): https://support.apple.com/en-s/ht201265;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67790, "text": "Firefox browser: https://support.mozilla.org/en-s/kb/cookies-websites-on-you-computer?", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67791, "text": "redirectlocale=en-US&redirectslug=Cookies;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67792, "text": "Opera：https://www.opera.com/zh-cn/help。", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67793, "text": "If you use other browsers, see the documents provided by the browser manufacturer.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67794, "text": "Please know that if you refuse to use or clear the existing tracking technology, you need to change the user setting in person at each visit, and we may not be able to provide you with a better use experience, and some services may not work properly normally.Essence", "label": ["Important", "Edit/Control"], "rewrite": "If you refuse to use or clear the existing tracking technology, you need to change the user settings in your own visit."}
{"task": "rw_90.jsonl", "id": 67795, "text": "How do we deal with the personal information of minors", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67796, "text": "Our products, websites and services are mainly for adults.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67797, "text": "If you are a minor under the age of 18, please do not or terminate our products and/or services.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67798, "text": "If you are the guardian of minors, when you have any questions about whether you use our service or provide information to us if you are monitored, please contact us in a timely manner in Article 9.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67799, "text": "If we find that we have collected personal information of minors without knowing it, we will try to delete relevant data as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If we collect personal information of minors without knowing it, we will try to delete relevant data as soon as possible."}
{"task": "rw_90.jsonl", "id": 67800, "text": "How do we update and modify this guideline", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67801, "text": "Although this guidelines explain the standards we follow in protecting personal information, these standards may change with our timely amendments, which are part of the guidance of these revisions.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67802, "text": "This guidance is an important part of the \"Zhihu Agreement (Draft)\".", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67803, "text": "Zhihu reserves the right to update or modify the guidance from time to time.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67804, "text": "When this guidelines are changed, we will notify you through reasonable methods such as push notifications, pop -ups, system notifications, and private messages in the station through this platform client so that you can understand any changes made by this guideline in time.", "label": ["Policy Change", "Important"], "rewrite": "When this guidelines are changed, we will notify you through reasonable methods such as push notifications, pop -ups, system notifications, and private messages in the station through this platform client."}
{"task": "rw_90.jsonl", "id": 67805, "text": "You can use [My → Settings → Privacy Center → Personal Information Protection Guide] on this platform to view the latest content of this guidance.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67806, "text": "Please note that only after obtaining your consent can we collect, use, process, and store your personal information according to the updated statement.", "label": ["Policy Change", "Important"], "rewrite": "Only after obtaining your consent can you collect, use, process, and store your personal information according to the updated statement."}
{"task": "rw_90.jsonl", "id": 67807, "text": "Without your clear consent, we will not reduce the rights you should enjoy in accordance with this guideline.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67808, "text": "For major changes, depending on the specific situation, we will also provide a more significant notice to explain the specific changes of this guideline.", "label": ["Policy Change", "Important"], "rewrite": "Depending on the specific circumstances, we will provide a more significant notice to explain the specific changes of this guideline."}
{"task": "rw_90.jsonl", "id": 67809, "text": "Major changes include but not limited to:", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67810, "text": "(1) Our service model has changed significantly.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67811, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67812, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67813, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67814, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67815, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67816, "text": "(5) We are responsible for handling the responsibility departments, contact methods and complaint channels for handling personal information security;", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67817, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67818, "text": "If you do not agree with the guidance of the personal information protection after modification, you have the right and immediately stop using the service of Zhihu.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67819, "text": "How do you contact us", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67820, "text": "When you have any questions about this guideline, you can contact us by knowing the official account \"Knowing the Small Butler\", or send an email, Privacy@zhihu.com, consult, we have set up a personal information protection full -time department to solve your timely solution to youquestion.", "label": ["Important", "Contact Information"], "rewrite": "Send an email to privacy@zhihu.com for consultation. We have set up a full -time department for personal information protection to solve your problems in time."}
{"task": "rw_90.jsonl", "id": 67821, "text": "We will complete the response and treatment of your identity and request within 15 working days after receiving your request to help solve your problems.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67822, "text": "Please understand and know that in order to ensure safe and efficiently to deal with your problems and give you feedback to you in time, we will deal with your request after verifying your identity.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67823, "text": "When we verify your identity, you may ask you to provide relevant evidence.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67824, "text": "Dispute Resolution", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67825, "text": "For any controversy caused by this guideline and our personal information, you can sue to the People's Court of Haidian District, Beijing.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67826, "text": "If you think our personal information processing behavior harms your legitimate rights and interests, you can also report it to relevant government departments.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67827, "text": "Concept and definition", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67828, "text": "The nouns used in this guideline are defined in the usual meaning:", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67829, "text": "(1) Personal information: Various information related to the recognized or recognized natural persons recorded in electronics or other ways, including but not limited to the names of natural persons, date of birth, ID number, personal biometric information, address, telephone numberNumbers, etc., do not include information after anonymous processing.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67830, "text": "(2) Sensitive personal information: Once leaked or illegally used, it is easy to lead to personal information that is harmed by the personality dignity of natural persons or the safety of property and property security, including biometrics, religious beliefs, specific identities, medical health, financial accounts, trajectory trajectories trajectorySuch information, and personal information under minority at the age of 14, such as sensitive personal information includes ID numbers, personal biometric information, bank accounts, communication content, health and physiological information, etc.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67831, "text": "(3) Log information: Including the content you posted and browsed when you use it, the operation time, type, network address, target address, port, date and time of access when you publish the content, log in to IP information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67832, "text": "(4) Follow the list: including users, content lists (including topics, collecting clips, etc.).", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67833, "text": "(5) Address information: The contact information you store, including mobile phone numbers and names.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67834, "text": "To collect the above information, we may need to apply for phone permissions and storage permissions that you authorize us to use the device.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67835, "text": "(6) Precise positioning information: refers to GPS or base station information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67836, "text": "To collect the above information, we need to apply for the location authority you authorize us to use the device.", "label": ["Permission Acquisition", "Important"], "rewrite": "You need to apply for the location authority of our use of the device for collecting information."}
{"task": "rw_90.jsonl", "id": 67837, "text": "(7) Trading records: Refers to transaction time, purchase of products, and payment prices for purchasing goods or services.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67838, "text": "(8) Devision: Personal information is processed, so that it cannot recognize the process of specific natural persons without the help of additional information.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67839, "text": "(9) Anonymous: Personal information cannot recognize a specific natural person and cannot recover after processing.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67840, "text": "(10) Mainland China or mainland China: Refers to the purpose of the People's Republic of China in mainland China, which is only the purpose of this guideline, and does not include the Hong Kong Special Administrative Region, the Macau Special Administrative Region and Taiwan.", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67841, "text": "Personal Information Protection Guide History Version Review", "label": [], "rewrite": []}
{"task": "rw_90.jsonl", "id": 67842, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
