{"task": "rw_95.jsonl", "id": 68875, "text": "League of Legends mobile game privacy protection guidelines", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68876, "text": "Release date: 2022-05-17", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68877, "text": "Effective date: 2022-05-17", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68878, "text": "Update prompt", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68879, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68880, "text": "1. The personal information we collect and use", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68881, "text": "2. Personal information sharing, transfer and public disclosure", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68882, "text": "3. Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68883, "text": "4. Information security", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68884, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68885, "text": "6. Change", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68886, "text": "7. Minor protection", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68887, "text": "8. Others", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68888, "text": "9. Contact us", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68889, "text": "Update prompt", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68890, "text": "Update prompt:", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68891, "text": "In order to fully protect your rights, we have a separate configuration of the League of Legends Mobile Games on the basis of \"Guidelines for Privacy Protection of Tencent Games\".", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68892, "text": "Compared with the Guidelines for Privacy Protection of Tencent Games, the key content of this version is mainly concentrated:", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68893, "text": "1. In Chapter 1 \"We Collect and Use Personal Information\" part, fully combine the actual situation of the League of Legends mobile game products and business, and inform you of the business scenario and purpose of collecting your personal information to you, andSupplement the instructions to apply for the corresponding equipment system permissions.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68894, "text": "2. Further explain to you the situation where the League of Legends mobile games and Tencent Games processed personal information when authentication of your account.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68895, "text": "overview", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68896, "text": "You are welcome to choose Tencent games provided by Tencent!", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68897, "text": "In addition to the \"Tencent Game Privacy Protection Guide\" and \"Tencent Game License and Service Agreement\", we will also further refine it to you through the \"Guidelines for Privacy Protection Protection of the League of Legends Mobile Games\" (\"This Guideline\")When we collect, use, store, and share personal information when we (\"Game Products\" or \"Products\"), and related rights you enjoy, this guidelines are part of the Tencent Game License and Service Agreement.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68898, "text": "Tencent or Tencent (hereinafter referred to as \"us\") in this guidelines, specifically refers to Shenzhen Tencent Computer System Co., Ltd., a provider of Tencent Games and its services, is registered in the science and technology of Maling Community Science and Technology in Maling Community, Yuehai Street, Nanshan District, Shenzhen.All the way to Tencent Building 35 floors.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68899, "text": "The points are as follows:", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68900, "text": "• In order to provide you with basic services such as gaming entertainment and interactive and consumption related to this player, we need to collect your account and login information, game log information, equipment information, consumption information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your account and login information, game log information, equipment information, and consumer information to provide basic services."}
{"task": "rw_95.jsonl", "id": 68901, "text": "In order to provide you with other game extensions, we also need to collect your geographical location, multimedia documents, and contact information information you provide to us.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your geographical location, multimedia documents, and contact information you actively provide to provide expansion functions."}
{"task": "rw_95.jsonl", "id": 68902, "text": "For details, please check the first part of this guideline.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68903, "text": "• In order to collect the above information, we need to apply for some system permissions to you. You can manage your personal information and related authorization according to the guidance.", "label": ["Edit/Control", "Permission Acquisition"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68904, "text": "• In order to better protect the physical and mental health of minors and promote the healthy access of minors, we may implement more stringent anti -addiction measures on the basis of the state's relevant national online game anti -addiction policy regulations.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68905, "text": "At the same time, we also continue to study and test new technologies that protect minors.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68906, "text": "For example, in order to further improve the accuracy of real -name authentication and to maximize the minors from using the identity information of others, we may use the face recognition verification identity in some games or for some users (based on specific game strategies), and use face face recognitionAt this time, we will use the identity verification ability provided by Tencent Health System to verify the WeChat or QQ account (depending on your login account) you currently log in and use. Tencent Health System needs to collect your real identity information for identity verification.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When using face recognition, use Tencent Health System to collect real identity information for identity verification to further improve the accuracy of real -name authentication."}
{"task": "rw_95.jsonl", "id": 68907, "text": "When using the face recognition function, Tencent Health System will apply for your device camera/camera permissions through WeChat or QQ to complete the face recognition.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Tencent Health System will call the device camera/camera right to complete face recognition."}
{"task": "rw_95.jsonl", "id": 68908, "text": "• The above -mentioned face recognition verification mainly compares the user's real facial information with the data source of the data platform of the Public Security authority.", "label": ["Important", "Usage"], "rewrite": "Face recognition results are used to match the corresponding game time limit according to the actual age group."}
{"task": "rw_95.jsonl", "id": 68909, "text": "If the result is inconsistent or the user refuses to verify, we will uniformly regard them as a 12 -year -old and below minor and include the corresponding anti -addiction supervision.", "label": ["Important", "Usage"], "rewrite": "Face recognition verification results do not match or refuse to verify, you will be regarded as a minor 12 years old and below."}
{"task": "rw_95.jsonl", "id": 68910, "text": "Related verification data for face recognition is only used to compare with the authoritative data platform of public security after encryption, and we will not keep it.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Human face recognition related verification data is only used to compare with the data source of the Public Security's authoritative data platform after encryption without retention."}
{"task": "rw_95.jsonl", "id": 68911, "text": "• We use multi -directional security protection measures to ensure that your personal information protection is at a reasonable level of security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68912, "text": "You can learn more detailed personal information processing rules through reading the full version of the \"League of Legends Mobile Game Privacy Protection Guide\" to understand the corresponding relationship between the type and use of personal information.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68913, "text": "1. The personal information we collect and use", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68914, "text": "In the process of using this game product service, we will collect the information that you actively provide or due to the service when using the service as follows, to provide you with your services and ensure your account securityThe", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the information that you actively provide when using the service or the information generated by the use of services to provide services or guarantee account security."}
{"task": "rw_95.jsonl", "id": 68915, "text": "1.1, when you register, log in, and use this game product service, we will collect your account number and login information as the network identity information information to mark your users as Tencent games.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your account number and login information as users of the network identity identification information as Tencent games."}
{"task": "rw_95.jsonl", "id": 68916, "text": "You can register and log in to this game product with WeChat, QQ or other accounts (hereinafter referred to as \"third -party accounts\").", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68917, "text": "If you use WeChat, QQ and (or) third -party accounts as a game account associated with Tencent games, we will collect the unique logo, nickname, and avatar involved in the WeChat, QQ or third -party accounts you use to help you complete registration and register andLogin, and friends or other information authorized by your authorized friends in order to associate your friends in your WeChat, QQ or third -party accounts in the game to achieve a better social experience.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When logging in with a third -party account, the unique logo, nickname, and avatars involved in the third -party account number involved in the registration and login, collecting friends or other information for socializing."}
{"task": "rw_95.jsonl", "id": 68918, "text": "You can check and manage the above information authorization in WeChat, QQ or third -party platforms.", "label": ["Edit/Control", "Important"], "rewrite": "You can check and manage information authorization on WeChat, QQ or third -party platforms."}
{"task": "rw_95.jsonl", "id": 68919, "text": "1.2, in order to meet the requirements of relevant laws, regulations and policies and the requirements of relevant competent authorities, you should provide real identity information for account registration and login and use. We will verify your true identity information through Tencent Health System.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your real identity information to help you register and log in and perform real -name verification."}
{"task": "rw_95.jsonl", "id": 68920, "text": "In order to achieve the previous description, you agree that we will verify the real -name authentication of the WeChat or QQ account used by your current registration and login to Tencent Health System.We disclosed the age information to confirm whether the account is included in the anti -induction system and what kind of anti -addiction measures are taken. At the same time, you agree that we will submit your name and ID number to the national unified minor online game electronic identity through the Tencent health systemThe authentication system is verified by authenticity.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "You agree that we verify the real -name authentication of the account from Tencent Health System and collect age information to confirm whether the account is included in the anti -addiction system and what kind of anti -addiction measures are taken.Adult online game electronic identity authentication system is verified by real identity."}
{"task": "rw_95.jsonl", "id": 68921, "text": "If the account does not complete the real -name authentication in the Tencent Health System, we cannot provide you with services. If you still want to use our products and services, you should be on the WeChat or QQ used by you in the Tencent Health System.The account completes the real -name authentication. In the process of real -name authentication, Tencent Health System will collect your real -name identity information (including name and ID number).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We only provide products and services that have completed the real -name authentication account that has collected real -name identity information that has collected real -name identity information."}
{"task": "rw_95.jsonl", "id": 68922, "text": "At the same time, in order to verify the purpose of authenticity, the Tencent Health System may be based on the protection strategy of minors, when you conduct real -name authentication of the WeChat or QQ account you are currently registered and logged in, or you use the real -name certification of WeChat or you have completed the real -name certification orDuring the QQ account login game and use the game service process, from time to time, you are required to further provide other sensitive personal information (including mobile phone numbers, photos, or face recognition information, etc.) and will use the real -name information records and telecommunications operators with you in Tencent's health systemPutting the real -name information records or the data source of the public security data platform for comparison.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "In the process of using the game service, Tencent Health System will collect other sensitive personal information (including mobile phone numbers, photos, or face recognition information, etc.) from time to time and compare it with the recorded data source."}
{"task": "rw_95.jsonl", "id": 68923, "text": "If you refuse to provide the aforementioned information or fail to pass the comparison, you may not be able to continue using our products and services or restricted.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you refuse to provide real -name authentication information or fail to pass the comparison, you cannot continue to use products and services or restricted."}
{"task": "rw_95.jsonl", "id": 68924, "text": "Face recognition related verification data is only used to compare with the data source of the authoritative data platform of Public Security after encryption, and we will not keep it.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Human face recognition related verification data is only used to compare with the data source of the Public Security's authoritative data platform after encryption without retention."}
{"task": "rw_95.jsonl", "id": 68925, "text": "1.3, when you use this game product service, we will collect your game log information, such as login logs, items logs, operating information, game -to -game information, dating information, etc.Functions and scenes, while also used for customer service complaint processing and game security and vulnerability processing analysis.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect game log information for normal use of related functions and scenarios, and at the same time used for customer service complaint processing and game security and vulnerability processing analysis."}
{"task": "rw_95.jsonl", "id": 68926, "text": "To ensure the consistency and stability of your game experience, we may synchronize the aforementioned information to the subsequent version of the game.", "label": ["Important", "First Party Collection Information"], "rewrite": "The game log information will be synchronized to the subsequent version of the game."}
{"task": "rw_95.jsonl", "id": 68927, "text": "1.4, in order to ensure your normal use of our services and maintain the normal operation of the basic functions of the game, optimize the performance of this game product according to your device terminal and network status, improve your game experience and ensure your account security. We will collect your accountEquipment names, equipment types, equipment models and versions, operating systems, system attributes, IP address, operator information, Wi-Fi status/parameters, device recognition symbols (such as IMEI, IMSI, MAC address, Android, ID, hardware sequence number), Apps such as ID, network type and other information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect equipment name, equipment type, equipment model and version, operating system, system attributes, IP address, operator information, Wi-Fi status/parameters, equipment recognition symbols, application ID, network types and other information to optimize product performance, improve gamesExperience and guarantee account security."}
{"task": "rw_95.jsonl", "id": 68928, "text": "1.5, when you use the consumption function, we will collect information such as your recharge records, consumption records in order to provide services and allow you to query your transaction records and protect your virtual items to the greatest extent.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect information such as recharge records, consumption records to query transaction records and protect the safety of virtual items."}
{"task": "rw_95.jsonl", "id": 68929, "text": "The recharge records and consumption records are sensitive personal information. Collecting the above information is necessary to achieve consumption functions, otherwise the transaction will not be completed.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect recharge records and consumer records as necessary for consumption functions."}
{"task": "rw_95.jsonl", "id": 68930, "text": "1.6, in order to ensure your game environment and equipment security, create a fair, healthy and safe game environment, we will collect your equipment and game recognition information, such as device logo, hardware and operating system information, installed application lists, sensors, sensors, sensors, sensors, sensors, sensors, sensors, sensors, sensorsInformation (including acceleration sensors, environmental light sensors, gravity sensors), process and game crash records, overall use of the game, game channel sources, etc. to use to combat the behavior of damaging the fair environment or interference of the game or the normal conduct of game services (Such as to detect piracy, scanned plug -in, prevent cheating, prevent external malicious attacks, etc.).", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Collect your device and game recognition information to ensure the fairness of the game."}
{"task": "rw_95.jsonl", "id": 68931, "text": "1.7, when you interact with other players through text, pictures, voice, or other multimedia files in the game, we may collect and save the above information content you send to filter pornography, violence, politics, abuse, maliciousImproper content such as advertising to purify the game environment and maintain a healthy Internet environment.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and save the content of the interactive information you sent to filter improper content such as pornography, violence, politics, abuse, and malicious advertisements."}
{"task": "rw_95.jsonl", "id": 68932, "text": "1.8, in order to realize the interactive function that depends on the development of user movements, we will use your sensor information (gyroscope) to determine your operation and supply function to carry out the next behavior, for example: at the hero details interface and battlefield heroDuring the skill display, make the object follow the effect of the mobile phone shaking.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your sensor information to determine your operational function supply function to carry out the next behavior."}
{"task": "rw_95.jsonl", "id": 68933, "text": "When you open the H5 webpage (such as some pages of micro-communities, security centers, activities-hot spots, etc.) in this product, we will collect the acceleration sensor information of your equipment in order to identify and adapt your device to the horizontal and vertical screen statusEssence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the acceleration sensor information of the device through the H5 webpage to identify and adapt the device to the horizontal and vertical screen."}
{"task": "rw_95.jsonl", "id": 68934, "text": "1.9, to provide you with positioning functions based on positioning functions (regional chat channels, nearby players matching, theater rankings), we will collect your geographical location information (including your nearby Wi-Fi, nearby base stations, that is, Cellid))Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your geographical location information to provide you with positioning functions."}
{"task": "rw_95.jsonl", "id": 68935, "text": "Geographical location information is a sensitive personal information. Rejecting to provide this information can only cause you to unable to use the corresponding positioning game function, but it does not affect other functions of your normal use of the game.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide geographical information can only cause you to be unable to use the corresponding positioning game function, not affect other functions."}
{"task": "rw_95.jsonl", "id": 68936, "text": "1.10, if you copy the in -game information for sharing, or receive the information shared in the product, we need to visit your shear plate locally, read the password, redemption code and other related information for it forRealize the functions of welfare acquisition, activity participation and sharing.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "We need to visit your shear plates locally and collect the information shared in it to achieve functions such as welfare acquisition, activity participation and sharing."}
{"task": "rw_95.jsonl", "id": 68937, "text": "We will only read the information related to our services to complete the verification and do not store such information.", "label": ["Data Retention", "Important", "Usage"], "rewrite": "Read only information related to the service to complete the verification without retention."}
{"task": "rw_95.jsonl", "id": 68938, "text": "We will not collect other unrelated information in your shear board.", "label": ["Important", "First Party Collection Information"], "rewrite": "We will not collect other unrelated information in your shear board."}
{"task": "rw_95.jsonl", "id": 68939, "text": "1.11, we may collect your mobile phone number when you actively provide for the results of the results of your participating activities and the reward distribution of the event, the report of the game failAgree to push you information and open the operator's related rights and interests.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the mobile phone number you proactively provided, the results of the results of the activity, the report of the game failure, the feedback and communication information of the consultation, and the push information."}
{"task": "rw_95.jsonl", "id": 68940, "text": "1.12, if you contact our customer service, we may need you to provide the necessary personal information for authentication to ensure your account security.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "When contacting customer service, collect personal information for authentication to ensure account security."}
{"task": "rw_95.jsonl", "id": 68941, "text": "In order to provide services in accordance with your demand, after your authorization, artificial customer service personnel need to inquire or verify your relevant information within the scope of your authorization. We will adopt technical and management measures as much as possible to ensure your information security and confidentiality.Use within the range.", "label": ["Important", "Usage"], "rewrite": "Artificial customer service staff will inquire or verify your relevant information to you within your authorization range."}
{"task": "rw_95.jsonl", "id": 68942, "text": "We may also save your contact information (the mobile phone number, WeChat, QQ number or other contact information you use or actively provided), your communication records and content with us, and other necessary information to provide youRecord customer service, specifically the information you actually authorize and provide.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your contact information, your communication records and content, and other necessary information for customer service."}
{"task": "rw_95.jsonl", "id": 68943, "text": "1.13, when you participate in our product marketing and promotion research activities, we may collect your name, communication address, contact information, or other information you filled in by questionnaires or inviting you to fill in in order to fulfill you in order to fulfill youAnd distribution activity rewards.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect names, communication addresses, contact information, or other information that you actively fill in in order to achieve and distribute activity rewards."}
{"task": "rw_95.jsonl", "id": 68944, "text": "When we are held by us and our affiliates, we may synchronize related information in products or services operated by multiple related parties and related parties to ensure that you get a complete event experience.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When organizing activities with related parties, synchronize related information with it."}
{"task": "rw_95.jsonl", "id": 68945, "text": "For details, please refer to the separate explanation of the activity page.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68946, "text": "1.14 In order to collect the above information to achieve the corresponding game functions and business scenarios, we may apply to you in specific business scenarios to apply for some system permissions, and you can choose whether to authorize.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68947, "text": "These system permissions include:", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68948, "text": "Android-telephone (only device for Android, 10 below equipment): Get the equipment identifier (IMEI/IMSI) for account security risk control and fault investigation;", "label": ["Permission Acquisition", "Important"], "rewrite": "Get Android-telephone permissions for account security risk control and fault investigation, identify mobile phone equipment, and ensure operators network-free services."}
{"task": "rw_95.jsonl", "id": 68949, "text": "Read the phone status to identify mobile phone equipment and ensure operators network -free services.", "label": ["Usage"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68950, "text": "Android-storage permissions/, iOS-, photo: providing pictures or videos (including cache), uploading, downloading and sharing functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get Android-storage permissions/ iOS-photo permissions to provide pictures or videos (including cache), uploading, downloading and sharing functions."}
{"task": "rw_95.jsonl", "id": 68951, "text": "Android-microphone/, ios-, microphone: Provides in-game voice communication.", "label": ["Permission Acquisition", "Important"], "rewrite": "Get Android-microphone/ iOS-microphone permission to provide in-game voice communication."}
{"task": "rw_95.jsonl", "id": 68952, "text": "Android-location/, iOS-, positioning service: provides game services based on positioning functions, such as teams, nearby players, custom location display, regional ranking.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get Android-Location/ iOS-Positioning Service to provide game services based on positioning functions."}
{"task": "rw_95.jsonl", "id": 68953, "text": "iOS-Local Network: Inspection of local network environmental security, local network connection status, and network speed measurement.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get iOS-local network permissions to detect the environmental security of the local area network, the status of the LAN connection, and the speed measurement of the network."}
{"task": "rw_95.jsonl", "id": 68954, "text": "The above permissions will not be opened by default, and we will only apply for the above permissions in specific business scenarios.", "label": ["Permission Acquisition", "Important"], "rewrite": "We will only apply to you in specific business scenarios to apply for phone calls, microphones, and location permissions without default."}
{"task": "rw_95.jsonl", "id": 68955, "text": "Rejecting the above permissions will only affect the specific game functions and business scenarios associated with it, and will not affect your use of other game functions.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68956, "text": "Please understand that due to the reasons of different terminal equipment operating systems, the permissions names on different terminals will be different.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68957, "text": "You can manage system permissions through the terminal [set,-, foundation,-, others].", "label": ["Edit/Control", "Important"], "rewrite": "You can manage system permissions through the terminal [Settings -Basic -Other]."}
{"task": "rw_95.jsonl", "id": 68958, "text": "1.15, for the HTML5, or Flash pages in this game product, in order to achieve statistical access, optimize the effect of webpage, record login and operation, it is convenient for you to complete the repeated login and access.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Statistical access volume, optimizing webpage effects, record login and operation through HTML5 or Flash pages."}
{"task": "rw_95.jsonl", "id": 68959, "text": "We will use COOKIE or labels and scripts to collect similar technologies including Internet protocols, (IP), address, browser type, Internet service providers, reference/exit page, operating system, date/time stamp, and/or click flow data.We will not associate the automatic collection log data with other information we collected. You can remove the information by clearing the cache method of the browser/game.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "The log data is automatically collected through cookies or equivalent technologies, but it will not be associated with other information, and this information can be removed by removing the cache method of the browser/game."}
{"task": "rw_95.jsonl", "id": 68960, "text": "1.16 According to relevant laws and regulations and national standards, in the following situations, we may collect or use your relevant personal information without soliciting your authorization consent:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68961, "text": "1) To fulfill the statutory duties or the requirements of the statutory volunteer;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_95.jsonl", "id": 68962, "text": "2) In order to deal with emergencies, or in urgent situations, it is necessary to protect the health and property safety of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_95.jsonl", "id": 68963, "text": "3) Treatment of personal information on personal or other legal disclosure in accordance with the laws and regulations within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In accordance with laws and regulations, personal information is processed by individuals or other legal disclosure within a reasonable range, and no authorization consent is required."}
{"task": "rw_95.jsonl", "id": 68964, "text": "4) It is necessary for the contract to establish and fulfill your contract as a party;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to set up and fulfill your collection and use information for the contract as a party, no need to solicit authorization."}
{"task": "rw_95.jsonl", "id": 68965, "text": "5) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_95.jsonl", "id": 68966, "text": "1.17, please understand that the functions and services we provide to you are constantly updated and developed. If a function or service is not in the aforementioned instructions and collects your information, we will use page prompts, interactive processes, website announcements, website announcementsTo explain the content, scope and purpose of information collection to you to obtain your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If a function or service exceeds the scope of the instructions, we will explain to you the situation of information collection to obtain your consent."}
{"task": "rw_95.jsonl", "id": 68967, "text": "1.18, currently, in addition to collecting game survey information from a third -party research agency to help us improve the game products and provide services that are suitable for you, and the situation that this guidelines have clearly explained, we will not take the initiative to obtain your personal information from a third party from a third party.Essence", "label": ["Important", "First Party Collection Information"], "rewrite": "In addition to collecting game survey information from a third -party research agency, we will not take the initiative to obtain your personal information from a third party."}
{"task": "rw_95.jsonl", "id": 68968, "text": "If the business development needs to obtain and process your personal information from a third party in the future, we will strictly abide by the provisions of relevant laws and regulations, asking the third party to obtain your consent and ensure the legitimacy of the information it provides.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you need to obtain and process your personal information from a third party, we will ask the third party to obtain your consent and ensure the legitimacy of the information."}
{"task": "rw_95.jsonl", "id": 68969, "text": "2. Personal information sharing, transfer and public disclosure", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68970, "text": "2.1 Personal information sharing", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68971, "text": "Except for this guideline and the situation stipulated by the Tencent Game License and Service Agreement, without your consent, we will not actively share your personal information until the third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In addition to this guideline and the situation stipulated by the Tencent Game License and Service Agreement, we will get your consent before sharing."}
{"task": "rw_95.jsonl", "id": 68972, "text": "If you have other personal information that shared your personal information or you need us to share your personal information into a third party to surpass the original authorization purpose, we will directly or indirectly obtain your consent of your behavior through this third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If there are other personal information or surpassing the original authorization purpose, we will directly or indirectly obtain your explicit consent of the above behavior."}
{"task": "rw_95.jsonl", "id": 68973, "text": "In order to achieve specific purposes, the scene of sharing information with third parties is as follows:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68974, "text": "1) Minor protection", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68975, "text": "In order to better protect the physical and mental health of minors and promote the healthy Internet access of minors, we will inform their guardians after discovering suspected minors consumption or receiving legal guardians' requests, Reminder, confirmation and processing.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "If we find suspected minors consumption or receive a request to be legitimate guardian, we will informed the guardian of the game -related consumption records and usage."}
{"task": "rw_95.jsonl", "id": 68976, "text": "For the collection of personal information of minors, please refer to Article 7 of this guideline.", "label": ["Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "For the collection of personal information of minors, please refer to Article 7 of this guideline."}
{"task": "rw_95.jsonl", "id": 68977, "text": "2) Related product services", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68978, "text": "When you use other products or services operated by Tencent (\"related products\"), after you are clearly authorized, we will bind the account number you choose this game product with related products andThe avatar, record, or other information you authorize are shared with related products to show you or other users in the affiliated product, so that you can participate in game welfare activities in related products, and receive corresponding benefits.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "When you use related products, you will share with related products and display your authorized information in order to participate in game welfare activities in related products."}
{"task": "rw_95.jsonl", "id": 68979, "text": "Specific personal information collection and use rules will synchronize with you when you bind your account, and complete your account binding and information sharing after obtaining your authorization consent.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68980, "text": "You can check and manage your game historical information authorization based on the prompts, or choose whether to show your game historical information to other users.", "label": ["Edit/Control", "Important"], "rewrite": "You can check and manage your game historical information authorization on the related product [Settings] page according to the prompts."}
{"task": "rw_95.jsonl", "id": 68981, "text": "Refusaling does not affect your functions of using this product and related products.", "label": ["Edit/Control", "Important"], "rewrite": "The authorization of rejection of game history information does not affect your functions of using this product and related products."}
{"task": "rw_95.jsonl", "id": 68982, "text": "3) Third -party service", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68983, "text": "In order to ensure the safe and stable operation of the game and achieve specific functions, some services in Tencent Games are provided by our affiliates or other third parties.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68984, "text": "We will choose third -party and third -party services, urge relevant third parties to collect and use your personal information in accordance with this guideline or the agreement reached with you, and take appropriate security technology and management measures to ensure your personal information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68985, "text": "For the specific situation of the third -party information sharing of this product, please refer to the \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\").", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "For the specific situation of the third -party information sharing of this product, please refer to the \"Third -Party Information Sharing List\" (including \"Third -Party SDK Catalog\")."}
{"task": "rw_95.jsonl", "id": 68986, "text": "4) Statistical analysis and research", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68987, "text": "In order to improve our capabilities and technical scientific research capabilities, promote service security and technical level in order to provide users with higher quality services, we will ensure that the purpose is legitimate and data security within a reasonable and necessary scope.Scientific research institutes, universities and other institutions shared data after de -identification or anonymous processing.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Within a reasonable and necessary scope, we shared unatable personal identity data with research institutions, research institutes, universities and other institutions, and ensure that the purpose of use and data security."}
{"task": "rw_95.jsonl", "id": 68988, "text": "Without your clear authorization, we will not share with the above agencies that can be used to identify your personal identity information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We shared your personal identification information with research institutions, research institutes, and universities to identify your personal identity."}
{"task": "rw_95.jsonl", "id": 68989, "text": "2.2 Public information disclosure", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68990, "text": "Except for this guideline and the \"Tencent Game License and Service Agreement\" and \"Guidelines for Privacy Protection of Tencent Games\", we will not disclose the personal information collected publicly to the outside world.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68991, "text": "If we must disclose publicly, we will inform you that the purpose of the public disclosure, the type of disclosure information, and the sensitive personal information that may be involved, and obtain your explicit consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the scope of public disclosure beyond this guideline, \"Tencent Game License and Service Agreement\" and \"Guidelines for Privacy Property Protection of Tencent Games\", we will inform you the specific situation of disclosure and obtain your explicit consent."}
{"task": "rw_95.jsonl", "id": 68992, "text": "Please note that if you are dealt with in violation of the \"Tencent Game License and Service Agreement\" during the use of Tencent's game or any violations of laws and regulations, we may announce the results and disclose relevant account information in the announcement.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may announce the results of your violation of the game agreement or violations of laws and regulations, and disclose relevant account information."}
{"task": "rw_95.jsonl", "id": 68993, "text": "2.3 Personal information transfer", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68994, "text": "Without your authorization, we will not transfer your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Without your authorization, we will not transfer your personal information to a third party."}
{"task": "rw_95.jsonl", "id": 68995, "text": "With the continuous development of our business, we may conduct merging, acquisition, asset transfer and other transactions. We will inform you that the relevant situation will continue to protect or request new processors to continue in accordance with the laws and regulations and not lower than the standards required by this guideline.Protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If business mergers, acquisitions, asset transfer and other transactions will be informed of the relevant situation, and it will continue to protect your personal information in accordance with laws and regulations and not lower than the standards required by this guideline."}
{"task": "rw_95.jsonl", "id": 68996, "text": "3. Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68997, "text": "3.1 The method and period of information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 68998, "text": "We will store your information in a safe way, including local storage (such as using APP for data cache), database and server logs.", "label": ["Data Retention", "Important"], "rewrite": "Store your information through local storage, database and server logs."}
{"task": "rw_95.jsonl", "id": 68999, "text": "Under normal circumstances, we will only store your personal information within the time necessary for the purpose of service to achieve service purposes or under the conditions of laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "Generally, your personal information is retained within the time limit required to achieve service purposes, unless the law has other requirements."}
{"task": "rw_95.jsonl", "id": 69000, "text": "After the previous period expires, we will delete or treat your personal information.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, you will delete your personal information or perform anonymous processing."}
{"task": "rw_95.jsonl", "id": 69001, "text": "We judge the storage period of personal information. The following standards are mainly referred to the following standards and the elders are based on the elders:", "label": ["Data Retention", "Important"], "rewrite": "We judge the storage period of personal information. The following standards are mainly referred to and are based on the elders: 1) to complete the business functions you agree with; 2) to ensure that we provide you with service security and quality;During the retention; 4) whether there are other regulations for the reserved period; 5) the information stipulated in the laws and regulations that need to be stored within a certain period of time."}
{"task": "rw_95.jsonl", "id": 69002, "text": "1) Complete the business function you agree with;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69003, "text": "2) Ensure that we provide you with service safety and quality;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69004, "text": "3) The longer retention period you agree;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69005, "text": "4) Whether there are other regulations in the retention period;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69006, "text": "5) Laws and regulations require information to be stored within a certain period of time.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69007, "text": "3.2 The area of information storage", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69008, "text": "We will store personal information collected in China in China in accordance with laws and regulations.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_95.jsonl", "id": 69009, "text": "3.3 Notice of the product or service stopping operation", "label": ["Cessation of Operations"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69010, "text": "When our products or services stop operation, we will announce notifications in accordance with relevant laws and regulations and protect your legitimate rights and interests in accordance with the law.", "label": ["Important", "Cessation of Operations"], "rewrite": "When products or services stop operation, we will announce and protect your legitimate rights and interests in accordance with the law."}
{"task": "rw_95.jsonl", "id": 69011, "text": "4. Information security", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69012, "text": "4.1 Safety protection measures", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69013, "text": "We strive to provide protection for users' information security to prevent information leakage, loss, improper use, unauthorized access and disclosure.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69014, "text": "We use multi -directional security protection measures to ensure that user personal information protection is at a reasonable level of security, including technological protection methods, management system control, and security system guarantee.", "label": ["Important", "Data Security"], "rewrite": "We take various measures such as technical protection methods, management system control, and security system guarantee to protect the user's personal information security."}
{"task": "rw_95.jsonl", "id": 69015, "text": "In addition, the relevant system of our game has also passed the record and evaluation of national network security level protection (level three).", "label": ["Important", "Data Security"], "rewrite": "The system has passed the record and evaluation of the national network security level protection (level 3)."}
{"task": "rw_95.jsonl", "id": 69016, "text": "We use industry -leading technical protection measures.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69017, "text": "The technical means we use include but not limited to firewalls, encryption (such as SSL), de -identification or anonymous treatment, access control measures, etc.", "label": ["Important", "Data Security"], "rewrite": "Use technologies such as firewalls, encryption, de -identification or anonymous processing, access control measures, etc. to protect your information."}
{"task": "rw_95.jsonl", "id": 69018, "text": "In addition, we will continue to strengthen the security capabilities of software installed on your device.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69019, "text": "For example, we will complete some information encryption work locally to consolidate security transmission;", "label": ["Important", "Data Security"], "rewrite": "Complete some information encryption work locally."}
{"task": "rw_95.jsonl", "id": 69020, "text": "We will understand the application information and running process information installed by your device to prevent malicious programs such as viruses and Trojans.", "label": ["Important", "Data Security"], "rewrite": "Understand the application information of the device and the process information of the operation to prevent malicious procedures."}
{"task": "rw_95.jsonl", "id": 69021, "text": "We have established a special management system, process and organization that guarantees personal information security.", "label": ["Important", "Data Security"], "rewrite": "Establish a special management system, process and organization that guarantees personal information security."}
{"task": "rw_95.jsonl", "id": 69022, "text": "For example, we strictly restrict the scope of the personnel of the access information, require them to abide by the confidentiality obligations and audit, and those who violate the obligations will be punished in accordance with regulations.", "label": ["Important", "Data Security"], "rewrite": "Strictly restrict the scope of the personnel who access information, and sign a confidentiality agreement with them to punish those who violate the obligations of confidentiality."}
{"task": "rw_95.jsonl", "id": 69023, "text": "We will also review the management system, process and organization to prevent unauthorized personnel from accessing, using or disclosing users' information.", "label": ["Important", "Data Security"], "rewrite": "The review management system, process and organization to prevent information about unauthorized access, use or disclosure of users."}
{"task": "rw_95.jsonl", "id": 69024, "text": "We recommend that you pay full attention to the protection of personal information when using products and services, and we will also provide multiple security functions to help you protect your personal information security.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69025, "text": "4.2 Safety event disposal measures", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69026, "text": "If personal information leaks and other security incidents occur, we will start emergency plans to prevent security incidents from expanding.", "label": ["Important", "Data Security"], "rewrite": "We will start emergency plans to deal with personal information security incidents."}
{"task": "rw_95.jsonl", "id": 69027, "text": "After the security incident occurs, we will inform you the basic situation of the security incident in the form of announcement, push notification or email, we are about or already adopted, and our proposals for your response.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform you the basic situation of the incident, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_95.jsonl", "id": 69028, "text": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods.", "label": ["Important", "Data Security"], "rewrite": "If it is difficult to achieve one by one, we will issue warnings through announcement and other methods."}
{"task": "rw_95.jsonl", "id": 69029, "text": "5. Your rights", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69030, "text": "During your use of this game product service, we may provide you with corresponding operation settings depending on the specific situation of the game product so that you can inquire, copy, correct, supplement, delete, or withdraw or withdraw your relevant personal information.", "label": ["Important", "Edit/Control"], "rewrite": "You can set up query, copy, correct, supplement, delete or withdraw your relevant personal information."}
{"task": "rw_95.jsonl", "id": 69031, "text": "In addition, we have set up a complaint report channel, and your opinions will be dealt with in a timely manner.", "label": ["Edit/Control", "Important"], "rewrite": "Your opinion will be dealt with in a timely manner through complaint report channels."}
{"task": "rw_95.jsonl", "id": 69032, "text": "5.1 Personal information collection and use rules query", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69033, "text": "You can check the product collection and use rules at any time in [settings,-, foundation,-, other] interface in this product, including but not limited to this guideline, \"Third-Party Information Sharing List\", and the rules of use of product sensitivity permissions.And authorization.", "label": ["Important", "Edit/Control"], "rewrite": "View product personal information collection and use rules in [Settings -Basic -Other] interface."}
{"task": "rw_95.jsonl", "id": 69034, "text": "Please know and understand that the service and corresponding personal information collection and usage in this guideline may be different because of the specific services you choose to use, as well as factors such as the equipment models and system versions you use.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69035, "text": "5.2 Personal information query, correction", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69036, "text": "1), you can, in the main interface [avatar (personal information)] in this product, or through [Settings,-, Basic,-, Comprehensive, Customer Service] inquiriesNicknames, and other personal information you choose to fill in), game historical information (such as character levels, achievements, records, and specific game information of the product).", "label": ["Important", "Edit/Control"], "rewrite": "In the main interface [avatar (personal data)], or through [Settings -Basic -Comprehensive -customer service] to query and access your account basic information and game historical information."}
{"task": "rw_95.jsonl", "id": 69037, "text": "2), you can check through the WeChat Mini Program Tencent Health System to query your real -name information (name, ID number) corresponding to the WeChat account of Tencent Games or QQ account.", "label": ["Important", "Edit/Control"], "rewrite": "Inquire the real -name information corresponding to the account used to log in to the game through the WeChat Mini Program Tencent Health System."}
{"task": "rw_95.jsonl", "id": 69038, "text": "If you find that the real -name information of the query is wrong, you can apply for modification and certification in Tencent's health system.", "label": ["Important", "Edit/Control"], "rewrite": "You can apply for the wrong real -name information in the Tencent Health System."}
{"task": "rw_95.jsonl", "id": 69039, "text": "But please note that in order to ensure the stability and security of the account, prevent illegal theft and transfer account, the frequency of real -name authentication modification will be limited. For specific rules, please see the Tencent Health System page description.", "label": ["Important", "Edit/Control"], "rewrite": "Limit the frequency of real -name authentication modification to ensure the stability and security of the account."}
{"task": "rw_95.jsonl", "id": 69040, "text": "3) In this product, you can query more information about your use of this game product and service according to the prompts according to the actual situation. Please see the [Settings] interface description of this product.", "label": ["Important", "Edit/Control"], "rewrite": "For more information about using this game product and service, please refer to the [Settings] interface description."}
{"task": "rw_95.jsonl", "id": 69041, "text": "4) If you have other needs for personal information inquiry, replication, correction, and supplementation, you can also contact us through the contact information described in Article 9 of this guideline.", "label": ["Important", "Edit/Control"], "rewrite": "You can contact us with other applications about personal information inquiry, replication, correction, and supplement."}
{"task": "rw_95.jsonl", "id": 69042, "text": "But please note that when you contact us to apply for personal information rights response, in order to ensure account number and personal information security, we may verify your identity and account security status.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may verify your application and respond to your application for your identity, account security status, etc."}
{"task": "rw_95.jsonl", "id": 69043, "text": "We will support your reasonable request.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69044, "text": "But under the situation of our personal information storage scope, exceeding the reasonable limit, or response to your request, we may not be able to respond to your application in the case of serious damage to your or other third -party legitimate rights and interests.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may not be able to respond to requests that exceed the storage range, exceed the reasonable limit, or the legitimate rights and interests of personal information subjects or other individuals and organizations will be seriously damaged."}
{"task": "rw_95.jsonl", "id": 69045, "text": "5.3 Personal information display and sharing", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69046, "text": "1), your game account basic information (avatar, nickname, character level) will be displayed on your personal homepage, the ranking or related functions you participate in.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "The basic information of your game account will be displayed on the personal homepage, the ranking or related functions."}
{"task": "rw_95.jsonl", "id": 69047, "text": "2), your game opposite and historical information (specifically include but not limited to your historical record/game records, friends watching, battle information/status, achievement information, rankings, ranking) will beOr a friend show.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your game pair and historical information will be displayed according to your choice."}
{"task": "rw_95.jsonl", "id": 69048, "text": "The game product provides you with the way to close the display, so that you can set the relevant information about whether the relevant information described publicly in public. For details, please see [Settings,-, Basic,-, Comprehensive].", "label": ["Important", "Edit/Control"], "rewrite": "For details, please refer to [Settings -Basic -Comprehensive]."}
{"task": "rw_95.jsonl", "id": 69049, "text": "3), the information you uploaded or published in this game product, or the information you actively shared, will display the users within the scope of the publishing or shared.", "label": ["Edit/Control", "Important"], "rewrite": "The information you uploaded or published by yourself and the information shared by the outside world will be displayed within the scope of your choice."}
{"task": "rw_95.jsonl", "id": 69050, "text": "4) When you authorize third parties to obtain your information in the game, the third party will disclose your relevant information to you or other users of the third party within your authorization range.", "label": ["Important", "Edit/Control"], "rewrite": "The third party will disclose your relevant information to you or other users of the third party within your authorization range."}
{"task": "rw_95.jsonl", "id": 69051, "text": "For specific display rules and public scope settings, please pay attention to the rules of the third -party platform.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69052, "text": "5.4 Personal information collection and use of authorization changes", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69053, "text": "You can change the equipment permissions obtained by deleting information, closing or opening specific product functions, closing or opening a specific product acquisition (the specific permissions are different due to the different equipment models and system versions used by the user).Scope of authorization.", "label": ["Important", "Edit/Control"], "rewrite": "The scope of the authorization of the authorization of equipment permissions can be changed by deleting information, closing or turning on specific product functions, closing or turning on the equipment authority obtained by specific products."}
{"task": "rw_95.jsonl", "id": 69054, "text": "After withdrawing authorization, you may not be able to use the authorized product function, but do not affect the use of other functions.", "label": ["Important", "Edit/Control"], "rewrite": "You may not be able to use the corresponding product function of the change, but it does not affect the use of other functions."}
{"task": "rw_95.jsonl", "id": 69055, "text": "You withdraw authorization will not affect the effectiveness of personal information processing activities based on your authorization before withdrawal.", "label": ["Edit/Control", "Important"], "rewrite": "Withdrawal authorization will not affect personal information processing based on previous authorization."}
{"task": "rw_95.jsonl", "id": 69056, "text": "Some personal information collection and use of the basic functions corresponding to our services. If you want to withdraw the authorization of relevant personal information collection and use may cause us to be unable to provide you with services. In this case, if you still want to withdraw the relevant authorization, you can pass it throughApply for account cancellation to achieve the demand.", "label": ["Important", "Edit/Control"], "rewrite": "If the authorization of the withdrawal of basic functions, if the service cannot be provided, the relevant authorization may be withdrawn by canceling the account."}
{"task": "rw_95.jsonl", "id": 69057, "text": "For example, based on laws and regulations, real -name authentication must be performed using game services. If you want to withdraw the authorization of our collection of real -name authentication information, we require us to delete your real -name authentication information. We may not be able to continue to provide you with basic service products.", "label": ["Important", "Edit/Control"], "rewrite": "The authorization of the withdrawal collection of real -name authentication information requires deleting real -name authentication information to cause the unable to continue to provide basic services."}
{"task": "rw_95.jsonl", "id": 69058, "text": "5.5 Account Logging out", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69059, "text": "You can apply for account cancellation in [settings,-, the foundation,-, other,-, game account cancellation].", "label": ["Important", "Edit/Control"], "rewrite": "In [Settings -Basic -Other -Game Account Logging up] Application for account cancellation."}
{"task": "rw_95.jsonl", "id": 69060, "text": "When you apply for account cancellation, we will verify your identity, account security status, and cancellation conditions. For details, please read the instructions in the product cancellation process carefully and the \"Game Account Logging out\".", "label": ["Important", "Edit/Control"], "rewrite": "When canceling the account, you will verify your identity, account security status, and cancellation conditions."}
{"task": "rw_95.jsonl", "id": 69061, "text": "After completing the cancellation of the game account, in addition to the laws and regulations or this agreement, your personal information under the game will delete or anonymous processing, and the related products and services that have previously related to the game account will no longer be associated.Essence", "label": ["Important", "Edit/Control"], "rewrite": "After the game account is canceled, the personal information under the game account will be deleted or anonymous, and it is no longer associated with related products and services."}
{"task": "rw_95.jsonl", "id": 69062, "text": "Once the game account is canceled, it will not be recovered, please do it carefully.", "label": ["Important", "Edit/Control"], "rewrite": "Once the cancellation is completed, it will not be restored."}
{"task": "rw_95.jsonl", "id": 69063, "text": "6. Change", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69064, "text": "We may revise this guidelines in a timely manner.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69065, "text": "When the personal information collection and use rules and other laws and regulations are changed, we will prompt you the guidance after the version is updated in an appropriate manner.", "label": ["Policy Change", "Important"], "rewrite": "When the privacy policy version is updated, we will prompt you the guidance after the change."}
{"task": "rw_95.jsonl", "id": 69066, "text": "Please read the change of privacy protection or guidelines after the change. You continue to use Tencent Games to indicate that you agree to collect, process or use your personal information according to the updated privacy protection guidelines.", "label": ["Policy Change", "Important", "Risk"], "rewrite": "Continue to use Tencent Games to agree to the updated privacy protection guidelines."}
{"task": "rw_95.jsonl", "id": 69067, "text": "7. Minor protection", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69068, "text": "We attach great importance to the protection of personal information of minors and continue to explore better personal information protection methods for minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69069, "text": "If you are the legal guardians of the minor, please pay attention to whether the minors you monitor use your authorized consent to use the service of Tencent games or provide personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian is requested to pay attention to whether the minor uses the service of Tencent games or provide your personal information to obtain your authorization consent."}
{"task": "rw_95.jsonl", "id": 69070, "text": "If you have doubts about the personal information of the minors you monitor, please contact us through the contact information in Article 9.", "label": ["Specific Audiences", "Important"], "rewrite": "If you have any questions about the personal information of the guardian, please contact us."}
{"task": "rw_95.jsonl", "id": 69071, "text": "In particular, if you are a child under the age of 14, in order to protect the personal information of children, we have also released the \"Guidelines for Privacy Protection of Children of Tencent Games\".", "label": ["Specific Audiences", "Important"], "rewrite": "We also released the \"Guidelines for Privacy Protection of Tencent Game Children\" is suitable for children under the age of 14."}
{"task": "rw_95.jsonl", "id": 69072, "text": "Children and their guardians should also read the \"Guidelines for Privacy Property Protection for Children in Tencent Games\" before using Tencent game services.", "label": ["Specific Audiences", "Important"], "rewrite": "Children and their guardians should read the \"Tencent Game Child Privacy Protection Guide\" and then use Tencent Game services."}
{"task": "rw_95.jsonl", "id": 69073, "text": "You can use Tencent game services only after obtaining the guardian's guidelines and the \"Guidelines for Privacy Protection of Tencent Game Children\".", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Only the guardian agrees to the guidelines and the \"Guidelines for Privacy Protection of Tencent Game Children\" can children use Tencent Game services."}
{"task": "rw_95.jsonl", "id": 69074, "text": "We will actively protect the legitimate rights and interests of minors by enabling the anti -addiction system in accordance with the requirements of national defense addiction policies.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69075, "text": "We will verify the real -name information of the real -name identity and other information through the Tencent Health System whether the real -name information of the relevant account is a minor, and then decide whether the account is included in the anti -addiction system.", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "Determine whether it is a minor through information such as the real -name identity of the Tencent Health System to determine whether it is incorporated into the anti -addiction system."}
{"task": "rw_95.jsonl", "id": 69076, "text": "In addition, we will collect information such as your login time and game duration. By automatic intervention from the system level and restricting minors' game time and enabled offline functions, we will guide the rational game of minors.After consumption, try to contact the guardian to remind, confirm and deal with it to help minors to access the Internet.", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Collect information such as login time, game duration, etc., automatically intervention and restrict the game time of minors at the system level, enable the forced offline function, and contact their guardian after suspected minors consumption."}
{"task": "rw_95.jsonl", "id": 69077, "text": "In order to better protect the physical and mental health of minors and promote the healthy access of minors, we may implement more stringent anti -addiction measures on the basis of the state's relevant national online game anti -addiction policy regulations.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69078, "text": "At the same time, we also continue to study and test new technologies that protect minors.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69079, "text": "In order to further improve the accuracy of real -name authentication and maximize the prevention of minors from using the identity information of others, Tencent Health System may be targeted at some users (based on specific game strategies)., Or, including the game recharge, consumption, or transaction during the game), enable face recognition verification identity. When the face recognition is used, the Tencent Health System will log in to the WeChat or QQ account that you currently log in and use) Obstock and collect your real identity information for your identity test.", "label": ["Specific Audiences", "Important", "First Party Collection Information", "Risk", "Usage"], "rewrite": "When using face recognition, use Tencent Health System to collect real identity information for identity verification to further improve the accuracy of real -name authentication."}
{"task": "rw_95.jsonl", "id": 69080, "text": "When using the face recognition function, Tencent Health System will apply for your device camera/camera permissions through WeChat or QQ to complete the face recognition.", "label": ["Permission Acquisition", "Specific Audiences", "Usage", "Important"], "rewrite": "Tencent Health System will call the device camera/camera right to complete face recognition."}
{"task": "rw_95.jsonl", "id": 69081, "text": "The above -mentioned face recognition verification mainly compares the user's real facial information with the data source of the authoritative data platform of the Public Security. If the two comparison results are consistent, that is, successfully pass the certification, and match the corresponding game time limit according to the actual age group of the user.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Usage", "Important"], "rewrite": "Face recognition results are used to match the corresponding game time limit according to the actual age group."}
{"task": "rw_95.jsonl", "id": 69082, "text": "If the result is inconsistent or the user refuses to verify, we will uniformly regard them as a 12 -year -old and below minor and include the corresponding anti -addiction supervision.", "label": ["Specific Audiences", "Important"], "rewrite": "Face recognition verification results do not match or refuse to verify, you will be regarded as a minor 12 years old and below."}
{"task": "rw_95.jsonl", "id": 69083, "text": "Related verification data for face recognition is only used to compare with the authoritative data platform of public security after encryption, and we will not keep it.", "label": ["Data Retention", "Specific Audiences", "Usage", "Important"], "rewrite": "Human face recognition related verification data is only used to compare with the data source of the Public Security's authoritative data platform after encryption without retention."}
{"task": "rw_95.jsonl", "id": 69084, "text": "In addition, we may also collect the game behavior data you generated during the game through the Tencent Health System (such as the click pressure and radius formed by the end device to operate the game, the relative position, the acceleration direction, the gravity direction and other data, and the direction of the acceleration, the direction of gravity direction, and the direction of gravity, andYou can build an algorithm model by interacting with other players in the game through online voice and other methods to interact with other players and preliminarily determine whether you are minors (in terms of voice data, just the system randomly through yourPartial online voice is judged whether children or adults).", "label": ["Specific Audiences", "First Party Collection Information", "Usage", "Important"], "rewrite": "Collect game behavior data construction algorithm model and preliminary judgment whether you are minors based on real -time behavior."}
{"task": "rw_95.jsonl", "id": 69085, "text": "If you preliminate your behavior characteristics and the age of real -name information, Tencent Health System may be verified in accordance with the aforementioned regulations.", "label": ["Specific Audiences", "Usage", "Important"], "rewrite": "When the preliminary judgment of the characteristics of the behavior and the age of the real -name information are not matched, we will use face recognition to verify."}
{"task": "rw_95.jsonl", "id": 69086, "text": "We will only collect and use this information for the purpose of minors' defense.", "label": ["Usage", "First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69087, "text": "We have also established a growth guard platform.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69088, "text": "The growth guardian platform can help parents or guardians understand the child's game situation at any time, set up the consumption limit and daily game duration and period, and assist parents or guardians of the minors to protect the harm of bad game habits.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69089, "text": "You can click here to learn more about the Tencent game anti -addiction system and growth guardianship platform.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69090, "text": "At the same time, we have also established a minor active service platform that tried to contact the guardian to remind, confirm and deal with after the suspected minor consumption. You can contact us through the minor education consultation line, 0755-83761852.", "label": ["Specific Audiences", "Contact Information", "Important"], "rewrite": "Minor Education Consultation Line: 0755-83761852"}
{"task": "rw_95.jsonl", "id": 69091, "text": "8. Others", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69092, "text": "The \"Guidelines for Privacy Protection of Tencent Games\" is a general privacy clause for Tencent Games uniformly. The content stipulated in it includes but not limited to user rights and information security measures, which are suitable for Tencent game users.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69093, "text": "For example, the \"Guidelines for the Privacy Property Protection of Tencent\" is inconsistent or contradictory with this guideline, please refer to this guidance.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69094, "text": "\"Guidelines for Privacy Property Privacy of Tencent Games\" is a personal information protection rule for children under 14 years of age.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69095, "text": "In the scope of \"Guidelines for the Privacy Protection Protection of Tencent Games\", if there are inconsistent or contradictory with the \"Guidelines for Tencent Game Privacy Protection\" and this guideline, please refer to the \"Guidelines for Privacy Protection of Children in Tencent\".", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69096, "text": "9. Contact us", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69097, "text": "We have set up a special person in personal information protection team and personal information protection person. If you have any questions or complaints or suggestions on the privacy policy or personal information protection related matters, you can contact us in the following ways:", "label": ["Important", "Contact Information"], "rewrite": "We have set up a special person in personal information protection team and personal information protection person. You can contact us through the following ways:"}
{"task": "rw_95.jsonl", "id": 69098, "text": "1) You can fill in personal information and privacy issues and contact us;", "label": ["Important", "Contact Information"], "rewrite": "Fill in personal information and privacy issues and contact us;"}
{"task": "rw_95.jsonl", "id": 69099, "text": "2) Send the problem to dataprivacy@tencent.com;", "label": ["Important", "Contact Information"], "rewrite": "Send the problem to dataprivacy@tencent.com;"}
{"task": "rw_95.jsonl", "id": 69100, "text": "3), contact us through https://kf.qq.com/;", "label": ["Important", "Contact Information"], "rewrite": "Contact us through https://kf.qq.com/;"}
{"task": "rw_95.jsonl", "id": 69101, "text": "4) Mail your question to the following address:", "label": ["Important", "Contact Information"], "rewrite": "Mail the question to the following address: Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Shenzhen, Guangdong Province, China, China Binhai Building data privacy protection department (receiving)"}
{"task": "rw_95.jsonl", "id": 69102, "text": "Tencent Binhai Building, No. 33 Haitian Er Road, Nanshan District, Guangdong Province, China, China, China, China Binhai Building data privacy protection department (closed)", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69103, "text": "Postcode: 518054", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 518054"}
{"task": "rw_95.jsonl", "id": 69104, "text": "We will review the issues involved as soon as possible and answer your request within 15 working days or laws and regulations.", "label": ["Important", "Contact Information"], "rewrite": "A response was given within the period of 15 working days or laws and regulations."}
{"task": "rw_95.jsonl", "id": 69105, "text": "Shenzhen Tencent Computer System Co., Ltd.", "label": [], "rewrite": []}
{"task": "rw_95.jsonl", "id": 69106, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
