{"task": "rw_91.jsonl", "id": 67843, "text": "McDonald's Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67844, "text": "Update and release date: June 29, 2022 Effective Date: June 29, 2022", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67845, "text": "Foreword:", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67846, "text": "Thank you for your trust in the McDonald's brand!", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67847, "text": "Jin Arch (China) Co., Ltd. (China) (McDonald's China \", the registered address is Room 108, Building 1, Building 2, No. 2121, Longteng Avenue, Xuhui District, Shanghai;", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67848, "text": "McDonald's China has attached great importance to the personal information and privacy of protecting users (\"You\").", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67849, "text": "To this end, we hope to help you better understand through \"McDonald's Privacy Policy\" (referred to as \"this policy\"). When you visit or use our products or services or participate in our activities, how do we handle your personal informationAnd the way we provide access, correction, delete and protect these personal information.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67850, "text": "We will operate and manage websites (\"McDonald's Website\" in the mainland), mobile applications (including McDonald's official app, McDonald's official applet, I McDonald's happy small member applet, etc., collectively referred to as \"McDonald's Application\"),Third -party online service platform (including McDonald's Tmall flagship store, Alipay McDonald's official member store, McDonald's Douyin official store, Meituan comment official store, WeChat public account and other platforms, referred to as \"other third -party online platform services\";", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67851, "text": "With the McDonald's website, McDonald's application is collectively referred to as \"network platform\") to provide you with products or services.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67852, "text": "Before using the products or services we provide, read carefully and fully understand this policy (the key content we have bolded the font, please pay special attention), and make a proper choice you think.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67853, "text": "If you have any questions or questions about this policy or related issues related to this policy, or make a complaint or report, you can contact the personal information protection team of McDonald's China Data Management Office (email: enquiry@cn.mcd.com), weWill answer or deal with you as soon as possible.", "label": ["Important", "Contact Information"], "rewrite": "Email: enquiry@cn.mcd.com"}
{"task": "rw_91.jsonl", "id": 67854, "text": "The theme content of each section in this policy is as follows:", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67855, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67856, "text": "2. How can we share, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67857, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67858, "text": "4. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67859, "text": "5. Privacy protection of minors", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67860, "text": "6. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67861, "text": "7. Provide and link to other websites to other websites", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67862, "text": "8. The renewal and scope of this policy", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67863, "text": "Nine, scope of applicable and applicable laws", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67864, "text": "10. Contact us and solve disputes", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67865, "text": "1. How do we collect and use your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67866, "text": "We will follow the principles of legal, correctness, necessary, and integrity. For the following goals described in this policy, collect and use personal information that you actively provide or use our services during the use of services.", "label": ["Important", "Data Security"], "rewrite": "We will follow the principles of legality, justice, necessary, and integrity, and collect and use your personal information for the purpose of this policy."}
{"task": "rw_91.jsonl", "id": 67867, "text": "If we want to use your personal information for other purposes or scenarios that are not stated in this policy, or use the information collected for other purposes based on specific purposes, we will inform you in a reasonable way and obtain it again.Your consent.", "label": ["Important", "First Party Collection Information"], "rewrite": "If we exceed the scope of this policy or collect information based on specific purposes, we will inform you and obtain your consent."}
{"task": "rw_91.jsonl", "id": 67868, "text": "You can check the details in Appendix II \"Personal Information Collection List\".", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67869, "text": "When you use our products or services, your personal information we need or may need to collect and use contains two situations: the first, in order to realize the basic service function of providing you with our product or service, you must authorize us to authorize usCollect and use necessary information.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67870, "text": "If you refuse to provide, you will not be able to use our products or services normally;", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67871, "text": "The second is the information that the additional service function may need to be collected: this information is the information required for non -basic service functions, you can choose whether to authorize us to collect it.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67872, "text": "If you refuse to provide, it will cause the additional service function to be unable to achieve or cannot achieve the effect we intend to achieve, but it will not affect your normal use of basic service functions.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67873, "text": "1. Member account registration and login", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67874, "text": "1.1, when you use McDonald's and register as our members, you need to provide mobile phone numbers to create McDonald's membership account. At the same time, we may verify your identity by sending a SMS verification code to help you complete the registration.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your mobile phone number and think that you create a member account, and at the same time to verify your identity to help you complete the registration."}
{"task": "rw_91.jsonl", "id": 67875, "text": "If you only need to use browse and search services, you don't need to register members and provide the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Only browse and search services do not require registered members and provide mobile phone numbers."}
{"task": "rw_91.jsonl", "id": 67876, "text": "1.2, use the one -click login function when you register or log in to the account. After your consent, and based on our cooperation with the supplier, we will collect your mobile phone number and network operator information, and will the mobile phone number of your device will be collected.As your registration or login, you can provide you with fast registration and login service.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "After authorization, collect your mobile phone number and network operator information and think that you use a one -click recording function."}
{"task": "rw_91.jsonl", "id": 67877, "text": "If you don't want to use a one -click login function, you can choose to register and log in to McDonald's member account.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67878, "text": "1.3, when you register with a third -party platform account or log in to McDonald's application, we will obtain your third -party platform account information from the third -party platform under the premise of obtaining your authorization consent, including the mobile phone you provided to the platform to the platform.The number, as well as the only identification, nickname, avatar, and other information you authorized on the platform, and bind this information with the McDonald's account to identify your identity and facilitate your quick registration or login.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When registering and logging in with a third -party account, access and collect your personal information after your authorization, and bind it."}
{"task": "rw_91.jsonl", "id": 67879, "text": "1.4, if you have registered McDonald's membership account, you need to bind the third -party platform account with the McDonald's account, and we will get you from this third -party platform on the premise of obtaining your authorization consent.The unique logo, nickname, avatar, mobile phone number and other information you who preserved the third -party platform that are preserved;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you bind your third -party platform account with McDonald's account, collect the unique logo, nickname, avatar, mobile phone number or other information of the user authorized by your authorized third -party platform."}
{"task": "rw_91.jsonl", "id": 67880, "text": "If you do not bind, it will not affect your McDonald's member identity, but McDonald's products and/or services you spend on the third -party platform will not be able to accumulate points under the McDonald's member account.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67881, "text": "1.5, when you edit your personal information page, you can fill in or modify your member's nickname, avatar, gender and birth date to improve your member information.", "label": ["Important", "Edit/Control"], "rewrite": "You can fill in or modify your membership nickname, avatar, gender and birth date through personal information page."}
{"task": "rw_91.jsonl", "id": 67882, "text": "You can not provide this information, and it will not affect your basic service functions of your network platform.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67883, "text": "(All the information the above constitutes your member account information)", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67884, "text": "In addition, when you register, if you actively check the \"Join CITIC Youxiang+\" option at the same time, we will transmit your mobile phone number to CITIC Technology Development Co., Ltd. (\"CITIC Technology\")Complete the user registration of CITIC Youxiang+, and CITIC Technology will provide you with CITIC Youxiang+related services and use you in accordance with the \"CITIC Youxiang+User Service Agreement\" and \"CITIC Youxiang+Privacy Policy\".Information.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "When you register, if you actively check the \"Join CITIC Youxiang+\" option at the same time, your number will be shared with CITIC Technology Development Co., Ltd. to complete CITIC Youxiang+registration."}
{"task": "rw_91.jsonl", "id": 67885, "text": "Please read the terms and contents of the CITIC Youxiang+User Service Agreement and \"CITIC Youxiang+Privacy Policy\", and make a choice you think.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67886, "text": "If you do not check the \"Join CITIC Youxiang+\" option, it will not affect your use of McDonald's network platform services based on this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67887, "text": "2. Provide you with order or food delivery service", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67888, "text": "2.1, when you apply through the McDonald's application and use the meal function, we will collect your order information (such as order number, content or service ordered, order time, service store, amount you should pay and payment methods you pay and payment methods you should payTo.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you use the meal function, we will collect your order information."}
{"task": "rw_91.jsonl", "id": 67889, "text": "To facilitate you to quickly find nearby restaurants, under your consent, we will collect your geographical information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect your authorized geographical information so that you can quickly find nearby restaurants."}
{"task": "rw_91.jsonl", "id": 67890, "text": "2.2, when you use the meal delivery service of Magle, we will collect the names, mobile phone numbers, receiving address, and order information of you or your designated consignee.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect the names of you or your designated consignee, mobile phone number, receiving address, and order information to provide food delivery services."}
{"task": "rw_91.jsonl", "id": 67891, "text": "To facilitate you to quickly find nearby restaurants, under your consent, we will collect your geographical information.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67892, "text": "We need to share the consignee information (name, mobile phone number, address), and the necessary information in order information to share with our third -party partners (including delivery platforms, third -party distribution companies and technical partners)The order can be delivered normally.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "We will share with the necessary information in the cooperative third -party shared consignee information and the necessary information in the order information to make the order be delivered normally."}
{"task": "rw_91.jsonl", "id": 67893, "text": "3. Provide you with services to buy, use card vouchers or other goods", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67894, "text": "3.1, when you purchase, exchange or consumer card coupons, we will collect the name of the card vouchers you purchased and/or accept, the date of your purchase and/or receiving card, your card voucher information and your username name", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you buy, exchange or consumer card coupons, collect the name of the card coupon, the date of purchase and/or accepting the card, the card voucher information and your username."}
{"task": "rw_91.jsonl", "id": 67895, "text": "3.2, when you buy our single -purpose commercial prepaid card or use services related to the single -purpose business prepaid card on our online platform, according to the requirements of national laws and regulations, we may also provide you with real -name information.Generally include your phone number and name.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you buy a single -purpose commercial prepaid card or use services related to the single -purpose business prepaid card, we may ask you to provide real -name information (including phone numbers and names)."}
{"task": "rw_91.jsonl", "id": 67896, "text": "Please remind you to remind you to pay attention to the agreement or explanation of the corresponding prepaid card charter.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67897, "text": "4. Provide you with event participation services", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67898, "text": "4.1, if you use the party reservation function booking activities, we will collect your contact telephone number, order information (such as order number, content or service ordered, order time, service store, activity time, amount and amount you should pay and the amount and amount you should pay, the amount and the amount you should pay and the amount and amount you should pay and the amount and the amount you should pay and the amount and the amount and the amount and the amount and the amount and the amount and the amount and the amount and the amount and the amount and the amount you pay.payment method).", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you use the party booking function booking activity, collect your contact telephone number and order information."}
{"task": "rw_91.jsonl", "id": 67899, "text": "In particular, when you help your child register as a McDonald's happy little member through the WeChat mini program of \"I McDonald's Happy Member\", we will also ask you to provide your child's nickname, gender, date of birth, relationship with you and your relationship, and your relationship and your relationship.The store enters the store so that you and your children can participate in the birthday party and theme party we organized. At the same time, it is convenient for us to prepare related items in advance and prepare offline party activities.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When your child is registered as a small member of McDonald's, collect your children's nicknames, gender, birth date and your relationship and enter the store in order to provide birthday meetings and themes."}
{"task": "rw_91.jsonl", "id": 67900, "text": "You can learn how we collect the personal information of the small member of the happy little member by checking the \"Happy Little Member Registration\".", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67901, "text": "If you participate in other interactive activities we may hold, with your consent, we may also ask you to provide additional information. Please shall notify the relevant public information or activity page.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67902, "text": "4.2 In the scenario of McDonald's official applets and Alipay McDonald's official store, we will put welfare or participating in marketing activities through the third -party platform where the applet is located.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67903, "text": "To this end, if you are a user of these third -party platforms, you need to register or bind your McDonald's member account through these third -party platform accounts to receive relevant member benefits or participate in marketing activities.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67904, "text": "To this end, for the purpose of protecting your legitimate rights and interests, preventing fraud, etc., when receiving member welfare or participating in marketing activities, you agree and authorize us to obtain and transmit your third -party platform users from these third -party platforms.The logo, as well as the collection of membership welfare and the information of the nuclear sales.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When receiving membership benefits or participating in marketing activities, collect and transmit the unique logo of your third -party platform user authorized by you, as well as the collection and verification information of member welfare."}
{"task": "rw_91.jsonl", "id": 67905, "text": "4.3, if you participate in online marketing activities we organize, with your consent, we may collect your name, mobile phone number, receiving address (referred to as \"activity information\"), to verify your identity, or or to verify your identity, orTo redeem the prize from you in time, we need to share the necessary information in your activity information with the third -party partner (such as communication operators and third -party distribution platforms).", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "If you participate in online marketing activities, collect the names, mobile phone numbers, and receiving addresses authorized by your authorization to verify your identity or redeem the prize and share the necessary information with a third party."}
{"task": "rw_91.jsonl", "id": 67906, "text": "Refusing to provide you only affects your participation in related activities, but it will not affect your normal use of other functions or services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Refusing to provide your activity information will only affect your participation in related activities, but it will not affect the use of other functions or services."}
{"task": "rw_91.jsonl", "id": 67907, "text": "4.4, if you participate in a survey, investigation or interact with us in various ways, we will collect your relevant information and information related to the theme you may be interested in on the basis of obtaining your consent.Essence", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "If you interact with us, we will collect your relevant information and information related to the topic you may be interested in."}
{"task": "rw_91.jsonl", "id": 67908, "text": "5. Provide you with services to pay, recharge and invoicing", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67909, "text": "5.1 When you place an order or recharge, you can choose the payment services provided by the third -party payment institutions (such as Alipay, WeChat Pay, UnionPay, etc., which are collectively referred to as \"payment institutions, etc.) provided by our payment services.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67910, "text": "In order to realize the needs of payment services, we will collect and share your order number and transaction amount with these payment institutions, the following payment instructions and help you complete the payment.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you place an order or recharge, we will collect your order number and transaction amount and share with your selected payment institutions to help you complete the payment."}
{"task": "rw_91.jsonl", "id": 67911, "text": "5.2, when you open our McDonald's wallet function on our network platform, you must set a trading password to ensure that your transaction is safe.", "label": ["Important", "Data Security"], "rewrite": "Please set a trading password for McDonald's wallet!"}
{"task": "rw_91.jsonl", "id": 67912, "text": "(Article 2-5 The information described all constitutes your \"order information\")", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67913, "text": "6. Provide you with customer service and after -sales service", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67914, "text": "6.1, our customer service will use your membership account information and order information, and other information disclosed in the process of contact with the customer service, in order to contact you or help you solve the problem, or record the processing scheme and results of related issues, or to record related issues and results. Or handle your complaints and reports.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Use your membership account information and order information and other information disclosed in the process of communicating with customer service to help you solve problems, process complaints and reports, etc."}
{"task": "rw_91.jsonl", "id": 67915, "text": "In addition, in order to ensure your account and transaction security, our customer service may use your membership information, order information, name, contact phone number and address to verify your identity with you.", "label": ["Important", "First Party Collection Information", "Data Security", "Usage"], "rewrite": "Customer service may use your member account information, order information, name, contact phone number and address to check you."}
{"task": "rw_91.jsonl", "id": 67916, "text": "In addition, when you communicate with our customer service staff, we will depend on the specific situation, and may require you to provide reasonable and necessary additional information to further respond to your needs, verify your identity, or handle your complaints and reports.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "When you communicate with our customer service personnel, we may need some reasonable additional information depending on the specific situation."}
{"task": "rw_91.jsonl", "id": 67917, "text": "7. Provide you a message notification service", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67918, "text": "7.1, you can obtain information, marketing activities, and other service information related to your order status through the message notification service (including SMS, application push, APP messages, and public account messages).", "label": ["Important", "Usage"], "rewrite": "You can obtain information, marketing activities, and other service information related to your order status through message notification services."}
{"task": "rw_91.jsonl", "id": 67919, "text": "We may collect and use your contact information, order information, equipment information, and share the necessary information in the above information with the supplier of the designated message notification service at the designated information in order to provide you with a message notification service.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your contact information, order information, equipment information, and sharing the necessary information in the above information with the supplier of the message notification service in order to provide you with a message notification service."}
{"task": "rw_91.jsonl", "id": 67920, "text": "If you don't want to accept this kind of information or message we sent you, you can reply to \"TD\" (or other displayed instructions displayed) to cancel the reception of such mobile phone text messages and turn off the relevant notification permissions through the mobile phone to close the network from the networkPush messages on the platform, or close the APP station message or public account message prompt.", "label": ["Important", "Edit/Control"], "rewrite": "You can reply to \"TD\" to cancel the reception of such mobile phone text messages. Turn off the relevant notification permissions through the mobile phone to close the push message from the network platform, or close the APP station message or public account message prompt."}
{"task": "rw_91.jsonl", "id": 67921, "text": "8. Provide you information search and display service", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67922, "text": "8.1, you can find the goods or services you need by searching. We will collect and use your search content and search records to facilitate the quickly matching you what you needCan improve our products and services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your search content and search records in order to provide you with personalized recommendation services and improve products and services."}
{"task": "rw_91.jsonl", "id": 67923, "text": "9. Provide you with personalized recommendation services", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67924, "text": "During your use of the network platform, to provide you with personalized services, or to ensure that you can know more suitable content, we may collect and use your location information, membership account information, order information, equipment information and other otherService log information related to our products and services (including browsing records, click to view records, search query records, transaction information, IP addresses, browser types, telecommunications operators, use language, access date and time, etc.), and youIn the interaction with us, our affiliates, and our partners, we can get other relevant information that we can get through your authorization.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Collect and use your location information, membership account information, order information, equipment information, service log information, and other information that you authorize to provide you with personalized services or more suitable content."}
{"task": "rw_91.jsonl", "id": 67925, "text": "You can also choose to close the recommendation service, you can go to [I]-[Settings]-[Personalized options] to close the personalized recommendation mechanism.", "label": ["Important", "Edit/Control"], "rewrite": "Turn off the personalized recommendation mechanism through [I]-[Settings]-[Personalized Options]."}
{"task": "rw_91.jsonl", "id": 67926, "text": "10. Provide you with security services", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67927, "text": "For the purpose of security risk control, to ensure the operation environment safety and the abnormal state of the membership account, better protect the safety of you or other users or the public, and better prevent fishing websites, fraud, network vulnerabilities, computersSecurity risks such as viruses, network attacks, and network invasion, and more accurately identify the situation of violating laws and regulations or the rules of the relevant agreement of McDonald's. We may use or integrate your location information, membership account information, order information, equipment information (equipment model, operation, operation, operation, operationSystem version, device settings, MAC address, hardware serial number and other software and hardware feature information, IMEI/Android, ID/IDFA/OpenUDID/Guid/OAID/OAID, SIM card IMSI, ICCID and other device identifiers, application lists, WIFI, andNetwork status, IP address, operator information, etc.) and other service log information related to our products and services, as well as information from our partners to obtain or shared by your partners to comprehensively judge your account and transaction risk, and verify identity verification, Testing and preventing safety incidents, and adopting necessary records, investigations, audits, analysis, and treatment measures in accordance with the law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "For the purpose of security risk control, we use or integrate your location information, membership account information, order information, equipment information, service log information, and other information that you authorize to judge accounts and transaction risks, verify, prevent security incidentswait."}
{"task": "rw_91.jsonl", "id": 67928, "text": "If you do not agree with us to record the aforementioned information, you may not be able to complete the risk control verification", "label": ["Important", "Data Security"], "rewrite": "If you do not agree with us to record location information, membership account information, order information, equipment information, service log information, and other information that you have authorized, you may not be able to complete risk control verification."}
{"task": "rw_91.jsonl", "id": 67929, "text": "11. We may collect personal information indirectly", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67930, "text": "In order to ensure your account security, confirm the transaction status, and provide you with the purpose of providing after -sales and dispute resolution, we may obtain your personal information from a third party (for example, Paying institutions, etc., such as your transaction, payment, booking and other information related to the transaction progress, in order to facilitate us to handle your orders and ensure the smooth completion of services, or better prevent malicious behaviors such as fraud and order).", "label": ["Important", "First Party Collection Information"], "rewrite": "We may collect your personal information from a third party to ensure account security, confirm the transaction status, and provide after -sales and dispute resolution."}
{"task": "rw_91.jsonl", "id": 67931, "text": "We will obtain your information from our partners in accordance with the requirements of laws and regulations and the agreement with third parties.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67932, "text": "12. Provide other additional services for you to call you rights limit", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67933, "text": "When you interact with us and use the following additional functions, we may collect and use your personal information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When you interact with us and use additional functions, we may collect and use your personal information."}
{"task": "rw_91.jsonl", "id": 67934, "text": "If you do not provide this information, you may not be able to use the additional functions or services that can be brought to you, but it will not affect the basic services or functions you provide for you.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67935, "text": "These additional functions include:", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67936, "text": "12.1 Information displayed based on geographical location: After you are authorized, we will collect the location information you generate during our service.", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67937, "text": "When you enable the positioning function of the mobile device through the system and use the service provided by the location information, we will collect and use your location information (including the GPS location information you have authorized and the WLAN access point, Bluetooth and base station sensor information information) To provide you, implement, or recommend related services (for example, you do not need to manually enter the geographical location where you can locate or obtain related services, estimate the actual distance between the McDonald's store and you).", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "When you authorize to open the positioning function and use the service provided by location information, we will collect and use your location information to provide you, implement or recommend related services for you."}
{"task": "rw_91.jsonl", "id": 67938, "text": "You can turn off the positioning settings in your device's system to stop the collection of our location information, but it may not be able to use the services we provide for you based on geographical location, or to achieve the expected effect of related services.", "label": ["Important", "Edit/Control"], "rewrite": "Turn off the positioning settings in the device system to stop collecting information on your location."}
{"task": "rw_91.jsonl", "id": 67939, "text": "12.2, additional features authorized by camera: You can use this additional function to complete the code scanning function, or participate in our relevant marketing and promotion activities.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "You can provide camera permissions to complete the code scanning function or participate in related marketing and promotion activities."}
{"task": "rw_91.jsonl", "id": 67940, "text": "If you do not use or stop using the above functions, you can not allow or close this permissions.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67941, "text": "12.3, additional functions based on album authorization: You can choose to open the system's album permissions, and authorize us to access your photo album by actively uploading pictures, videos, etc.Scanning function.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Usage"], "rewrite": "You can turn on the album authority to authorize us to access your album so that you can upload photos or videos or use code scanning functions."}
{"task": "rw_91.jsonl", "id": 67942, "text": "We will collect the above information you choose to upload. If you do not use or stop using the above functions, you may not allow or close this permissions.", "label": ["Important", "First Party Collection Information", "Edit/Control"], "rewrite": "We will collect photos or videos you posted possessly."}
{"task": "rw_91.jsonl", "id": 67943, "text": "12.4, additional functions based on calendar authorization: You can open the calendar permissions so that you can receive the appointment activities and reminder services under the happy small member service item.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can start the permission of the calendar in order to receive the appointment and reminder service."}
{"task": "rw_91.jsonl", "id": 67944, "text": "If you choose not to open this permissions, you will not be able to use this specific function, but it does not affect the other services we use among the small members.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not open the permissions of the calendar, it will only affect the appointment and reminder service, but it does not affect other services."}
{"task": "rw_91.jsonl", "id": 67945, "text": "12.5, additional functions authorized by microphone: You can choose to turn on the microphone rights and communicate online with customer service through voice functions.", "label": ["Permission Acquisition", "Important"], "rewrite": "You can choose to turn on the microphone right to communicate online with customer service through voice functions."}
{"task": "rw_91.jsonl", "id": 67946, "text": "If you choose not to turn on the microphone permission, you will not be able to use the specific voice customer service service, but it will not affect your customer service in other ways.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you choose not to turn on Macing, you will not use this specific voice customer service service."}
{"task": "rw_91.jsonl", "id": 67947, "text": "The above permissions will not be opened by default.", "label": ["Permission Acquisition", "Important"], "rewrite": "Geographical location, album, camera, microphone, and calendar permissions will not be opened by default."}
{"task": "rw_91.jsonl", "id": 67948, "text": "We will get your confirmation before enabling this function. You can also check the opening status of these permissions through the settings function in your device system, and you can decide to turn on or close these permissions at any time.", "label": ["Permission Acquisition", "Important", "Edit/Control"], "rewrite": "You can check the opening status of these permissions through the settings function in your device system, and you can decide to open or close."}
{"task": "rw_91.jsonl", "id": 67949, "text": "Even after your authorization, we have obtained these permissions, and we will only collect your information at the time of related functions or services.", "label": ["Permission Acquisition", "Important"], "rewrite": "Even after your authorization, we have obtained geographical location, album, camera, microphone, and calendar permissions, and we will only collect your information at the time of related functions or services."}
{"task": "rw_91.jsonl", "id": 67950, "text": "For more detailed instructions for the use of more detailed equipment permissions, please refer to the following \"McDonald's Application Equipment Perseverance Instructions\"", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67951, "text": "13. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67952, "text": "Please understand that according to laws and regulations, we handle your personal information in the following situation without obtaining your authorization consent:", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67953, "text": "13.1, to fulfill the statutory responsibility or legal obligations such as national security, defense security, criminal investigation, prosecution, trial and judgment, administrative law enforcement, etc.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to fulfill the statutory duties or the collection and usage information necessary for the statutory volunteer, there is no need to solicit authorization consent."}
{"task": "rw_91.jsonl", "id": 67954, "text": "13.2, need to sign and fulfill your relevant agreements or other written documents with you:", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to the collection and usage information necessary for signing and fulfilling related agreements or other written documents, no need to solicit authorization consent."}
{"task": "rw_91.jsonl", "id": 67955, "text": "13.3, to deal with emergencies, or in urgent situations for protecting the health and property security of natural people;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to cope with emergencies, or in urgent cases to protect the life and health of natural persons and the necessary collection and use information, no need to solicit authorization."}
{"task": "rw_91.jsonl", "id": 67956, "text": "13.4, implement news reports, public opinion supervision and other behaviors for public interests, and handle personal information within a reasonable range;", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "In order to implement news reports and public opinion supervision, deal with personal information within a reasonable scope without soliciting authorization consent."}
{"task": "rw_91.jsonl", "id": 67957, "text": "13.5, deal with personal information that personal information that has been disclosed by itself or other legal disclosure within a reasonable scope in accordance with the \"Personal Information Protection Law\";", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "According to the \"Personal Information Protection Law\", it is not necessary to solicit authorization consent in a reasonable scope or other legal disclosure of personal information within a reasonable range."}
{"task": "rw_91.jsonl", "id": 67958, "text": "13.6, other circumstances stipulated in laws and administrative regulations.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Other collection and use information stipulated in laws and regulations does not need to solicit authorization."}
{"task": "rw_91.jsonl", "id": 67959, "text": "14. McDonald's application equipment authority call for calling", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67960, "text": "Our access to your various equipment is to provide you with services and ensure your account security. After your authorization, we will turn on the relevant permissions, and you can cancel the authorization at any time in the system.", "label": ["Edit/Control", "Permission Acquisition"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67961, "text": "In different devices, the right display method and closing method may be different. For details, please refer to the device and system developer instructions or guidance.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67962, "text": "Please note that unless there is another instructions, you will open the right of one authority, which means that you authorize us to collect and use relevant personal information to provide you with corresponding services. Once you close the right of power, it means that you cancel the authorization.Continue to collect and use relevant personal information based on the corresponding permissions, nor can you provide you with the services corresponding to the permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "The opening of one authority means that the authorization is authorized to collect and use the relevant information to provide corresponding services. Close the authority to cancel the authorization representative, and no longer continue to collect and use relevant information based on the corresponding permissions."}
{"task": "rw_91.jsonl", "id": 67963, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Important"], "rewrite": "Close authority will not affect the collection and use of information based on authorization."}
{"task": "rw_91.jsonl", "id": 67964, "text": "(1) The acquisition of system authority for various business functions of the APP is as follows as follows", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67965, "text": "Storage: It is used to cache the text, images, logs and other content generated by you during the use of the McDonald's APP to ensure the normal display and operation of the McDonald's APP content.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the storage permissions to cache the text, images, logs and other content generated by you during the use of the McDonald's APP."}
{"task": "rw_91.jsonl", "id": 67966, "text": "Equipment information: In order to achieve information push, security risk control, and data analysis, you need to read your equipment information.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Get equipment information to achieve information push, security control and data analysis."}
{"task": "rw_91.jsonl", "id": 67967, "text": "If you choose not to open this permissions, you may not be able to use information push functions or cannot pass security verification, but it will not affect your continued use of other functions in the McDonald's APP.", "label": ["Permission Acquisition", "Important"], "rewrite": "If you do not turn on the equipment information authority, you may not be able to use the information push function or pass security verification."}
{"task": "rw_91.jsonl", "id": 67968, "text": "Location: For automatic positioning, searching restaurant, service recommendations based on locations, and participating in interactive activities. If you choose not to open this permission, you will not be able to automatically locate, will not receive recommendations based on the location of the location, and you cannot participate in the location of the location.Activities based on locations, but do not affect other services provided by your McDonald's APP.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the location authority for automatic positioning, searching restaurant, and location -based service recommendation, and participating in interactive activities."}
{"task": "rw_91.jsonl", "id": 67969, "text": "Camera and album: scan code, send and store photos or videos.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the camera and album permissions for scanning, sending and storing photos or videos."}
{"task": "rw_91.jsonl", "id": 67970, "text": "Please know that even if you have agreed to turn on the camera permissions, we will only obtain relevant information through the camera or album when you actively click on the client.", "label": ["Important"], "rewrite": "After you turn on the camera permissions, we only use the camera when scanning code, sending and storing photos or videos."}
{"task": "rw_91.jsonl", "id": 67971, "text": "If you do not use the above functions, you may not allow this permission.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67972, "text": "Cutting board: If you are using the McDonald's APP, when you log in to register and receive the verification code or copy the order number, and pick up the meal code, your shear plate function may be called so that you can quickly fill in the verification code.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the scissors permissions so that you can quickly fill in the verification code."}
{"task": "rw_91.jsonl", "id": 67973, "text": "The shear information will only be processed on your device, and we will not store your shear information for any other way.", "label": ["Data Retention", "Important"], "rewrite": "The shear information will only be processed on the device without other purposes."}
{"task": "rw_91.jsonl", "id": 67974, "text": "Calendar: If you use a happy small member service and make appointment activities and reminder services under the service, you need to start the permission of the calendar so that you can receive the activity reminder of the calendar.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the permissions of calendar in order to provide you with activity reminders."}
{"task": "rw_91.jsonl", "id": 67975, "text": "If you choose not to open this permissions, you will not be able to use this specific function, but it does not affect the other services we use among the small members.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67976, "text": "Microphone: In order to improve your customer service experience, you can contact customer service by sending voice.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the microphone right so that you can contact customer service by sending voice."}
{"task": "rw_91.jsonl", "id": 67977, "text": "If you choose not to turn on the microphone permission, you will not be able to use the specific voice customer service service, but it will not affect your customer service in other ways.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67978, "text": "(2) The acquisition of the system function of mini -programs for the acquisition of system authority is as follows.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67979, "text": "Location: For automatic positioning, searching restaurant, service recommendations based on locations, and participating in interactive activities. If you choose not to open this permission, you will not be able to automatically locate, will not receive recommendations based on the location of the location, and you cannot participate in the location of the location.Activities based on locations, but do not affect other services provided by your use of McDonald's.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the location authority for automatic positioning, searching restaurant, and location -based service recommendation, and participating in interactive activities."}
{"task": "rw_91.jsonl", "id": 67980, "text": "Camera and albums: scan code, send and store photos or videos to allow you to participate in the publicity or activities organized by McDonald's from time to time.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the camera and album permissions for scanning, sending and storing photos or videos."}
{"task": "rw_91.jsonl", "id": 67981, "text": "Please know that even if you have agreed to turn on the camera authority, we will only obtain relevant information through the camera or album when you actively click on the above features.", "label": ["Permission Acquisition", "Important"], "rewrite": "After you turn on the camera permissions, we only use the camera when scanning code, sending and storing photos or videos."}
{"task": "rw_91.jsonl", "id": 67982, "text": "If you do not use the above functions, you may not allow this permission.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67983, "text": "Calendar: If you use a happy small member service and make appointment activities and reminder services under the service, you need to start the permission of the calendar so that you can receive the activity reminder of the calendar.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the permissions of calendar in order to provide you with activity reminders."}
{"task": "rw_91.jsonl", "id": 67984, "text": "If you choose not to open this permissions, you will not be able to use this specific function, but it does not affect the other services we use among the small members.", "label": ["Permission Acquisition", "Important"], "rewrite": "Refusing to provide calendar permissions only causes the activity reminder function to be unavailable without affecting others."}
{"task": "rw_91.jsonl", "id": 67985, "text": "Microphone: In order to improve your customer service experience, you can contact customer service by sending voice.", "label": ["Permission Acquisition", "Important", "Usage"], "rewrite": "Get the microphone right so that you can contact customer service by sending voice."}
{"task": "rw_91.jsonl", "id": 67986, "text": "If you choose not to turn on the microphone permission, you will not be able to use the specific voice customer service service, but it will not affect your customer service in other ways.", "label": ["Permission Acquisition"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67987, "text": "Special reminder: As various platforms, equipment, systems and services we provide may be different, (1) The permissions and informing methods we obtain in each small program may be slightly different. For details, please use the platform where the applet is locatedPage prompts are subject to;", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67988, "text": "(2) In different devices or different systems, the prompt, display method, and closure method of authority may be different. For details, please refer to the instructions or guidance of the device and system developer.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67989, "text": "2. How can we share, transfer, and disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67990, "text": "1. How do we share your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67991, "text": "For your personal information, we only collect and use within the purpose and scope of the privacy policy or in accordance with the requirements of laws and regulations, and strictly keep secret.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67992, "text": "Under normal circumstances, we will not share your personal information with any company, organization and individual, except the following situations:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 67993, "text": "1.1, get shared by your consent or authorization: Based on the needs of specific business scenarios, after obtaining your clear consent, we will share your personal information with other parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on the needs of specific business scenarios, after obtaining your clear consent, we will share your personal information with other parties."}
{"task": "rw_91.jsonl", "id": 67994, "text": "If you need to share your information to the third party in order to provide you, we will evaluate the legality, legitimacy, and necessity of the third -party collection information, and confirm the agreement, the copywriting in the specific scenario,Wait for your consent, or confirm that the third party has obtained your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If you share your information until the third party, we will evaluate the legality, legitimacy, and necessity of collecting information in third parties, and obtain your consent or confirm that the third party has obtained your consent."}
{"task": "rw_91.jsonl", "id": 67995, "text": "1.2, sharing under legal circumstances: We may share your personal information in accordance with the requirements of laws and regulations, or to resolve the needs of litigation disputes, or in accordance with the legal requirements put forward by administrative or judicial organs.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information in accordance with the requirements of laws and regulations, or to solve the needs of litigation disputes, or in accordance with the legal requirements put forward by administrative or judicial organs."}
{"task": "rw_91.jsonl", "id": 67996, "text": "1.3, sharing with affiliated companies and franchisees: In order to facilitate us to provide you with products and services, internal analysis, research and financial accounting, recommend information that you may be interestedFranchise operators, McDonald's brands, other McDonald's consumers or the public's personal property security is unruly, and your personal information may be shared with our affiliated companies and franchisees.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with related companies and franchisees to provide services, internal analysis research, financial accounting, and personalized recommendations."}
{"task": "rw_91.jsonl", "id": 67997, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will only share the necessary personal information with affiliated companies and franchisees, and are restricted by the purpose of this policy."}
{"task": "rw_91.jsonl", "id": 67998, "text": "If we share your personal sensitive information, or the purpose of the company (or the franchise) to change the purpose of the use and processing of personal information, we will solicit your consent again.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you share your sensitive information or change the purpose of personal information, we will get your consent again."}
{"task": "rw_91.jsonl", "id": 67999, "text": "1.4, shared with authorized partners: We may entrust the authorized partners to provide you with certain services or represent us to perform functions. We may share with business partners to provide you with the necessary membership account information, order information, location information, location information, location information, location information, location information, location information, location information, location information, location information, location information, and locationInformation and equipment information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your membership account information, order information, location information and equipment information with business partners in order to provide you with services or fulfilling functions."}
{"task": "rw_91.jsonl", "id": 68000, "text": "We will only share your information for the legal, correct, necessary, specific, and clear goals of this policy.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68001, "text": "Authorized partners can only contact the information required for their duties and cannot use this information for any other goals.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Authorized partners can only contact the information required for their duties and cannot be used as other purposes."}
{"task": "rw_91.jsonl", "id": 68002, "text": "Our authorized partners mainly include the following types:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68003, "text": "(1) Authorized partners of commodity or technical services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68004, "text": "We will share your necessary personal information to service providers that support our functions.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68005, "text": "These supports include providing or providing technical services, logistics distribution services, payment services, card ticket distribution, data processing, customer service, etc.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68006, "text": "The purpose of our sharing of this information is to achieve the basic functions of our products or services (for example, we must share your necessary order information with logistics service providers to arrange delivery).", "label": ["Usage", "Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68007, "text": "(2) Service providers of advertising and data services.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68008, "text": "Unless you obtain your license or de -identify, anonymous treatment to avoid identification of your identity, we will not make your personal information (referring to information that can identify your identity, you can contact you or identify you through this information.Identity) Share with service providers providing advertising and data services.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We only share information about unsatisfactory personal identity with service providers providing advertising and data services."}
{"task": "rw_91.jsonl", "id": 68009, "text": "(3) Safety guarantee service.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68010, "text": "In order to ensure your account security and risk control purposes and avoid risks such as fraud and network attacks, we may share with our security partners to share the necessary device information and log information related to your security to comprehensively judge your account number or transactionRisk, prevent safety incidents.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security", "Usage"], "rewrite": "We may share your necessary device information and log information with security partners to ensure account security and achieve risk control purposes."}
{"task": "rw_91.jsonl", "id": 68011, "text": "(4) Research and analysis service providers.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68012, "text": "In order to enable us to better understand your needs and preferences, and to provide you with more suitable and more accurate services to you, we may share your personal information with service providers providing research and analysis services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We share your personal information with service providers providing research and analysis services to understand your needs and preferences."}
{"task": "rw_91.jsonl", "id": 68013, "text": "(5) Third -party SDK service provider.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68014, "text": "See Appendix I-Personal Information Sharing List-Part 1-McDonald's official third-party SDK list.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "See Appendix I-Personal Information Sharing List-Part 1-McDonald's official third-party SDK list."}
{"task": "rw_91.jsonl", "id": 68015, "text": "Please know that we will share your personal information with third parties based on the principles of realizing specific functions and based on the principles of legal, correctness, and minimum necessary.Organize and individuals, we will sign relevant information protection and confidential clauses with them, ask them to abide by the agreement and take relevant security measures to protect your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "We share personal information based on the principles of implementing specific functions and based on the principles of legal, correctness, and minimum necessaryness, and signing information protection and confidentiality clauses to ask them to protect your personal information."}
{"task": "rw_91.jsonl", "id": 68016, "text": "2. How do we transfer your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68017, "text": "We will not transfer your personal information to any company, organization and individual, except the following situations: except:", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68018, "text": "2.1, get your clear consent or authorization in advance", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If you get your clear consent or authorization in advance, you may transfer your information."}
{"task": "rw_91.jsonl", "id": 68019, "text": "2.2, according to the requirements of relevant laws and regulations, legal procedures, administrative or judicial organs based on the requirements of fulfilling their functions;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "In accordance with the requirements of relevant laws and regulations, legal procedures, administrative or judicial organs, you may transfer your information based on the requirements of performing functions."}
{"task": "rw_91.jsonl", "id": 68020, "text": "2.3, when involving mergers, acquisitions, asset transfers, or similar transactions, if you involve personal information transfer, we will ask new companies that hold your personal information and organizations to continue to be bound by this policy. Otherwise, we will ask for, we will ask forThe company and organization re -authorize your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When involving mergers, acquisitions or bankruptcy liquidation, if you involve personal information transfer, companies and organizations that require your personal information will continue to be subject to this policy, otherwise it will request it to re -authorize your authorization consent."}
{"task": "rw_91.jsonl", "id": 68021, "text": "3. How do we disclose your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68022, "text": "In addition to displaying related desensitization information during the announcement of the account in the account, or the necessary public disclosure of your clear consent, we will not disclose your personal information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "We will show the necessary disclosure of the relevant desensitization information of the account in the account, the relevant desensitization information of the punishment notice, or the obtaining your clear consent."}
{"task": "rw_91.jsonl", "id": 68023, "text": "However, based on the compulsory requirements of legal regulations and the compulsory requirements of judicial organs or administrative agencies, we may disclose your personal information to the authority.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Based on legal regulations and mandatory requirements for judicial organs or administrative agencies, your information may be disclosed."}
{"task": "rw_91.jsonl", "id": 68024, "text": "However, when the above situation occurs, we will require the disclosure of the request party to issue a corresponding valid legal document and take the necessary security protection measures for the disclosed information.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "If the law stipulates that the judicial organs or administrative agencies are required to disclose, we will require the disclosure of the request to have valid legal documents and take safety protection measures."}
{"task": "rw_91.jsonl", "id": 68025, "text": "3. How do we store and protect your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68026, "text": "1. Storage location", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68027, "text": "The personal information we collected and generated in the People's Republic of China are stored in the territory of the People's Republic of China.", "label": ["Data Retention", "Important"], "rewrite": "The personal information collected and generated in domestic operations will be stored in China."}
{"task": "rw_91.jsonl", "id": 68028, "text": "At present, we do not exist to provide your personal information overseas.", "label": ["Data Retention", "Important"], "rewrite": "There are currently no scenarios that provide personal information overseas."}
{"task": "rw_91.jsonl", "id": 68029, "text": "If we really need to provide your personal information to the People's Republic of China due to special circumstances such as business needs, we should have the conditions stipulated in the law, fulfill the obligations stipulated in the law, and obtain your separate consent in advance.", "label": ["Data Retention", "Important"], "rewrite": "If we need to provide personal information to China, we should have legal conditions, fulfill their legal obligations, and obtain your separate consent in advance."}
{"task": "rw_91.jsonl", "id": 68030, "text": "2. Storage period", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68031, "text": "If the relevant laws and regulations have clearly stipulated our personal information (for example, the \"E -Commerce Law of the People's Republic of China\" requires that the goods and service information and transaction information preservation time is not less than three years from the date of completion of the transaction), andWe will first abide by these regulations;", "label": ["Data Retention", "Important"], "rewrite": "The preservation period of personal information first follows the clear provisions of the law."}
{"task": "rw_91.jsonl", "id": 68032, "text": "If there is no clear specification, we will save your personal information until: (1) the purpose of collecting, using, and sharing your personal information;", "label": ["Data Retention", "Important"], "rewrite": "If the law does not clearly specify the preservation period of personal information, save personal information until: (1) the purpose of collecting, using, and sharing your personal information; (2) you to terminate the use of products or services, or no longer participate in activities; (3 3 (3 3) You clearly ask for deleting your personal information."}
{"task": "rw_91.jsonl", "id": 68033, "text": "(2) You terminate the use of our products or services, or no longer participate in our activities;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68034, "text": "(3) You clearly ask us to delete your personal information.", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68035, "text": "After the preservation of personal information expires, we will adopt other processing methods that delete, anonymous processing or laws and regulations are recognized.", "label": ["Data Retention", "Important"], "rewrite": "After exceeding the storage period, your personal information will be deleted or anonymous, except for other provisions of laws and regulations."}
{"task": "rw_91.jsonl", "id": 68036, "text": "3. Storage safety", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68037, "text": "3.1 Safety protection measures", "label": ["Data Security"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68038, "text": "We attach great importance to your personal information security.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68039, "text": "To this end, we are committed to adopting various types of security protection measures, including establishing reasonable information security management policies and implementing security technologies to reduce your personal information as much as possible., Risk of damage and deletion.", "label": ["Important", "Data Security"], "rewrite": "The risk of unauthorized access, use, modification, disclosure, damage, and deletion of unauthorized access, use, modification, disclosure, damage, and deletion of your personal information is adopted."}
{"task": "rw_91.jsonl", "id": 68040, "text": "These measures include but not limited to:", "label": ["Data Security"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68041, "text": "(1) In the process of information transmission, we can encrypt the information you entered by using network security layer software (SSL) to reduce the risk of being intercepted by the information you entered;", "label": ["Important", "Data Security"], "rewrite": "Use network security layer software to encrypt the input information."}
{"task": "rw_91.jsonl", "id": 68042, "text": "(2) When transmitting and storing personal sensitive information, we adopt various types of encryption, permissions control, de -identification and other security measures to ensure the safety of transmission and storage;", "label": ["Important", "Data Security"], "rewrite": "The use of various types of encryption, permissions control, de -identification and other security measures to ensure the safety of transmission and storage."}
{"task": "rw_91.jsonl", "id": 68043, "text": "(3) We have strictly controlled the access of our user data platform to prevent your information from being accepted and used by unauthorized access;", "label": ["Important", "Data Security"], "rewrite": "The access permissions of the user data platform are strictly controlled and controlled to prevent unauthorized access and use."}
{"task": "rw_91.jsonl", "id": 68044, "text": "(4) We have set up information security full -time teams to promote and ensure personal information security, and have established various policies and processes related to data classification, data security management, data security development, emergency response and other related processes to manage and standardize individualsInformation storage and use.", "label": ["Important", "Data Security"], "rewrite": "A full -time information security team and policies and processes related to data classification, data security management, data security development, emergency response and other related policies and processes are established to ensure personal information security."}
{"task": "rw_91.jsonl", "id": 68045, "text": "3.2 Personal information security incident", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68046, "text": "We have formulated an early warning mechanism and emergency plan in accordance with the provisions of laws and regulations.", "label": ["Important", "Data Security"], "rewrite": "Early warning mechanisms and emergency plans were formulated."}
{"task": "rw_91.jsonl", "id": 68047, "text": "If our physical, technical, or management protection facilities are damaged, and the information is caused by unauthorized access, public disclosure, tampering or destruction, and damage to your legitimate rights and interests, we will launch an emergency plan in time and take reasonable and necessary measures.In order to reduce the impact on your personal.", "label": ["Important", "Data Security"], "rewrite": "Start the emergency plan in a timely manner to deal with safety events, and take reasonable and necessary measures to reduce the impact on your personal impact as much as possible."}
{"task": "rw_91.jsonl", "id": 68048, "text": "If a personal information security incident occurs, we will also inform you the basic situation and possible impact of the security incident in accordance with the requirements of the laws and regulations.Remedy.", "label": ["Important", "Data Security"], "rewrite": "If a personal information security incident occurs, we will inform your basic situation, possible impact, disposal measures, independent prevention suggestions, etc."}
{"task": "rw_91.jsonl", "id": 68049, "text": "We will inform you in SMS, telephone, push notification, and other reasonable channels that it is difficult to inform one by one. We will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "The relevant situation of security incidents will be informed by mail, letter, telephone, push notification, etc. When it is difficult to inform one by one, it will issue an announcement."}
{"task": "rw_91.jsonl", "id": 68050, "text": "At the same time, we will also report to the disposal of personal information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "The disposal of personal information security incidents will be reported in accordance with the requirements of the regulatory authorities."}
{"task": "rw_91.jsonl", "id": 68051, "text": "4. How do you manage your personal information", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68052, "text": "1. Check your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68053, "text": "You can enter the personal information page through the \"My\" entrance of the McDonald's official app and McDonald's official applet to visit your nickname, gender, contact phone number and date of birth.", "label": ["Important", "Edit/Control"], "rewrite": "Through the \"My\" entrance of the McDonald's Official App and McDonald's official applet, click the avatar to enter the personal information page to visit your nickname, gender, contact number and birth date."}
{"task": "rw_91.jsonl", "id": 68054, "text": "You can check the \"order\" entry of the official McDonald's APP and McDonald's official applets, and you can check the orders for the last year.", "label": ["Important", "Edit/Control"], "rewrite": "At the \"order\" entry of the McDonald's official app and the official mini -programs of McDonald's, you can check the orders for the last year."}
{"task": "rw_91.jsonl", "id": 68055, "text": "In addition, if you open the McDonal wallet function, you can also enter the \"McDonald's Wallet\" through the \"My\" entrance of the McDonald's official app and McDonald's official applet to query your McDonald's wallet balance information.", "label": ["Important", "Edit/Control"], "rewrite": "Through the \"My\" entrance of the McDonald's APP and McDonald's official applet, enter the \"McDonald's Wallet\" to check your McDonald's wallet balance information."}
{"task": "rw_91.jsonl", "id": 68056, "text": "If you encounter operating problems during the access process, you need to get other personal information content that you cannot know, and you can contact us through the method provided by this privacy policy.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68057, "text": "2. Visit and correct your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68058, "text": "You can use the \"My\" entrance of the official McDonald's APP and McDonald's official applet, click the avatar to enter the personal information page to correct your gender, birth date, and contact number (on the McDonald's APP, you can also change your nickname)Essence", "label": ["Important", "Edit/Control"], "rewrite": "Through the \"My\" entrance of the McDonald's Official App and McDonald's official applets, click the avatar to enter the personal information page to correct your gender, date of birth and contact number."}
{"task": "rw_91.jsonl", "id": 68059, "text": "3. Change the scope of your authorization consent or withdraw your authorization", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68060, "text": "If you want to change or withdraw your authorization of us to continue to collect and use your personal information, you can change the scope of your authorization of personal information by deleting information and closing the device function in McDonald's application settings.Your authorization.", "label": ["Important", "Edit/Control"], "rewrite": "Change the scope of authorization or withdraw authorization by deleting information and closing the device function in McDonald's applications."}
{"task": "rw_91.jsonl", "id": 68061, "text": "You can also withdraw the entire authorization of our personal information by canceling the account.", "label": ["Important", "Edit/Control"], "rewrite": "You can withdraw all the authorization of personal information by canceling the account."}
{"task": "rw_91.jsonl", "id": 68062, "text": "Please understand that some functions require basic personal information to complete. When you change or withdraw from consent or authorization, we may not be able to continue to provide you with the service corresponding to consent or authorization, and no longer handle your corresponding corresponding correspondencePersonal information.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68063, "text": "The decision you change or withdraw from consent or authorization will not affect personal information processing that has been carried out based on your consent or authorization before.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Withdrawal or authorization will not affect the collection and use of information based on authorization."}
{"task": "rw_91.jsonl", "id": 68064, "text": "4. Delete your personal information", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68065, "text": "In the following circumstances, you can make a request to delete personal information:", "label": ["Important", "Edit/Control"], "rewrite": "In the following circumstances, you can make a request to delete personal information: (1) If our behavior of handling personal information violates laws and regulations; (2) If we collect and use your personal information, it has not obtained your consent.; (3) If our handling of personal information is violated with you; (4) You actively canceled your account."}
{"task": "rw_91.jsonl", "id": 68066, "text": "(1) If our behavior of handling personal information violates laws and regulations;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68067, "text": "(2) If we collect and use your personal information, it has not obtained your consent;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68068, "text": "(3) If our behavior of handling personal information violates your agreement;", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68069, "text": "(4) If you take the initiative to cancel your account.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68070, "text": "5. Logging out", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68071, "text": "If you want to cancel your McDonald's member account, you can use the \"My\"-\"Settings\"-\"Logging out\" entrance of the McDonald's official app or McDonald's WeChat Mini Program, click the avatar to enter the personal information page for account cancellation.", "label": ["Important", "Edit/Control"], "rewrite": "Through the \"My\"-\"Settings\"-\"Logging out\" entrance of the McDonald's official app or McDonald's WeChat Mini Program, click the avatar to enter the personal information page for account cancellation."}
{"task": "rw_91.jsonl", "id": 68072, "text": "You can also contact us through the telephone hotline shown at the end of the article. Please also conduct relevant operations according to the prompts of the hotline, provide relevant identity verification information, and pay attention to the hotline phone to inform your relevant prompt matters.", "label": ["Important", "Edit/Control"], "rewrite": "Through contacting us to apply for cancellation account and conduct relevant operations according to the prompts of the hotline, and provide relevant identity verification information."}
{"task": "rw_91.jsonl", "id": 68073, "text": "After verifying your identity and officially launching the cancellation of the account program for you, we will immediately stop providing you with products or services, and delete, deal with it anonymous treatment in accordance with the relevant laws and regulations, or process your personal information in other ways stipulated in laws.(But the laws and regulations have other regulations or other requirements, such as the \"Cyber Security Law of the People's Republic of China\", your network operation log will be kept at least six months in accordance with the \"People's Republic of China\".", "label": ["Important", "Edit/Control"], "rewrite": "After the official launch of the cancellation of the account program, we will stop providing you with products or services and delete or anonymous your personal information. Except for the laws and regulations, there are other stipulated laws and regulations."}
{"task": "rw_91.jsonl", "id": 68074, "text": "Please note that no matter what kind of cancellation method you choose, please carefully read the \"Logging\" section and the prompt on the cancellation page before confirming and agreeing to the cancellation of the cancellation.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68075, "text": "6. Get your personal information copy", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68076, "text": "If you need to get your personal information copy that we collect, under the premise of compliance with relevant laws and technical feasibility, we will provide you with your personal information copy according to your requirements.", "label": ["Important", "Edit/Control"], "rewrite": "Under the premise of compliance with relevant laws and technical feasibility, we will provide you with your personal information copy according to your requirements."}
{"task": "rw_91.jsonl", "id": 68077, "text": "7. Automatic decision -making information system automatic decision", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68078, "text": "In certain business functions, we may make decisions only based on the non -artificial automatic decision mechanism, including information systems, algorithms, etc..", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68079, "text": "If these decisions significantly affect your legitimate rights and interests, you have the right to ask us to explain, and we will also provide appropriate relief methods.", "label": ["Important", "Edit/Control"], "rewrite": "If the decision of the automatic decision -making mechanism affects your legitimate rights and interests, you have the right to explain and appropriate relief."}
{"task": "rw_91.jsonl", "id": 68080, "text": "8. respond to your request", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68081, "text": "If you cannot access, change or delete your personal information through the above way, or you need to access, change or delete other personal information that you generate when using our product or service, or you think we have any violations of laws and regulations orYou can contact us through the contact information of your personal information at the end of the text.", "label": ["Edit/Control", "Important"], "rewrite": "You can contact us any problems and obstacles you encountered when exercising your personal information related rights."}
{"task": "rw_91.jsonl", "id": 68082, "text": "In order to ensure the security of personal information, we may verify your necessary identity when we respond to your needs for accessing, changing or deleting your personal information.", "label": ["Important", "Edit/Control"], "rewrite": "We may make your necessary identity verification and respond to your personal information related needs."}
{"task": "rw_91.jsonl", "id": 68083, "text": "After receiving your feedback and verifying your identity, we will answer your request within 15 working days or laws and regulations.", "label": ["Edit/Control", "Important"], "rewrite": "15 working days or laws and regulations will answer your request within the time limit of laws and regulations."}
{"task": "rw_91.jsonl", "id": 68084, "text": "For your reasonable requests, we do not charge fees in principle, but we will respond to your request after receiving a certain cost fee for multiple repeated and more reasonable requests.", "label": ["Important", "Edit/Control"], "rewrite": "Reasonable requests are not charged in principle without charging and exceeding the reasonable limit."}
{"task": "rw_91.jsonl", "id": 68085, "text": "We have the right to reject the risk or unrealistic request for the development of a new system or a fundamental change from the need to develop new systems or fundamentally changing the current practice), bringing risks or unrealistic requests to others.", "label": ["Important", "Data Security", "Edit/Control"], "rewrite": "We may refuse to repeat for unseen, need too much technical means, bring risks or very unrealistic requests to others' legitimate rights and interests."}
{"task": "rw_91.jsonl", "id": 68086, "text": "5. Privacy protection of minors", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68087, "text": "We attach great importance to and are committed to protecting the privacy and personal information of minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68088, "text": "We will not take the initiative to collect their personal information directly to minors.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68089, "text": "But because birthdays are not information that must be provided, in some cases, we cannot recognize the age of users.", "label": ["Specific Audiences", "Important"], "rewrite": "In some cases, we cannot recognize the age of users."}
{"task": "rw_91.jsonl", "id": 68090, "text": "If you are a minor, before you use any network platform and McDonald's service, be sure to obtain the consent of your guardian in advance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor, please use our service after the guardian consent."}
{"task": "rw_91.jsonl", "id": 68091, "text": "If your guardian does not agree that you use McDonald's China in accordance with this policy or provide your information to McDonald's China, please stop the registration account;", "label": ["Specific Audiences", "Important"], "rewrite": "If your guardian does not agree with this policy, please stop the registration account; if you have registered your account, please contact us."}
{"task": "rw_91.jsonl", "id": 68092, "text": "If you have registered your account, please immediately terminate the use of McDonald's China and inform us in time in order to take appropriate measures.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68093, "text": "If you are a guardian, you should correctly fulfill your duties and protect your personal information security;", "label": ["Specific Audiences", "Important"], "rewrite": "The guardians are requested to perform their duties to protect the personal information security of minors."}
{"task": "rw_91.jsonl", "id": 68094, "text": "If the minors themselves need to register or use our products and/or services, you should correctly guide and be monitored.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian is requested to correctly guide and monitor the minor to register or use products or services."}
{"task": "rw_91.jsonl", "id": 68095, "text": "If the facts prove that minors register our products or services without obtaining the consent of the guardian, we will negotiate with relevant guardians and try to delete relevant personal information as soon as possible.", "label": ["Specific Audiences", "Important"], "rewrite": "If the personal information of minors was collected without the consent of the guardian, he would try to delete relevant information as soon as possible."}
{"task": "rw_91.jsonl", "id": 68096, "text": "We will process and store personal information of minors in accordance with the agreement of this policy.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68097, "text": "When the purpose, method, scope, storage matters, security measures, etc. stipulated in this policy have undergone substantial changes, we will once again obtain the consent of the guardian.", "label": ["Specific Audiences", "Important", "Data Security"], "rewrite": "When the purpose, method, scope, storage matters, security measures, etc. stipulated in this policy have undergone substantial changes, we will once again obtain the consent of the guardian."}
{"task": "rw_91.jsonl", "id": 68098, "text": "The purpose, method, and scope of our personal information of minors will not exceed the content of our policy in this policy.", "label": ["Specific Audiences", "Important"], "rewrite": "We only collect and use the personal information of minors within the purpose, methods, and scope of the policy."}
{"task": "rw_91.jsonl", "id": 68099, "text": "In addition, before the clear consent of the guardian, we will not share, transfer, and publicly disclose the personal information of minors to third parties.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "We shared, transferred, and publicly disclosed the personal information of minors to obtain the guardian's clear consent in advance."}
{"task": "rw_91.jsonl", "id": 68100, "text": "The guardian or minor himself can correct and delete personal information in accordance with the methods provided by this policy.", "label": ["Edit/Control", "Specific Audiences"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68101, "text": "If minors or guardians discover that we who violate laws, administrative regulations or the privacy policy to handle personal information of minors, or if the guardian withdraws the consent, or terminates the use of products or services through cancellationDelete personal information of adults.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "You can contact us to delete the personal information of minors."}
{"task": "rw_91.jsonl", "id": 68102, "text": "6. How do we use cookies and similar technologies", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68103, "text": "We may use cookies or similar technologies to collect information about McDonald's website and McDonald's application.", "label": ["Important", "First Party Collection Information"], "rewrite": "Use cookies or similar technologies to collect information about McDonald's website and McDonald's application."}
{"task": "rw_91.jsonl", "id": 68104, "text": "When you use our service, we will store small data files named Cookie on your computer or mobile device.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68105, "text": "Cookies helps us improve our website.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68106, "text": "You can manage or delete according to your preferences, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can manage or delete cookies."}
{"task": "rw_91.jsonl", "id": 68107, "text": "You can clear all the functions saved on the computer, cookies, and most of the network browsers have the functions of stopping, cookies.", "label": ["Important", "Edit/Control"], "rewrite": "You can remove all the cookies saved on the computer."}
{"task": "rw_91.jsonl", "id": 68108, "text": "7. Provide and link to other websites to other websites", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68109, "text": "Our websites, applications, etc. may contain links to third -party websites, products and services.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68110, "text": "Our services may also use or provide products or services from third -party platforms.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68111, "text": "These third parties may collect, use and handle your personal information, but may not follow the provisions of this policy, or there may be regulations that are opposite to this policy.", "label": ["Important", "Risk"], "rewrite": "The third -party platform in our services may collect, use and handle your personal information, but may not follow the provisions of this policy, or there may be regulations that are opposite to this policy."}
{"task": "rw_91.jsonl", "id": 68112, "text": "Please read and understand the relevant provisions of these third parties for the protection of privacy.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68113, "text": "If you find that these third -party websites, products and services are risky, please terminate the relevant operations to avoid infringing your rights and interests.", "label": ["Important", "Data Security"], "rewrite": "If you find a risk of third -party websites, products and services, please terminate the relevant operation!"}
{"task": "rw_91.jsonl", "id": 68114, "text": "8. Update of this policy", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68115, "text": "The update date shown in this policy is updated and effective.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68116, "text": "Although this policy is the general privacy clause that we can uniformly apply, some specific services will apply specific privacy policies, and the privacy policy of these specific services constitutes part of the cost of the cost of composition.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68117, "text": "If any specific service privacy policy is inconsistent with this policy, the privacy policies of these specific services should be applied.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68118, "text": "We will update this policy from time to time.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68119, "text": "Without your consent, we will not limit the rights you should enjoy in accordance with this policy.", "label": ["Policy Change", "Important"], "rewrite": "After updating the privacy policy, without your clear consent, we will not restrict the rights you should enjoy in accordance with this policy."}
{"task": "rw_91.jsonl", "id": 68120, "text": "If we update this policy, we will publish updated versions on our official website's designated link (https://www.mcdonalds.com.cn/pridacy-policy).", "label": ["Policy Change", "Important"], "rewrite": "We will publish updated versions on https://www.mcdonalds.com.cn/page/privacy-policy."}
{"task": "rw_91.jsonl", "id": 68121, "text": "If such updates have caused the substantial reduction or major changes of your rights under this policy, we will prompt or send you a message to you or notify you in other ways before this policy takes effect, and re -obtain your consent again Essence", "label": ["Policy Change", "Important"], "rewrite": "If the update of the privacy policy has caused the essence of your rights to reduce or change major changes, we will notify you and re -obtain your consent."}
{"task": "rw_91.jsonl", "id": 68122, "text": "The situation of \"major changes\" includes but not limited to", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68123, "text": "(1) Our service model has changed significantly.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68124, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68125, "text": "(2) We have undergone major changes in the aspects of ownership structure and organizational structure.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68126, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68127, "text": "(3) The main object of personal information sharing, transfer or public disclosure changes;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68128, "text": "(4) The right to participate in personal information processing and its exercise methods have changed significantly;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68129, "text": "(5) We are responsible for handling personal information security teams, contact methods and complaint channels;", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68130, "text": "(6) Evaluation report on personal information security impact indicates that there is a high risk.", "label": ["Policy Change"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68131, "text": "Nine, scope and law", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68132, "text": "This policy is only applicable to continental regions except Hong Kong, Macao and Taiwan.", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68133, "text": "This policy applies to the laws of the People's Republic of China (except the laws of conflict).", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68134, "text": "10. Contact us and solve disputes", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68135, "text": "If you have any questions, opinions or suggestions on this policy, or hope to make complaints or reports related to this policy, you can contact us in the following ways:", "label": ["Important", "Contact Information"], "rewrite": "You can contact us in the following way:"}
{"task": "rw_91.jsonl", "id": 68136, "text": "Phone hotline: 400-920-0205 (Working hours: 9:00 am to 18:00 pm every day)", "label": ["Important", "Contact Information"], "rewrite": "Phone hotline: 400-920-0205 (Working hours: 9:00 am to 18:00 pm every day)"}
{"task": "rw_91.jsonl", "id": 68137, "text": "Email: ENQUIRY@cn.mcd.com", "label": ["Important", "Contact Information"], "rewrite": "Email: enquiry@cn.mcd.com"}
{"task": "rw_91.jsonl", "id": 68138, "text": "Contact address: Building 2, No. 2121, Longteng Avenue, Xuhui District, Shanghai", "label": ["Important", "Contact Information"], "rewrite": "Contact address: Building 2, No. 2121, Longteng Avenue, Xuhui District, Shanghai"}
{"task": "rw_91.jsonl", "id": 68139, "text": "Our personal information protection department and contact information: McDonald's China Data Governance Office Personal Information Protection Team, Address: Building 2, Building 2121, Longteng Avenue, Xuhui District, Shanghai, mailbox:, ENQUIRY@CN.MCD.com.", "label": ["Important", "Contact Information"], "rewrite": "Personal information protection department and contact information: McDonald's China Data Governance Office Personal Information Protection Team, Address: Building No. 2121, Longteng Avenue, Xuhui District, Shanghai, mailbox: enquily@cn.mcd.com."}
{"task": "rw_91.jsonl", "id": 68140, "text": "For your questions, opinions, or suggestions, in general, we will answer or deal with you within 15 working days after verifying your user identity.", "label": ["Important", "Contact Information"], "rewrite": "A response or processing will be answered within 15 working days after verifying your user identity."}
{"task": "rw_91.jsonl", "id": 68141, "text": "If you are not satisfied with our reply, especially if you think our personal information processing behavior has harm your legal rights and interests, you can also seek solutions by filed a lawsuit with the courts with jurisdictions in our residence.", "label": ["Contact Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68142, "text": "appendix:", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68143, "text": "(1) McDonald's official third -party SDK list", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68144, "text": "You can click the [Third Party SDK List] to see the details of our access SDK.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You can click [Third -Party SDK List] to view the access to the access of the access."}
{"task": "rw_91.jsonl", "id": 68145, "text": "(2) Other third -party partners", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68146, "text": "The purpose of the use of personal information in third -party products/service types", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68147, "text": "Delivery service providers, recipient names, contact information, addresses and order information, users use wheat to send services, delivering goods to users", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Delivery providers collect recipients' name, contact information, address and order information to deliver goods to users."}
{"task": "rw_91.jsonl", "id": 68148, "text": "Payment service provider, user order number, order amount, payment time, payment scenario, complete payment", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Payment service provider collecting account order number, order amount, and payment time to complete the payment."}
{"task": "rw_91.jsonl", "id": 68149, "text": "Customer service service, membership account information, order information, customer service services, help users solve problems, or record and feedback related issues and results, or handle users' complaints and reports", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Customer service collecting member account information, order information to help users solve problems, or record, feedback processing plans and results, or process complaints and reports."}
{"task": "rw_91.jsonl", "id": 68150, "text": "(3) Share with the affiliated parties and the franchisee", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68151, "text": "To facilitate us to provide you with unified and standard products and services, your personal information may be shared with our affiliated companies and franchisees.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We may share your personal information with related companies and franchisees to provide unified and standard products and services."}
{"task": "rw_91.jsonl", "id": 68152, "text": "We will only share the necessary personal information and be restricted by the purpose declared in this privacy policy.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68153, "text": "If we share your personal sensitive information, or the purpose of the company (or the franchise) to change the purpose of the use and processing of personal information, we will solicit your consent again.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68154, "text": "2. Personal information collection list", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68155, "text": "Information type information name use scenario use purpose", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68156, "text": "Basic information mobile phone number registration, login, identity verification", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68157, "text": "notification", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68158, "text": "Registration and login of Mai Le Sailing Member Account", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68159, "text": "It is convenient for users to receive notifications and marketing activities related to orders", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68160, "text": "Commodity or service delivery", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68161, "text": "Network operator one -click login fast registration and login service", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68162, "text": "Third -party account information (the only identifier, nickname, avatar) registration and login of the third -party platform;", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68163, "text": "Multi -platform members binding", "label": [], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68164, "text": "Exclusive benefits or marketing activities for third -party platforms provide you with registration and login service", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68165, "text": "Cumulative points of consumption of various platforms", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68166, "text": "Exclusive benefits", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68167, "text": "McDonald's member nickname, gender, birth date member data editing, and improve membership information", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68168, "text": "Order information order number, purchase content or service, order time, service store, payment amount and method to pick up meals to realize goods or service delivery", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68169, "text": "Receivers' name, contact information, receiving address, order information, Mai Le deliver meals to realize goods or service delivery", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68170, "text": "Name, mobile phone number prepaid card sales realize prepaid card purchase", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68171, "text": "Account information, order information customer service service customer service and after -sales service or dispute processing, event research", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68172, "text": "Activity information mobile phone number, child nickname, gender, date of birth, relative relationship, enlistment store booking birthday party and theme party organized offline birthday party or other theme activities", "label": ["Usage", "Edit/Control"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68173, "text": "Name, mobile phone number, and receiving address marketing activities realize the delivery of real prizes", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68174, "text": "Pay information order number, transaction amount payment scenario complete payment function", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68175, "text": "Order number, order time, invoice amount, invoice head, tax number and mailbox application for invoices for users to obtain information, marketing activities information, personalized recommendations, consumer evaluation information", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68176, "text": "Network platform security guarantee", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68177, "text": "Browse information search records, browsing record information display and search according to the search content matching display related products or services", "label": ["Usage", "First Party Collection Information"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68178, "text": "Personalized recommendation", "label": ["Usage"], "rewrite": []}
{"task": "rw_91.jsonl", "id": 68179, "text": "<the-end-of-privacy-policy>", "label": [], "rewrite": []}
