{"task": "rw_99.jsonl", "id": 70240, "text": "NetEase Privacy Policy", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70241, "text": "Updated in this version: 2021 [11] month [1] Day", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70242, "text": "[Foreword] NetEase Group and its affiliated companies (hereinafter collectively referred to as \"NetEase\" or \"us\") have always promised to protect users who use Netease products and services (hereinafter collectively referred to as \"NetEase Service\") (hereinafter collectively referred to as \"users\" or \"you\" or \"you\" or \"you\"\") Personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70243, "text": "When you use NetEase services, we may collect and use your personal information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70244, "text": "We hope to explain to you through the \"NetEase Privacy Policy\" (hereinafter referred to as \"this policy\") to explain related matters such as collecting and using your relevant personal information to better protect your rights and interests.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70245, "text": "[Special Tips] This policy is applicable to all NetEase services we provided.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70246, "text": "When you use any single service, you agree to accept the protection of this policy and the protection of specific privacy information policy (hereinafter referred to as \"specific terms\") we set in this single service. In this caseAt the same time, it will be effective for you.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70247, "text": "Users under the age of 14, at the same time, apply this policy and the \"Personal Information Protection Rules and Instructions for Children for Children in Children\".", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70248, "text": "If the specific terms of specific terms and the terms of the policy have inconsistent agreement, the specific terms shall be subject to specific terms within the scope of the constraints.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70249, "text": "If a single service we provide is not applicable to this policy, the service will explicitly explicitly eliminate the applicable policy in an appropriate manner.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70250, "text": "Before using various NetEase services, please be careful to read and thoroughly understand this policy, especially the clauses that are identified by the thick body. You should focus on reading and start using it after confirmation and consent.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70251, "text": "If you do not agree with the content of this policy, it may cause NetEase services to be unable to run normally or to achieve the service effect we are going to achieve, you should immediately stop access/use NetEase services.", "label": ["Policy Change", "Important"], "rewrite": "If this policy does not agree, it may cause NetEase services to be unable to run normally."}
{"task": "rw_99.jsonl", "id": 70252, "text": "After reading this policy, if you have any problems with this policy or related matters related to this policy, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" chapters in this policy, and we will answer you as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70253, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70254, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70255, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70256, "text": "Third, we may share, transfer and disclose personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70257, "text": "4. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70258, "text": "5. How to manage your personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70259, "text": "Six, third -party service", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70260, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70261, "text": "Eight, revise and notice", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70262, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70263, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70264, "text": "We collect your personal information mainly to use NetEase services easier and more satisfactory to you and other users.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70265, "text": "NetEase's goal is to provide all Internet users with a security, interesting and teaching Internet experience, and this information helps us achieve this goal.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70266, "text": "(1) We will collect and obtain your personal information through the following channels:", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect and get your personal information through the following channels:"}
{"task": "rw_99.jsonl", "id": 70267, "text": "1. The information you provide.", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70268, "text": "For example:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70269, "text": "(1) When you register the account of the NetEase service or use Netease services, you provide the information to us;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the information you provided when you register for the account of the NetEase service or use the NetEase service."}
{"task": "rw_99.jsonl", "id": 70270, "text": "(2) The shared information provided by the third party through NetEase services, and the information stored when you use Netease services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the sharing information provided to a third party through the NetEase service and the information stored when you use Netease services."}
{"task": "rw_99.jsonl", "id": 70271, "text": "Please note that in the information that you uploaded or published in the open area of other users in NetEase services, you can disclose your information in a response to other people uploaded or published. These information may be collected and collected by othersUse.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The information you posted in the open area of the NetEase service and your information on the response to others, these information may be collected and used."}
{"task": "rw_99.jsonl", "id": 70272, "text": "When you find that others collect or use your information, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70273, "text": "2. Your information shared by a third party.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70274, "text": "That is, third -party provides sharing information on your service when using Netease services.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70275, "text": "3. The information we get.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70276, "text": "When you use Netease services, we collect, summarize, and record information, such as log information, location information, and equipment information.", "label": ["Important", "First Party Collection Information"], "rewrite": "When using NetEase services, collect, summarize, record log information, location information, and equipment information."}
{"task": "rw_99.jsonl", "id": 70277, "text": "(2) We will collect and use your personal information for the following goals:", "label": ["First Party Collection Information"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70278, "text": "We need to remind you in particular: Since our products and services are more and the content provided for you is different, the relevant business functions (including the types of your personal information) will also be due to the product/service you chooseDifferent content is different. For details, please refer to the actual product/service.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70279, "text": "In addition, you understand and agree, we want to provide you with a perfect product and service, so we will continue to improve our products and services, which meansWe may often launch new services or business functions or re -divide business functions, and may need to collect new personal information or change personal information use purpose or methods.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect new personal information or change the purpose or method of using personal information."}
{"task": "rw_99.jsonl", "id": 70280, "text": "If we want to use your personal information in other uses that have not been stated in this policy or other unprepared personal information, we will obtain youagree.", "label": ["Important", "First Party Collection Information"], "rewrite": "If the personal information is used in this policy that the unreasonable use or additional personal information is collected, the consent will be obtained through page prompts, interaction processes, website announcements or other methods."}
{"task": "rw_99.jsonl", "id": 70281, "text": "In the process, you can contact us through the feedback channels listed in the chapter of the \"How to contact us\" in this policy, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70282, "text": "1. Help you complete the registration and login", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70283, "text": "In order to facilitate us to provide you with continuous and stable services and ensure your security of your use of NetEase services, we need to provide you with basic registration or login information, including mobile phone numbers, email addresses, and creating your account number, username and password.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect basic registration or login information, including mobile phone numbers, email address, and create accounts, usernames and passwords."}
{"task": "rw_99.jsonl", "id": 70284, "text": "In some single services, if you only need to use basic functions such as browsing, search, you do not need to register as NetEase users and provide the above information.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you only need to use basic functions such as browsing and search, you do not need to register as NetEase users and provide the above information."}
{"task": "rw_99.jsonl", "id": 70285, "text": "You can also fill in or supplement your other additional information (such as your nickname, avatar, gender, home, occupation, education, birth date, hobbies) during the registration, login or subsequent use process. This will help usProvide you with personalized and better service experience, but if you do not provide this information, it will not affect your basic functions of using NetEase services.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your other additional information (such as your nicknames, avatars, gender, nationality, occupation, occupation, academic qualifications, date of birth, hobbies) for optimization services."}
{"task": "rw_99.jsonl", "id": 70286, "text": "2. Implement identity authentication", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70287, "text": "Account book), biometric information (static or dynamic) and other identity information to complete identity certification.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect real identity information (such as name, ID card, passport, driver's license, hukou book), biometric information (static or dynamic) and other identity information to complete identity certification."}
{"task": "rw_99.jsonl", "id": 70288, "text": "If you do not provide the above information, we will not be able to provide you with related functions and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If the above information is not provided, related functions and services will not be provided."}
{"task": "rw_99.jsonl", "id": 70289, "text": "In order to achieve the purpose of identity certification, you agree and authorize us to provide, inquire, and check your aforementioned identity information with your own identity authentication agencies (such as personal credit reporting agencies, government departments, etc.) on your own or entrusted to the third direction.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "The relevant identity authentication agencies (such as personal credit reporting agencies, government departments, etc.) have been checked for their own identity information on their own."}
{"task": "rw_99.jsonl", "id": 70290, "text": "Please note that your identity information and biometric information are sensitive personal information. Please provide it with caution. If you refuse to provide you, you may not be able to obtain related services, but do not affect the normal use of other functions and services.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Refusing to provide identity information and biometric information may not obtain related services, but does not affect the normal use of other services."}
{"task": "rw_99.jsonl", "id": 70291, "text": "3. Normal operation of maintaining basic functions", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70292, "text": "In the process of using our service, we provide you with basic functions such as browsing and searching, and identify the abnormal status of the account, understand the product adaptability, and ensure the network and operation of NetEase services to maintain the normal operation of the aforementioned basic functions. WeMay directly or indirectly collect and store information about your services and use methods and associate this information. This information includes:", "label": ["Important", "First Party Collection Information"], "rewrite": "The information will be collected directly or indirectly, and the information is related to this information."}
{"task": "rw_99.jsonl", "id": 70293, "text": "(1) Log Information: When you use our services (including the state of running in the background), we may automatically collect your detailed usage situation of our services and save it as a network log.", "label": ["Important", "First Party Collection Information"], "rewrite": "It will automatically collect your detailed usage of the service and save it as a network log."}
{"task": "rw_99.jsonl", "id": 70294, "text": "For example: your login account, search query content, IP address, the type of browser, telecommunications operator, network environment, language use, visit date and time, and web browsing records you accessRecords, release records, attention, subscriptions, collection and sharing.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect your login account, search query content, IP address, browser type, telecommunications operator, network environment, language use, visit date and time, and web browsing records you access, Publish records, attention, subscriptions, collection and sharing."}
{"task": "rw_99.jsonl", "id": 70295, "text": "(2) Equipment information: When you use our service (including the background running status), we may receive and record the relevant information related to the equipment you use.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the relevant information you use."}
{"task": "rw_99.jsonl", "id": 70296, "text": "For example: device models, operating systems and versions, client versions, device resolution, package name, device settings, process and software list, device logo, Card IMSI, Information), Software and Hardware Characteristic Information, Equipment Related Information (for example, IP, Address, GPS Location, and WLAN access point, Bluetooth and base station sensor information that can provide relevant information).", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect equipment models, operating systems and versions, client versions, device resolution, package name, device settings, process and software list, device logo (MAC address/IMEI/Android ID/idfa/Openudid/Guid/SIM card IMSIInformation), software and hardware feature information, information related to the location of the device (such as IP address, GPS location, and WLAN access point, Bluetooth and base station sensor information that can provide relevant information)."}
{"task": "rw_99.jsonl", "id": 70297, "text": "In order to collect the above -mentioned basic personal equipment information, we will apply for the authority of accessing your equipment information. We collect this information to provide you with basic services and basic functions. If you refuse to provide the above permissionsServe.", "label": ["Permission Acquisition", "Important", "First Party Collection Information", "Risk"], "rewrite": "The authority to apply for access to the device, if refusal to provide the above permissions, may cause you to be unable to use Netease services."}
{"task": "rw_99.jsonl", "id": 70298, "text": "Please note that separate equipment information and log information are information that cannot recognize specific natural person status.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70299, "text": "If we use this type of non -personal information with other information to identify a specific natural person or use it with personal information, during the combination of use, such non -personal information will be regarded as personal information, except for obtaining your authorization.Or in addition to other provisions of laws and regulations, we will anonymous and de -identification processing of this type of personal information.", "label": ["Important", "Data Security"], "rewrite": "Except for your authorization or laws and regulations, the personal information will be anonymous and de -identified."}
{"task": "rw_99.jsonl", "id": 70300, "text": "This information will be handled and protected as your personal information during the combination of use.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70301, "text": "4. Provide you with interaction and release service", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70302, "text": "When you use Netease services, upload and/or publish information, and do related interactive behaviors (such as publishing follow -up, replying to follow -up, top stickers, like articles, publishing, sharing, collection, rewarding), we will collectYou upload, publish or form information, and use your nicknames, avatars and publishing content for display.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Collect the information you upload, publish or form, and use your nickname, avatar and publishing content for display."}
{"task": "rw_99.jsonl", "id": 70303, "text": "。", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70304, "text": "Please note that the information you publish may include your personal information or sensitive personal information, please consider it carefully before the release.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70305, "text": "If the information you posted involves the personal information of others, you should obtain the consent of others before the release.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "If the information you posted involves the personal information of others, you should obtain the consent of others before the release."}
{"task": "rw_99.jsonl", "id": 70306, "text": "5. Help you complete the order, pay and deliver the goods or services to you", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70307, "text": "(1) When you order specific products and/or services in NetEase services, we will generate orders for you to purchase the product and/or service for you through the system.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70308, "text": "In the process of placement, you need to provide at least the consignee's personal identity information, name, receipt address, postal code, consignee, contact number, payment status information.", "label": ["Important", "First Party Collection Information"], "rewrite": "During the order, collect the consignee's personal identity information, name, delivery address, postal code, postal code, consignee, contact phone number, payment status information."}
{"task": "rw_99.jsonl", "id": 70309, "text": "If you refuse to provide such information, we will not be able to complete the relevant delivery service.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you refuse to provide such information, you will not be able to complete the relevant delivery service."}
{"task": "rw_99.jsonl", "id": 70310, "text": "If you order goods or services for others through NetEase services, you need to provide the aforementioned information of the actual subscriber.", "label": ["Important", "First Party Collection Information"], "rewrite": "If you order goods or services for others through NetEase services, you need to collect the aforementioned information of the actual ordering person."}
{"task": "rw_99.jsonl", "id": 70311, "text": "Before you provide us with the aforementioned information of the actual ordering person, you need to ensure that you have obtained its authorization consent;", "label": ["Important", "First Party Collection Information"], "rewrite": "Before providing us with the aforementioned information of the actual ordering person, you need to ensure that you have obtained its authorization consent."}
{"task": "rw_99.jsonl", "id": 70312, "text": "(2) To show you the transaction information of the account and ensure the security of the transaction, we will collect the information you generate in the process of using the NetEase service (such as the product or service information, specific order number, order creation time, transaction amount, the transaction amount you purchased) Used to show you and facilitate your management of orders;", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect information generated during the use of NetEase services (such as purchased goods or service information, specific order number, order creation time, transaction amount) for display and order management."}
{"task": "rw_99.jsonl", "id": 70313, "text": "(3) In order to complete the order payment, delivery of goods or services, confirm the transaction status, and provide you with after -sales and dispute solution services, we will collect the transaction objects, payment institutions, logistics companies, etc. based on the exchanges.Your account, order, transaction, payment, logistics information, or share your transaction information with the above -mentioned service providers.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Collect account numbers, orders, transactions, payment, logistics information related to transaction progress, or share your transaction information with the above -mentioned service providers."}
{"task": "rw_99.jsonl", "id": 70314, "text": "6. Provide you with customer service or other user response functions", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70315, "text": "When you contact our customer service or use other users to respond to functions (such as selling after -sale after sale, personal information protection complaints or suggestions, other customer complaints and needs), we may need you to provide the necessary personal informationUser identity to ensure your account and system security.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect the necessary personal information to match and verify the user status."}
{"task": "rw_99.jsonl", "id": 70316, "text": "We may also save your contact information (you use us when you contact us or other contact information you provide to us), you have the communication/call records and content with our communication, and other necessary information associated with your needs.In order to contact you or help you solve the problem, or record the processing schemes and results of related issues.", "label": ["Important", "First Party Collection Information"], "rewrite": "Collect contact information, communication/call records and content, and other necessary information associated with your needs, for contact."}
{"task": "rw_99.jsonl", "id": 70317, "text": "7. Your personal information we collected indirectly:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70318, "text": "Based on the NetEase service you choose to use, we may obtain information you authorized shared from related parties and third -party partners.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Get information about your authorization sharing from related parties and third -party partners."}
{"task": "rw_99.jsonl", "id": 70319, "text": "For example, when you log in to the NetEase service with an account on a third -party platform, we will obtain the relevant information under the third -party account based on your authorization (including: user name, nickname, avatar, specifically your authorization content), which shall prevail.After you agree with this policy, you will bind your third -party account with your NetEase service account so that you can log in to and use NetEase services directly through a third -party account.", "label": ["Third Party Sharing/ Disclosure", "Important", "First Party Collection Information"], "rewrite": "Get the relevant information under the third -party account (including: user name, nickname, avatar, specifically your authorization content)."}
{"task": "rw_99.jsonl", "id": 70320, "text": "We will collect and use your information on the premise of complying with relevant laws and regulations and based on the agreement with related parties or third -party partners, and confident the source of information provided.", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70321, "text": "8. Provide you information display and push to you", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70322, "text": "Based on the information you provided to us, the information we may collect, and your information we collected indirectly (such as your browsing and search records, equipment information, location information, order information), we may be based on the above item.Or the combination of several information, carry out recommendation algorithm modeling, programmatic advertising recommendation algorithm modeling, user behavior analysis, and user portraits to extract your browsing, search preferences, behavioral habits, location information related features in order to provide you withPage display and recommendation of personalized content that fit your needs.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "Based on the combination of the above or several information, recommend algorithm modeling, programmatic advertising recommendation algorithm modeling, user behavior analysis, and user portrait."}
{"task": "rw_99.jsonl", "id": 70323, "text": "We may also send you marketing information and user research based on e -mail, SMS or other methods based on feature labels to help us improve NetEase services and provide or promote our/third -party products and services:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70324, "text": "Our goods and services include but are not limited to: instant messaging services, online media services, interactive entertainment services, social network services, payment services, Internet search services, location and map services, application software and services, data management software and services, services, data management software and services, and services, data management software and services, and services, data management software and services, and services, data management software and services, and services, data management software and services.Online advertising services, Internet finance and other social media, entertainment, online games, e -commerce, information and communication software and services;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70325, "text": "and", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70326, "text": "Third -party products and services include but are not limited to: Internet services, food and catering, sports, music, movies, television, live performances and other arts and entertainment, books and books, magazines and other publications, clothing and accessories, jewelry, cosmetics, individuals, individuals, individuals, individualsHealth and hygiene, electronics, collectibles, home utensils, electrical appliances, home decoration and furnishings, pets, cars, hotels, transportation and tourism, banking, insurance and financial services, points and reward programs, as well as others we think may be related to youCommodity and services.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70327, "text": "If you want to manage our personalized services, you can operate according to the guidance provided by the single service you use.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70328, "text": "9. Provide you with security guarantee", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70329, "text": "In order to improve the security of your service to provide services with our and partners, protect the safety of your or other users or the public from being infringed, and better prevent fishing websites, fraud, network vulnerabilities, computer viruses, network attacks, network invasion, etc.Security risk, more accurately identify the rules of violations of laws and regulations or the relevant agreement rules of NetEase services, we may collect, use or integrate your account information, transaction information, equipment information, log information, and our related companies and partners to obtain your authorizationOr according to the information shared by the law, to comprehensively judge your account and transaction risk, conduct authentication, test and prevent security incidents, and take necessary records, audit, analysis, and disposal measures in accordance with the law.", "label": ["Data Security", "Important", "First Party Collection Information"], "rewrite": "It will collect, use or integrate account information, transaction information, equipment information, log information, and information that our affiliated companies and partners are authorized or shared in accordance with the law to comprehensively judge the account and transaction risk."}
{"task": "rw_99.jsonl", "id": 70330, "text": "10. You understand and agree that some single services may require you to turn on specific access permissions in your device to achieve the collection and use of information involved in these permissions.", "label": ["Permission Acquisition", "Important"], "rewrite": "Some single services need to open specific access permissions in the device to achieve the collection and use of information involved in these permissions."}
{"task": "rw_99.jsonl", "id": 70331, "text": "For example:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70332, "text": "(1) After you turn on the storage authority, you allow us to access your storage space in order to enable you to download and save the content, or to achieve the corresponding services such as", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to open the storage permission."}
{"task": "rw_99.jsonl", "id": 70333, "text": "(2) After you turn on the equipment information permissions, you allow us to obtain your device information as the unique identifier for your device to provide you with pages to display and recommend personalized content in accordance with your needs, understand product adaptability, understand product adaptability, Identify abnormal status and ensure the security of NetEase services;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to open the equipment information authority."}
{"task": "rw_99.jsonl", "id": 70334, "text": "(3) After you turn on the album and/or camera (camera) permissions, you can upload, take photos/pictures/videos, and implement functions such as publishing information and reviews, live video, or communicating with customer service to provide proof;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to open the album and/or camera (camera) permissions."}
{"task": "rw_99.jsonl", "id": 70335, "text": "(4) After you turn on the communication record of communication, we can get your communication information information in order to provide you with a friend status query, invite your friends to use NetEase services, and share content/products you know;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to open a communication record authority."}
{"task": "rw_99.jsonl", "id": 70336, "text": "(5) After you turn on the microphone and related voice rights, you can use voice functions to interact with our products, others, or contact customer service;", "label": ["Permission Acquisition", "Important"], "rewrite": "Apply to open the microphone and related voice authority."}
{"task": "rw_99.jsonl", "id": 70337, "text": "(6) After you open the position permissions, we can get your location information so that you can interact with your information with nearby friends or push you personalized content to you;;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Apply to open position permissions."}
{"task": "rw_99.jsonl", "id": 70338, "text": "(7) After you open the permissions that we can read/write to your calendar, we can get your schedule to provide you with functions such as records, appointments, reminders.", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Application can read/write the permissions of your calendar."}
{"task": "rw_99.jsonl", "id": 70339, "text": "When you need to close these functional authority, most mobile devices will support your needs. For specific methods, please refer to or contact your mobile device service providers or manufacturers.", "label": ["Edit/Control"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70340, "text": "Please note that when you start the right of power, it means that you authorize us to collect and use relevant information to provide you with corresponding services. Once you turn off the right of authority, it means that you cancel the authorization.Using relevant information, it is impossible to provide you with the service corresponding to the permissions.", "label": ["Important", "Edit/Control"], "rewrite": "Opening one authority means that the authorization can collect and use relevant information. Once you turn off the power, it means that you cancel the authorization."}
{"task": "rw_99.jsonl", "id": 70341, "text": "However, your decision to close permissions will not affect the collection and use of information based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "The decision to close permissions will not affect the collection and use of information based on authorization."}
{"task": "rw_99.jsonl", "id": 70342, "text": "11. Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70343, "text": "According to relevant laws and regulations, collecting your information in the following situations does not need to obtain your authorization consent:", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "In the following situations, collect your information without obtaining your authorization consent:"}
{"task": "rw_99.jsonl", "id": 70344, "text": "(1) Directly related to national security and national defense security;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting personal information directly related to national security and national defense security, no consent is required."}
{"task": "rw_99.jsonl", "id": 70345, "text": "(2) Directly related to public safety, public health, and major public interests;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information directly related to public safety, public health, and major public interests without agreeing."}
{"task": "rw_99.jsonl", "id": 70346, "text": "(3) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without agreeing."}
{"task": "rw_99.jsonl", "id": 70347, "text": "(4) Out of maintaining major legitimate rights and interests of your or other individuals, but it is difficult to get my consent;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to get personal information that I agree, no need to agree."}
{"task": "rw_99.jsonl", "id": 70348, "text": "(5) The personal information collected is made by your own public;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The collected personal information is made to the public by itself without consent."}
{"task": "rw_99.jsonl", "id": 70349, "text": "(6) Signing and fulfilling the contract according to your requirements;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collecting the personal information necessary for signing and performing the contract, there is no need to agree."}
{"task": "rw_99.jsonl", "id": 70350, "text": "(7) Collect personal information from the information disclosed by legal publicly, such as legal news reports, government information disclosure and other channels; and other channels;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "If you collect personal information from the legal disclosure information, you don't need to agree."}
{"task": "rw_99.jsonl", "id": 70351, "text": "(8) It is necessary to carry out legal news reports;", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collection of personal information necessary for legal news reports does not need to agree."}
{"task": "rw_99.jsonl", "id": 70352, "text": "(9) Other circumstances stipulated in laws and regulations.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree."}
{"task": "rw_99.jsonl", "id": 70353, "text": "12. Tips about sensitive personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70354, "text": "Sensitive personal information refers to personal information that can easily cause the personality dignity of natural people to be infringed or harmed by personal and property security once it is leaked or illegally used.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70355, "text": "The above provided by you or we collect your information may include your sensitive personal information, such as ID number, personal biometric information (static or dynamic), bank account number, communication records and content, property information, trajectory trajectory, accommodation, accommodation, accommodation, accommodation, accommodation, accommodation, accommodation, accommodation, accommodation, accommodationInformation, transaction information.", "label": ["Important", "First Party Collection Information", "Risk"], "rewrite": "The above provided by you or we collect your information may include your sensitive personal information."}
{"task": "rw_99.jsonl", "id": 70356, "text": "Please be careful and pay attention to sensitive personal information. You agree that we can process your sensitive personal information according to the purpose and method described in this policy.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70357, "text": "2. How do we use cookies or similar technologies", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70358, "text": "We or our partners may obtain and use your information through cookies or similar technologies, and store such information as log information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "May obtain and use your information through cookies or similar technologies, and store such information as a log information."}
{"task": "rw_99.jsonl", "id": 70359, "text": "By using Cookies, we provide users with a simple and easy -going and personalized network experience.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70360, "text": "A cookies are a small amount of data, which are sent from a network server to your browser and there are computer hard disks.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70361, "text": "We use cookies to benefit its users.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70362, "text": "For example, in order to make the login process of NetEase virtual community faster, you can choose to exist in a cookies.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70363, "text": "In this way, when you log in to NetEase's service, you can be more convenient and fast.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70364, "text": "Cookies can help us determine the pages and content you are connected, and you spend time on Netease's specific services and NetEase services you choose.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70365, "text": "Cookies enables us to serve you better and faster, and make your experience in NetEase services more personalized.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70366, "text": "However, you should be able to control whether cookies and how your browser is accepted.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70367, "text": "Please check the files attached to your browser to get more information in this area.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70368, "text": "We and third -party partners may collect and use your information through cookies or similar technologies and store such information.", "label": ["Data Retention", "Important", "First Party Collection Information"], "rewrite": "It may collect and use your information through cookies or similar technologies and store these information."}
{"task": "rw_99.jsonl", "id": 70369, "text": "We use our own cookies or similar technologies, which may be used for the following uses:", "label": ["Important", "Usage"], "rewrite": "Using your own cookies or similar technologies may be used in the following purposes:"}
{"task": "rw_99.jsonl", "id": 70370, "text": "1. Remember your identity.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70371, "text": "For example: cookies or similar technologies help us identify your identity as our registered user, or save you to provide us with your preferences or other information;", "label": ["Data Retention"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70372, "text": "2. Analyze the situation of your service.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70373, "text": "We can use Cookies or similar technologies to understand what activities you use for NetEase services, or which services are the most popular;", "label": ["Important", "Usage"], "rewrite": "You can use cookies or similar technologies to understand what activities you use for NetEase services or what services are most popular."}
{"task": "rw_99.jsonl", "id": 70374, "text": "3. Advertising optimization.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70375, "text": "Cookies or similar technologies help us provide you with advertisements related to you instead of universal advertising according to your information.", "label": ["Important", "Usage"], "rewrite": "Cookies or similar technologies help you provide you with advertisements related to you instead of general advertising."}
{"task": "rw_99.jsonl", "id": 70376, "text": "When we use Cookies or similar technologies for the above purposes, we may be provided to advertisers and other partners collected through cookies or non -personal identity information collected through cookies or similar technologies to analyze how you and other users use NetEase services and advertising services.", "label": ["Third Party Sharing/ Disclosure", "Important", "Usage"], "rewrite": "Non -personal identity information collected through cookies or similar technologies is provided to advertisers and other partners for how to use NetEase services and advertising services."}
{"task": "rw_99.jsonl", "id": 70377, "text": "Netease services may have Cookies or similar technologies placed by advertisers and other partners.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70378, "text": "These cookies, or similar technologies, may collect non -personal identity information related to you to analyze how users use such services, send ads you may be interested in, or use the effects of advertising services.", "label": ["Important", "First Party Collection Information", "Usage"], "rewrite": "These cookies or similar technologies may collect non -personal identity information related to you for user analysis."}
{"task": "rw_99.jsonl", "id": 70379, "text": "These third -party cookies or similar technologies are collected and used by such information that are not bound by this policy, but are subject to their own information protection statements. We are not responsible for third -party Cookies or similar technologies.", "label": ["First Party Collection Information", "Risk"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70380, "text": "You can refuse or manage cookies or similar technologies through a browser or user selection mechanism.", "label": ["Edit/Control", "Important"], "rewrite": "You can refuse or manage cookies or similar technologies through browser or user selection mechanism."}
{"task": "rw_99.jsonl", "id": 70381, "text": "But please note that if you stop using cookies or similar technologies, we may not be able to provide you with the best service experience, and certain services may not be used normally.", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "If Cookies or similar technologies are discontinued, it may not be possible to provide the best service experience, and certain services may not be used normally."}
{"task": "rw_99.jsonl", "id": 70382, "text": "At the same time, you will still receive advertisements, but these advertisements will be reduced with you.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70383, "text": "Third, we may share, transfer or disclose personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70384, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70385, "text": "We attach great importance to protecting your personal information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70386, "text": "Except for the following situations, without your consent, we will not share your personal information with any third party other than Netease:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Except for the following situations, without separate consent, you will not share your personal information with any third party other than Netease:"}
{"task": "rw_99.jsonl", "id": 70387, "text": "1. Share sharing to achieve our service/functions.", "label": ["Third Party Sharing/ Disclosure", "Risk"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70388, "text": "In some cases, we need to share your information from a third party to realize the functions of our products and/or services, so that you use the services you need normally, including: (1) a third -party payment institution providing payment servicesShare the corresponding transaction order information and payment amount information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share the corresponding transaction order information and payment amount information to a third -party payment institution providing payment services."}
{"task": "rw_99.jsonl", "id": 70389, "text": "(2) Share order information to third -party merchants and logistics service providers stationed in the NetEase platform;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share order information to third -party merchants and logistics service providers stationed in the NetEase platform."}
{"task": "rw_99.jsonl", "id": 70390, "text": "(3) Share the information required for real -name authentication service providers;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share the information required for real -name authentication service providers."}
{"task": "rw_99.jsonl", "id": 70391, "text": "(4) Other suppliers, service providers and business partners that are related to our service/functions must be shared.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Other suppliers, service providers and business partners related to service/functions must be shared."}
{"task": "rw_99.jsonl", "id": 70392, "text": "2. Need to share with some of our partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Need to share with some of our partners."}
{"task": "rw_99.jsonl", "id": 70393, "text": "In order to smoothly carry out the necessary/reasonable business, meet your requirements, fulfill our obligations in relevant user agreements or in this policy, exercise our rights or comply with legal regulations, we may need to share your information from some partners, Including: (1) partners who provide data services (including online advertising monitoring, data statistics, data analysis, etc.) shared log information and equipment information;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "It may be necessary to share your information from some partners, including: (1) to share log information and equipment information to partners who provide data services."}
{"task": "rw_99.jsonl", "id": 70394, "text": "(2) Partners who provide product analysis services (including application crash analysis, network performance analysis, domain name analysis optimization) sharing statistical data (such as collapse and flashback);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share the statistical data of your product usage (such as collapse and flashback) partners with product analysis services."}
{"task": "rw_99.jsonl", "id": 70395, "text": "(3) Share your relevant information (including: equipment information) to partners who provide marketing services (including advertising and marketing);", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share relevant information (including: equipment information) to partners who provide marketing services (including advertising and marketing)."}
{"task": "rw_99.jsonl", "id": 70396, "text": "(4) Several people who entrust us to promote us to promote the promotion information or the products they purchased after seeing the information, or provide them with statistical information that cannot recognize their personal identity, helping them understand their audiences to understand their audienceOr customer;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Share the promotion information to the partners to watch the number of information and the purchase information of the product, as well as statistical information that cannot identify personal identity, to understand its audience."}
{"task": "rw_99.jsonl", "id": 70397, "text": "(5) Need to share other partners with some of our partners.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Others are necessary to share with some of our partners."}
{"task": "rw_99.jsonl", "id": 70398, "text": "3. Need to share with our affiliates.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70399, "text": "In order to facilitate our unified account system to provide you with consistent services and facilitate your unified management, personalized recommendation, guarantee system and account security, your personal information may be necessary to share between us and our affiliated parties., Including: 1) In order to help you save time and simplify the operation process, you can log in to some single services after registering our NetEase mobile phone account/mailbox account.Necessary sharing inside the product;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your account related information will be shared within the products of our affiliated parties."}
{"task": "rw_99.jsonl", "id": 70400, "text": "2) In order to make you and/or services in our affiliate products and/or services, consistent and personalized service experiences, you know and agree, your account information, equipment information, related browsing data, etc. reflect youInformation using habits and hobbies may be shared with our related parties.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Your account information, equipment information, related browsing data, etc. The information that reflects the habit of use may be shared with our affiliates."}
{"task": "rw_99.jsonl", "id": 70401, "text": "4. Realize the other purposes described in the first part of this policy \"how do we collect and use personal information\".", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70402, "text": "5. Perform our obligations in this policy or other agreements with you and you to exercise our rights.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70403, "text": "6. In the scope allowed by laws and regulations, in order to abide by the law and maintain the interests of our affiliated parties or partners, you or other NetEase users or other NetEase users, property, or security exempt from damage, such as to prevent fraud from illegal activities and other illegal activities andTo reduce credit risk, we may exchange information with other companies and organizations.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "May exchange information with other companies and organizations."}
{"task": "rw_99.jsonl", "id": 70404, "text": "However, this does not include information that violates the promise made in this policy and is sold, rented, shared or disclosed in other ways.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70405, "text": "7. You should be in your legal needs or with your authorization consent.", "label": ["Third Party Sharing/ Disclosure"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70406, "text": "8. Provide your information at the legal requirements of your supervisor.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "You provide your information at your legal requirements."}
{"task": "rw_99.jsonl", "id": 70407, "text": "9. According to the single service protocol signed with you (including the electronic agreement signed online and the corresponding platform rules) or other legal documents, it provided.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Based on a single service agreement (including the electronic agreement signed online and the corresponding platform rules) or other legal documents, it agreed to share personal information."}
{"task": "rw_99.jsonl", "id": 70408, "text": "10. Provided based on academic research.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share personal information based on academic research."}
{"task": "rw_99.jsonl", "id": 70409, "text": "11. Provided based on public interests based on laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information is shared based on the public interests of laws and regulations."}
{"task": "rw_99.jsonl", "id": 70410, "text": "We will only share your personal information for legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "It will only share personal information for the purpose of legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_99.jsonl", "id": 70411, "text": "Companies, organizations and individuals who share personal information with us, we will sign a strict confidentiality agreement with them, asking them to process information in accordance with our instructions, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "Companies, organizations and individuals who share personal information with us will sign a strict confidentiality agreement with them."}
{"task": "rw_99.jsonl", "id": 70412, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70413, "text": "1. With the sustainable development of our business, we may have a merger, acquisition, asset transfer or similar transactions, and your information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Your information may be transferred as a part of mergers, acquisitions, asset transfer or similar transactions."}
{"task": "rw_99.jsonl", "id": 70414, "text": "We will ask new companies and organizations holding your personal information to continue to be subject to this policy. Otherwise, we will ask the company and the organization to reconcile your authorization consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "We will ask new companies and organizations holding your personal information to continue to be subject to this policy. Otherwise, we will ask the company and the organization to reconcile your authorization consent."}
{"task": "rw_99.jsonl", "id": 70415, "text": "2. After getting your clear consent, we will transfer your personal information to a third party.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "After getting your clear consent, we will transfer your personal information to a third party."}
{"task": "rw_99.jsonl", "id": 70416, "text": "(3) Disclosure", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70417, "text": "We will disclose your personal information only under the following circumstances and adopt the premise that the industry standards meet the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Only under the following circumstances and adopting security measures that meet the industry standards, your personal information will be disclosed:"}
{"task": "rw_99.jsonl", "id": 70418, "text": "1. According to your needs, disclose the information you specified under your clear consent.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Discover the information you specified under the disclosure of your clear consent."}
{"task": "rw_99.jsonl", "id": 70419, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide your information, we may disclose your information based on the type and disclosure method required.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "You will disclose your information based on the type and disclosure method required."}
{"task": "rw_99.jsonl", "id": 70420, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask the receiver to issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When receiving the request of the above disclosure information, the receiver will be required to issue corresponding legal documents, such as a subpoena or an investigation letter."}
{"task": "rw_99.jsonl", "id": 70421, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70422, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70423, "text": "(4) Sharing, transfer, and disclosure of information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70424, "text": "In the following circumstances, sharing, transfer, and disclose your information does not need to obtain your authorization consent in advance:", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "In the following circumstances, sharing, transfer, and disclose your information does not need to obtain your authorization consent in advance:"}
{"task": "rw_99.jsonl", "id": 70425, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information that shared, transferred, and disclosed directly related to national security and national defense security does not need to agree."}
{"task": "rw_99.jsonl", "id": 70426, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information of sharing, transfer, disclosure directly related to public safety, public health, and major public interests does not need to agree."}
{"task": "rw_99.jsonl", "id": 70427, "text": "3. It is directly related to judicial or administrative law enforcement such as criminal investigation, prosecution, trial and judgment.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Sharing, transfer, disclosure, and personal information directly related to judicial or administrative law enforcement related to criminal investigation, prosecution, trial, and judgment implementation without agreeing."}
{"task": "rw_99.jsonl", "id": 70428, "text": "4. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The personal information of sharing, transfer, and disclosure out of its consent is difficult to obtain the major legitimate rights and interests, and it is not necessary to agree."}
{"task": "rw_99.jsonl", "id": 70429, "text": "5. The information you disclose to the public by yourself;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Share, transfer, and disclose information you disclose to the public yourself without agreeing."}
{"task": "rw_99.jsonl", "id": 70430, "text": "6. Collect information from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The information collected from legal public disclosure channels does not need to agree."}
{"task": "rw_99.jsonl", "id": 70431, "text": "7. It is related to the obligations stipulated in the performance of our laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "Personal information related to the obligations stipulated in laws and regulations is shared without consent."}
{"task": "rw_99.jsonl", "id": 70432, "text": "According to the law, sharing, transfer, and disclose personal information that has been identified by de -identified processing, and ensure that the data receiver cannot restore and re -identify the main information of the information, which is not an external sharing, transfer and public disclosure of personal information.The preservation and treatment will not be notified to you separately and obtain your consent.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "The preservation and processing of personal information that is identified will not need to notify you separately and obtain your consent."}
{"task": "rw_99.jsonl", "id": 70433, "text": "4. How do we store and protect personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70434, "text": "(1) Storage of personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70435, "text": "In addition to laws and regulations or regulatory authorities, we only store your personal information in the purpose of this policy's purpose and shortest time limit.", "label": ["Data Retention", "Important"], "rewrite": "Store your personal information only in the purpose of this policy's purpose and shortest time limit."}
{"task": "rw_99.jsonl", "id": 70436, "text": "If we terminate our services or operations, we will stop collecting your personal information in time. At the same time, we will comply with relevant laws and regulations to inform you in advance, and delete or processes your personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Important", "Data Security", "Cessation of Operations"], "rewrite": "If the service is terminated, it will stop collecting personal information in time, and at the same time notify you in advance, and delete or processes personal information after terminating the service."}
{"task": "rw_99.jsonl", "id": 70437, "text": "The personal information we collected and generated in the operation of the People's Republic of China is stored in China. Except for the following situations: except:", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The personal information collected and generated in the operation of the People's Republic of China is stored in China, except for the following situations:"}
{"task": "rw_99.jsonl", "id": 70438, "text": "1. The laws and regulations have clear stipulation;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "If the laws and regulations are clearly stipulated, personal information is stored abroad."}
{"task": "rw_99.jsonl", "id": 70439, "text": "2. Get your authorization consent;", "label": ["Data Retention", "Important", "Risk"], "rewrite": "With your authorization consent, personal information is stored abroad."}
{"task": "rw_99.jsonl", "id": 70440, "text": "3. The NetEase service you use involves cross -border, and NetEase needs to provide your personal information overseas.", "label": ["Data Retention", "Important", "Risk"], "rewrite": "The NetEase service you use involves cross -border, and NetEase needs to provide your personal information overseas."}
{"task": "rw_99.jsonl", "id": 70441, "text": "In response to the above situations, we will ensure that it is implemented in accordance with national laws and regulations and relevant regulatory authorities, and provides sufficient protection for your personal information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70442, "text": "(2) Protection of personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70443, "text": "We attach great importance to information security, set up a special security team, and take all reasonable and feasible measures to protect your personal information:", "label": ["Important", "Data Security"], "rewrite": "Established a special security team and took all reasonable and feasible measures to protect personal information."}
{"task": "rw_99.jsonl", "id": 70444, "text": "1. Data security technical measures", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70445, "text": "We will adopt security measures that meet industry standards, including establishing reasonable institutional norms and security technology to prevent your personal information from being accessed, using, modifying, and avoiding data damage or loss.", "label": ["Important", "Data Security"], "rewrite": "Safety protection measures that meet industry standards will be adopted, including the establishment of reasonable institutional specifications and security technologies to prevent personal information from being unauthorized access, use, and modification."}
{"task": "rw_99.jsonl", "id": 70446, "text": "Our services have adopted a variety of encryption technologies, such as in certain NetEase services, we will use encrypted technology (such as SSL) to encrypt your personal information and isolate through isolation technology to protect your personal information.", "label": ["Important", "Data Security"], "rewrite": "The encryption technology (such as SSL) will be encrypted to save personal information and isolate through isolation technology to protect personal information."}
{"task": "rw_99.jsonl", "id": 70447, "text": "When the personal information is used, such as information display and information association calculation, we will use multiple data desensitization technology to enhance the security of information in use.", "label": ["Important", "Data Security"], "rewrite": "Use a variety of data desensitization technology to enhance the security of information in use."}
{"task": "rw_99.jsonl", "id": 70448, "text": "We will also use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid data from illegal use.", "label": ["Important", "Data Security"], "rewrite": "Use strict data access permissions control and multiple identity authentication technology to protect personal information to avoid illegal use of data."}
{"task": "rw_99.jsonl", "id": 70449, "text": "2. Other security measures we have taken to protect personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70450, "text": "We have the industry's advanced data as the core and the data security management system carried out around the data life cycle. From the aspects of organizational construction, system design, personnel management, and product technology, we improve the security of the entire system.", "label": ["Data Security"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70451, "text": "We manages the storage and use of personal information by establishing a data classification classification system, data security management specifications, and data security development specifications.", "label": ["Important", "Data Security"], "rewrite": "Manage the storage and use of personal information by establishing a data classification grading system, data security management specifications, and data security development specifications."}
{"task": "rw_99.jsonl", "id": 70452, "text": "We control the data through the confidentiality agreement, monitoring and audit mechanism through information contactors.", "label": ["Important", "Data Security"], "rewrite": "Through information contacts confidentiality agreements, monitoring and auditing mechanisms, the data is fully securely controlled."}
{"task": "rw_99.jsonl", "id": 70453, "text": "We will also organize safety and privacy protection training courses to strengthen employees' awareness of security and understanding of personal information protection policies and related regulations.", "label": ["Important", "Data Security"], "rewrite": "The safety and privacy protection training courses will be held to strengthen employees' awareness of security and understanding of personal information protection policies and related regulations."}
{"task": "rw_99.jsonl", "id": 70454, "text": "3. We only allow Netease employees and partners to visit your personal information, and we have set up strict access to control and monitoring mechanisms for this reason.", "label": ["Important", "Data Security"], "rewrite": "NetEase employees and partners who are only necessary to know about this information can access personal information and set up strict access to control and monitoring mechanisms."}
{"task": "rw_99.jsonl", "id": 70455, "text": "We also require all personnel who may be exposed to your personal information to fulfill the corresponding confidentiality obligations.", "label": ["Important", "Data Security"], "rewrite": "At the same time, all personnel who may be exposed to personal information can perform the corresponding confidentiality obligations."}
{"task": "rw_99.jsonl", "id": 70456, "text": "If these obligations fail to fulfill these obligations, they may be held legal or suspended with Netease's cooperative relationship.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70457, "text": "4. The Internet is not an absolutely secure environment, and the communication method of email, instant messaging, social software or other service software cannot determine whether it is completely encrypted. We recommend that you use this kind of tool to use complex passwords and pay attentionProtect your information security.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70458, "text": "When communicating or purchasing goods and services with third parties through NetEase services, you inevitably disclose your information to the other party or the potential transaction party, such as the contact method or postal address.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70459, "text": "Please protect your information properly and provide others with only necessary situations.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70460, "text": "5. The Internet environment is not 100 % security. We will try our best to ensure or guarantee the security of your personal information you send to our personal information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70461, "text": "If our physics, technology, or management protection facilities are damaged, personal information is caused by non -authorized access, public disclosure, tampering, or destruction, resulting in damage to your legitimate rights and interests, we will bear the corresponding legal responsibility.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70462, "text": "6. Safety event disposal", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70463, "text": "In order to cope with the possible risks of personal information leakage, damage and loss, we have formulated a number of systems to clarify the classification and classification standards of security events, the classification standards of security vulnerabilities, and the corresponding processing process.", "label": ["Important", "Data Security"], "rewrite": "We have formulated a number of systems to clarify the classification and classification standards of security events, safety vulnerabilities, and corresponding processing processes."}
{"task": "rw_99.jsonl", "id": 70464, "text": "The emergency response team that we also established for security events, in accordance with the requirements of the safety incident, launch a safety plan for different security incidents, conduct stop loss, analysis, positioning, formulation of remedial measures, and combined with relevant departments to trace the source and crack down.", "label": ["Important", "Data Security"], "rewrite": "The emergency response team established for security events, in accordance with the requirements of security incidents, launch a safety plan for different security events."}
{"task": "rw_99.jsonl", "id": 70465, "text": "We also regularly organize internal training and emergency drills to enable our relevant staff to master the corresponding emergency disposal strategies and regulations.", "label": ["Important", "Data Security"], "rewrite": "Regularly organize internal training and emergency drills to enable relevant staff to master the corresponding emergency response strategies and regulations."}
{"task": "rw_99.jsonl", "id": 70466, "text": "After unfortunately, the information security incident occurs, we will inform you in a timely manner in accordance with the requirements of the laws and regulations: the basic situation and possible impact of the security incident, the disposal measures we have taken or we are going to take, the suggestions that you can prevent and reduce risks independently and reduce risks, Remedy for your remedy.", "label": ["Important", "Data Security"], "rewrite": "After the information security incident occurs, I will inform you in a timely manner in accordance with the requirements of laws and regulations."}
{"task": "rw_99.jsonl", "id": 70467, "text": "At the same time, we will inform you that the incident -related situation is in the form of mail, letter, telephone, push notification, etc. When it is difficult to inform the information subject one by one, we will publish an announcement in a reasonable and effective way.", "label": ["Important", "Data Security"], "rewrite": "Inform you in a timely manner, informing you with emails, letters, etc., it is difficult to inform the information of the information one by one, and an announcement will be published in a reasonable and effective way."}
{"task": "rw_99.jsonl", "id": 70468, "text": "At the same time, we will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities.", "label": ["Important", "Data Security"], "rewrite": "We will also actively report the disposal of information security incidents in accordance with the requirements of the regulatory authorities."}
{"task": "rw_99.jsonl", "id": 70469, "text": "Please understand that due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that the information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70470, "text": "You need to understand that the system and communication network you used to access NetEase services may occur due to the situation outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70471, "text": "Please keep your account, password and other identity elements properly.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70472, "text": "When you use Netease services, we will identify your identity through your account, password and other identity elements.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70473, "text": "Once you leak the aforementioned information, you may suffer losses and may be unfavorable to you.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70474, "text": "If you find an account, password and/or other identity elements that may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Important", "Data Security"], "rewrite": "If you find that your identity may or has leaked, please contact us immediately so that you can take corresponding measures in time to reduce related losses."}
{"task": "rw_99.jsonl", "id": 70475, "text": "5. How to manage your personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70476, "text": "(1) Access, update and delete", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70477, "text": "We encourage you to update and modify your personal information to make it more accurate and effective.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70478, "text": "If you want to query, modify or delete some of your information, log in to NetEase Account Center (Please log in to the NetEase mailbox account, https://reg.163.com;", "label": ["Important", "Edit/Control"], "rewrite": "If you want to query, modify or delete some information, log in to the NetEase Account Center (please log in to https://reg.163.com."}
{"task": "rw_99.jsonl", "id": 70479, "text": "NetEase mobile phone account, please log in to https://aq.reg.reg.163.com/ydaq/offline#/) and the relevant functional pages of each single service. We provide you with related operation guidelines and operation settings.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70480, "text": "For your information collected through cookies or similar technologies, we also explain the selection mechanism provided to you in the second part of this policy \"how do we use the cookies or similar technologies\".", "label": ["Important", "First Party Collection Information"], "rewrite": "For information collected through Cookies, it also explains the selection mechanism provided in the second part of this policy \"how do we use cookies or similar technologies\"."}
{"task": "rw_99.jsonl", "id": 70481, "text": "You can also contact us to deal with us through the feedback channels listed in the \"How to contact us\" chapters in this policy.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70482, "text": "We will adopt appropriate technical means or contact channels to enable you to access, update and delete your personal information or other information provided when using NetEase services, except for laws and regulations.", "label": ["Important", "Edit/Control"], "rewrite": "We will adopt appropriate technical means or contact channels to enable you to access, update and delete your personal information, except for other provisions of laws and regulations."}
{"task": "rw_99.jsonl", "id": 70483, "text": "Except for other provisions of laws and regulations, when you correct and delete your personal information, we may not immediately correct or delete the corresponding information from the backup system, but this information will be corrected or deleted when the backup is updated.", "label": ["Important", "Edit/Control"], "rewrite": "When correction and deleting personal information, you may not immediately correct or delete the information from the backup system, but will be more correct or deleted when the backup is updated."}
{"task": "rw_99.jsonl", "id": 70484, "text": "(2) Public and sharing", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70485, "text": "Many of our services allow you to share your relevant information publicly with your social network, but also the information you uploaded or published in the NetEase service, you upload or publish the information you uploaded or published in the NetEase serviceThe response issued by the published information is uploaded or published in an open area that is visible to the unsteady user in NetEase services, as well as location data and log information including this information related to this information.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "Many of our services allow you to share your relevant information with all users using the service."}
{"task": "rw_99.jsonl", "id": 70486, "text": "As long as you do not delete the information you disclosed or shared, the information may always stay in the public field;", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "As long as you do not delete the information disclosed or shared, the relevant information may always stay in the public field."}
{"task": "rw_99.jsonl", "id": 70487, "text": "Even if you delete the shared information, the relevant information may be cached, copied or stored independently by other users or the third parties that are not controlled by us, or are preserved by other users or such third parties in the public.", "label": ["Data Retention", "Edit/Control", "Risk", "Important"], "rewrite": "Even if the shared information is deleted, the relevant information may still be cached, copied or stored independently by third parties, or is preserved by other users in the public field."}
{"task": "rw_99.jsonl", "id": 70488, "text": "If you disclose or share information through the above channels, we will not bear responsibility for your information leakage.", "label": ["Third Party Sharing/ Disclosure", "Important", "Risk"], "rewrite": "If the information is disclosed or shared through the above channels, the information caused by it will not be responsible."}
{"task": "rw_99.jsonl", "id": 70489, "text": "Therefore, we remind and ask you to consider whether to disclose or share your information through the above channels.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70490, "text": "(3) Account cancellation", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70491, "text": "We provide you with a way to cancel your account.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70492, "text": "In the case that meets our terms of service terms and stipulated in relevant national laws and regulations, you can submit an account cancellation application in accordance with the corresponding requirements (NetEase mailbox account, please log in to https://reg.163.com and click \"Account Logging \";", "label": ["Important", "Edit/Control"], "rewrite": "You can submit an account cancellation application at the NetEase Account Center (please log in to https://reg.163.com and click \"Account Logging\" at the NetEase mailbox account."}
{"task": "rw_99.jsonl", "id": 70493, "text": "Please log in to https://aq.reg.reg.reg.reg. reG.163.com/ydaq/offline#/ and click \"Account Logging\").Essence", "label": ["Important", "Edit/Control"], "rewrite": "Please log in to https://aq.reg.reg.reg. reg.reg. reg.reg. reg. reg.163.com/ydaq/offline#/ and click \"Account Log canceling\"). The cancellation of some single service accounts may need to be operated according to the specific guidelines prompted by the service page."}
{"task": "rw_99.jsonl", "id": 70494, "text": "You can also choose to contact us through the feedback channels listed in the chapter of \"How to contact us\" through this policy, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70495, "text": "After the cancellation of your account, we will stop providing you with all or part of NetEase services, and delete your personal information or do anonymous processing according to your requirements, except for other regulations.", "label": ["Edit/Control", "Important"], "rewrite": "After the account cancellation, it will stop providing you with all or part of the service, delete personal information or do anonymous processing, except for other provisions of laws and regulations."}
{"task": "rw_99.jsonl", "id": 70496, "text": "(4) Change the scope of your authorization consent", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70497, "text": "You can always choose whether to disclose personal information to us.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70498, "text": "Some personal information is necessary to use Netease services, but most of the other information is determined by you.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70499, "text": "You can change your authorization of the scope of information or withdraw your authorization by deleting information, closing the device function, and cancellation account.", "label": ["Important", "Edit/Control"], "rewrite": "You can change the scope of the authorized collection information or withdraw authorization by deleting information, closing the device function, and cancellation account."}
{"task": "rw_99.jsonl", "id": 70500, "text": "After the withdrawal authorization, we cannot continue to provide you with the service corresponding to the withdrawal authorization, and we will no longer process your corresponding information.", "label": ["Important", "Edit/Control"], "rewrite": "When the authorization is withdrawn, it is impossible to continue to provide you with the service corresponding to the withdrawal authorization, and no longer process your corresponding information."}
{"task": "rw_99.jsonl", "id": 70501, "text": "But your decision to withdraw authorization will not affect the information processing based on your authorization.", "label": ["Permission Acquisition", "Edit/Control", "Risk", "Important"], "rewrite": "But your decision to withdraw authorization will not affect the information processing based on your authorization."}
{"task": "rw_99.jsonl", "id": 70502, "text": "(5) Copy for personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70503, "text": "If you need a copy of your personal information, you can contact us through the feedback channel listed in the chapter of the \"How to contact us\" chapter in this policy. After verifying your identity, we will provide you with your personal information in our serviceCopy (including basic information, identity information), but otherwise provided by laws and regulations or except for this policy.", "label": ["Important", "Edit/Control"], "rewrite": "After verifying our identity, we will provide a copy of personal information (including basic information, identity information), but the laws and regulations have other provisions or except for this policy."}
{"task": "rw_99.jsonl", "id": 70504, "text": "(6) In response to your above request", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70505, "text": "To ensure safety, you may need to provide a written request or prove your identity in other ways.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70506, "text": "We may ask you to verify your identity first, and then process your request.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70507, "text": "For your reasonable request, we do not charge fees in principle, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "For reasonable requests, in principle, we do not charge fees, but we will charge a certain cost fee depending on the request that repeats and beyond the reasonable limit."}
{"task": "rw_99.jsonl", "id": 70508, "text": "For those who have no repetition and need too much technical means (for example, need to develop new systems or fundamentally change the current practice), bring risks to others' legitimate rights and interests or very unrealistic (for example, information involved in backup tapes)We may refuse.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We may refuse those who have no repetition, too much technical means or very unrealistic requests."}
{"task": "rw_99.jsonl", "id": 70509, "text": "In the following circumstances, we will not be able to respond to your request:", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "In the following circumstances, we will not be able to respond to your request:"}
{"task": "rw_99.jsonl", "id": 70510, "text": "1. Related to the obligations stipulated in the performance of our laws and regulations;", "label": ["Edit/Control", "Risk", "Important"], "rewrite": "Those who are related to our obligations stipulated in our laws and regulations cannot respond to requests."}
{"task": "rw_99.jsonl", "id": 70511, "text": "2. Directly related to national security and national defense security;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Directly related to national security and national defense security cannot respond to requests."}
{"task": "rw_99.jsonl", "id": 70512, "text": "3. Directly related to public safety, public health, and major public interests;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to public safety, public health, and major public interests cannot respond to requests."}
{"task": "rw_99.jsonl", "id": 70513, "text": "4. Directly related to criminal investigation, prosecution, trial and execution judgment;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who are directly related to criminal investigation, prosecution, trial, and execution judgments cannot respond to requests."}
{"task": "rw_99.jsonl", "id": 70514, "text": "5. We have sufficient evidence to indicate that you have subjective malice or abuse of rights;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "We have sufficient evidence that if you have subjective malice or abuse of rights, we cannot respond to requests."}
{"task": "rw_99.jsonl", "id": 70515, "text": "6. For major legitimate rights and interests such as maintaining your or other individuals, but it is difficult to get my consent;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "It is difficult to respond to the request for maintaining major legitimate rights and interests, but it is difficult to get my consent."}
{"task": "rw_99.jsonl", "id": 70516, "text": "7. Response your request will cause the legitimate rights and interests of you or other individuals and organizations to be seriously damaged;", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Response your request will cause serious damage to legitimate rights and interests and cannot respond to the request."}
{"task": "rw_99.jsonl", "id": 70517, "text": "8. Involved in business secrets.", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "Those who involve business secrets cannot respond to requests."}
{"task": "rw_99.jsonl", "id": 70518, "text": "Six, third -party service", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70519, "text": "Netease services may access or link to social media or other services provided by third parties (including websites or other services).", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70520, "text": "include:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70521, "text": "1. You can use the \"Share\" key to share certain NetEase services to third -party services, or you share third -party service content to NetEase services.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70522, "text": "These functions may collect your information (including your log information) and install cookies in your device to run the above functions normally;", "label": ["Important", "First Party Collection Information"], "rewrite": "These features may collect information (including your log information) and install cookies in the device."}
{"task": "rw_99.jsonl", "id": 70523, "text": "2. We provide you through advertising or other ways of service, so that you can link to the service or website of a third party;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70524, "text": "3. Other conditions to access third -party services.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70525, "text": "For example, in order to achieve the purpose of this policy, we may access the SDK or other similar applications provided by third -party service providers (such as embedded code, plug -in, etc.) to provide you with better customer services anduser experience.", "label": ["Important", "First Party Collection Information"], "rewrite": "We may access the SDK or other similar applications provided by a third -party service provider (such as embedded code, plug -in, etc.) to provide better customer services."}
{"task": "rw_99.jsonl", "id": 70526, "text": "At present, the third -party service providers we connect mainly include the following types:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70527, "text": "(1) For advertising -related services, including advertising display, advertising data monitoring/statistics, etc.;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70528, "text": "(2) For message push functions, including mobile phone manufacturer Push push, specific event reminder, personalized content recommendation, etc.;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70529, "text": "(3) Used to pay related services, including order payment, transaction behavior verification, income settlement, payment information remittance president, etc.;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70530, "text": "(4) Use the location permissions of the device with your consent, collect equipment information and log information, etc.;", "label": ["Permission Acquisition", "Important", "First Party Collection Information"], "rewrite": "Get equipment location permissions, collection equipment and log information with your consent."}
{"task": "rw_99.jsonl", "id": 70531, "text": "(5) Used for third -party authorization services, including third -party account login, sharing relevant content to third -party products, etc.;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70532, "text": "(6) Used to support product function modules, including online live broadcast, video playback, voice recognition, AR, smart customer service, barrage playback, content storage, etc.;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70533, "text": "(7) Used to optimize product performance, including improving hardware distribution capacity, reducing server costs, function heat repair, etc.;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70534, "text": "(8) Used for account security and product reinforcement related services, including network monitoring, domain name analysis, anti -hijacking, anti -junk anti -cheating, plus decryption services, etc.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70535, "text": "Some third -party SDKs or applications we access may collect your personal information. If you use such services provided by third parties in our services, you agree that it will directly collect and process your information.", "label": ["Important", "First Party Collection Information"], "rewrite": "Some third -party SDKs or similar applications we access may collect your personal information."}
{"task": "rw_99.jsonl", "id": 70536, "text": "We will evaluate the legality, legitimacy, and necessity of such third -party services to collect personal information, and require these third parties to take protection measures for your personal information, and strictly abide by relevant laws and regulations and regulatory requirements.", "label": ["Important", "Data Security"], "rewrite": "It will evaluate the legitimacy, legitimacy, and necessity of such third -party services to collect personal information, and require these third parties to take protection measures for personal information."}
{"task": "rw_99.jsonl", "id": 70537, "text": "You can click \"Third -Party SDK Catalog\" to learn about the basic situation of the third -party SDK we mainly access. Each single service may be different from the third -party SDK. If you need to understand the detailed situation of the specific single service to access the third -party SDKPlease go to the corresponding service page and check the specific terms and related pages of our single services.", "label": ["Third Party Sharing/ Disclosure", "First Party Collection Information"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70538, "text": "You can also choose to contact us through the feedback channels listed in the chapter of \"How to contact us\" through this policy, and we will answer it as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70539, "text": "The above third -party social media or other services are operated by related third parties.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70540, "text": "You use these third -party social media services or other services (including any information you provided to these third parties), which must be restricted by the third party's own service terms and information protection statements (not this policy).Read its clauses.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70541, "text": "This policy is only applicable to the personal information we collected, and it does not apply to the service provided by any third party or the rules of information use of third -party information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70542, "text": "If you find that these third -party social media or other services are risky, it is recommended that you terminate related operations to protect your legitimate rights and interests and get in touch with us in time.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70543, "text": "7. Protection of minors", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70544, "text": "We suggest: Any minor participating in online activities should obtain the consent of the parents or other guardians (hereinafter referred to as the \"guardian\") in advance.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70545, "text": "We will protect relevant information about minors in accordance with the provisions of relevant national laws and regulations.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70546, "text": "We encourage guardians to guide minors to use NetEase services.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70547, "text": "If you are a minor under the age of 14, please notify your guardian to read and accept our \"NetEase Children's Personal Information Protection Rules and Guardian Notes\" and seek it before you use NetEase services and submit personal information, seek itAgree and guidance.", "label": ["Specific Audiences", "Important"], "rewrite": "If you are a minor under the age of fourteen, please notify the guardian to read and accept our \"NetEase Children's Personal Information Protection Rules and Guardian Notes\" and seek its consent and guidance."}
{"task": "rw_99.jsonl", "id": 70548, "text": "。", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70549, "text": "Eight, revise and notice", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70550, "text": "In order to provide you with better services, we may modify the terms of this policy in a timely manner according to the update of NetEase services and the relevant requirements of laws and regulations. These modifications constitute a part of the policy policy.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70551, "text": "We will announce any changes to this policy on this page.", "label": ["Policy Change", "Important"], "rewrite": "We will announce any changes to this policy on this page."}
{"task": "rw_99.jsonl", "id": 70552, "text": "For major changes, we will also provide more significant notifications (including website announcements, push notifications, pop -ups prompts or other methods). The major changes referred to in this policy include, but not limited to:", "label": ["Policy Change", "Important"], "rewrite": "For major changes, it will also provide more significant notifications (including website announcements, push notifications, pop -ups, or other methods)."}
{"task": "rw_99.jsonl", "id": 70553, "text": "1. Make a major change in our service model.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70554, "text": "Such as the purpose of handling personal information, the type of personal information, the use of personal information, etc.;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70555, "text": "2. We have undergone major changes in the structure of ownership.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70556, "text": "Such as changes caused by business adjustments, bankruptcy mergers and acquisitions, etc.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70557, "text": "3. The main object of personal information sharing, transfer or public disclosure has changed significantly;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70558, "text": "4. The right to participate in personal information processing and its exercise methods have changed significantly;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70559, "text": "5. We are responsible for dealing with the responsible departments, contact methods and complaint channels for handling personal information security;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70560, "text": "6. Other important or may seriously affect your personal rights and interests.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70561, "text": "Any of our modification will put your satisfaction first.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70562, "text": "We encourage you to check our privacy policy every time you use Netease services.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70563, "text": "Nine, how to contact us", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70564, "text": "We have set up a full -time department for personal information protection and will protect your personal information in accordance with this policy.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70565, "text": "If you have any questions, opinions or suggestions on the complaints and reports of network information security, or you have any questions, opinions or suggestions on the privacy measures of this policy, NetEase, and your information, please contact the person in charge of the personal information protection of Netease and send emails to send emails.To privacy@service.netease.com or write to the following address: No. 399, NetEase No. 399, NetEase Binjiang District, Hangzhou, Personal Information Protection (receipt);", "label": ["Important", "Contact Information"], "rewrite": "You can send emails to privacy@service.netease.com or write to the following addresses: The person in charge of the second phase of the second phase of the NetEase Phase II Phase III Period of NetEase Binjiang District, Hangzhou."}
{"task": "rw_99.jsonl", "id": 70566, "text": "Postcode: 310052.", "label": ["Important", "Contact Information"], "rewrite": "Postcode: 310052."}
{"task": "rw_99.jsonl", "id": 70567, "text": "Under normal circumstances, we will deal with your problems, opinions or suggestions, and verify your user identity.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70568, "text": "If you are not satisfied with our handling, you can also complain and report to the departments that perform the responsibilities of personal information protection.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70569, "text": "<it is delimiter>", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70570, "text": "NetEase Children's Personal Information Protection Rules and Guardian Instructions", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70571, "text": "Netease Group and its affiliated companies (hereinafter collectively referred to as \"NetEase\" or \"us\") know the importance of children (referring to minors under the age of 14, the same below) personal information and privacy security.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70572, "text": "We hope that through the \"NetEase Children's Personal Information Protection Rules and Guardian Instructions\" (hereinafter referred to as \"this policy\"), it explains that we correspond to related matters such as collecting and using personal information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70573, "text": "Before using our various products and services (hereinafter collectively referred to as \"NetEase Services\"), please ask children, parents or other guardians (hereinafter collectively referred to as \"guardian\") must read and thoroughly understand this policy, especially with rough body logos.The terms of the clause should be read. After confirming the full understanding and agreeing to all the terms before starting to use it.", "label": ["Specific Audiences", "Important"], "rewrite": "Before using various products and services, ask children, children, or other guardians to read carefully and thoroughly understand this policy."}
{"task": "rw_99.jsonl", "id": 70574, "text": "Special description of the guardian:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70575, "text": "If we learn that your child is less than fourteen years old, we will take special measures based on this policy to protect the personal information of your child obtained.", "label": ["Specific Audiences", "Important"], "rewrite": "If your child is less than fourteen years old, we will take special measures based on this policy to protect the child's personal information."}
{"task": "rw_99.jsonl", "id": 70576, "text": "Please help us protect your children's personal information and privacy security, ask them to read and accept this policy together under your guardianship, and use NetEase services and submit personal information under your consent and guidance.", "label": ["Specific Audiences"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70577, "text": "If you do not agree with the content of this policy, it may cause NetEase services to be unable to run normally or to achieve the service effect we are going to achieve, you should ask your child to stop access/use NetEase services immediately.", "label": ["Specific Audiences", "Important"], "rewrite": "If this policy is not agreed, it may cause NetEase services to be unable to run normally or to achieve the service effect, and you should stop access/use NetEase services immediately."}
{"task": "rw_99.jsonl", "id": 70578, "text": "You click to agree to this policy online, or your child uses/continues to use NetEase services and submit personal information, all said that you agree that we can collect, use, store, share, transfer, and disclose your child in accordance with this policy (including updated versions).Personal information.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Click to agree to this policy online, or continue to use NetEase services and submit personal information, all agrees to process personal information in accordance with this policy."}
{"task": "rw_99.jsonl", "id": 70579, "text": "Children's special description:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70580, "text": "We suggest: Any child should obtain the consent of the guardian in advance.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70581, "text": "If you are a child, please notify your guardian to read this policy together and seek the consent and guidance of your guardian before you use Netease services and submit personal information.", "label": ["Specific Audiences", "Important"], "rewrite": "Before using NetEase services and submit personal information, seek the consent and guidance of the guardian."}
{"task": "rw_99.jsonl", "id": 70582, "text": "You clicked on the line on the line to agree to this policy, or you use/continue to use Netease services and submit personal information, which indicates that you have obtained the permission of your guardian. The per capita of your guardians, Storage, sharing, transfer, and disclose your personal information.", "label": ["Policy Change", "Specific Audiences", "Important"], "rewrite": "Click to agree to this policy online, or continue to use NetEase services and submit personal information, all indicate that the guardian has obtained the permission of the guardian."}
{"task": "rw_99.jsonl", "id": 70583, "text": "This policy applies to activities such as collecting, using, storage, sharing, transfer, and disclosure of children's personal information through the Internet in the People's Republic of China.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70584, "text": "When children use any NetEase service, the guardian agrees to accept this policy and the protection of the rules (if yes, the following referred to as \"specific terms\") in this single service, in this caseAt the same time as the terms of this policy, it has effective in the guardian and children.", "label": ["Specific Audiences", "Important"], "rewrite": "When children use any NetEase service, the guardian agrees to accept the protection of the rules of this policy and the personal information protection rules of specific children."}
{"task": "rw_99.jsonl", "id": 70585, "text": "If the specific terms of specific terms and the terms of the policy have inconsistent agreement, the specific terms shall be subject to specific terms within the scope of the constraints.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70586, "text": "If a single service we provide is not applicable to this policy, the service will explicitly explicitly eliminate the applicable policy in an appropriate manner.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70587, "text": "In terms of personal information protection rules for children, this policy is inconsistent with the text of the \"NetEase Privacy Policy\", and this policy is preferred. If it is not mentioned in this policy, the \"NetEase Privacy Policy\" shall prevail.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70588, "text": "After reading this policy, if you have any problems with this policy or related matters related to this policy, you can contact us through the feedback channels listed in the chapter listed in the chapter \"How to contact us\" in this policy, and we will answer as soon as possible.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70589, "text": "This policy will help you understand the following:", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70590, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70591, "text": "2. We may share, transfer or disclose personal information of children", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70592, "text": "3. How do we store and protect personal information of children", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70593, "text": "4. How to manage children's personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70594, "text": "Five, third -party service", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70595, "text": "6. The revision of this policy", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70596, "text": "Seven, how to contact us", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70597, "text": "1. How do we collect and use personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70598, "text": "(1) We will strictly fulfill the obligations and responsibilities of children's personal information protection stipulated in laws and regulations, and follow the principles of legitimate necessity, knowledge consent, clear purpose, security, and use according to law.The", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "It will strictly fulfill the obligations and responsibilities of children's personal information protection, and follow the principles of legitimate necessity, consent of knowledge, clear purpose, safety guarantee, and use according to law."}
{"task": "rw_99.jsonl", "id": 70599, "text": "1. In some single services, we may ask users to fill in personal birthday information or identify information according to the user to identify whether the user is a child, and in accordance with the provisions of laws and regulations, only after obtaining the consent of the guardianNetEase service.", "label": ["Specific Audiences", "Important"], "rewrite": "It may be required to fill in personal birthday information or identify information according to the user to identify whether the user is a child. After obtaining the consent of the guardian, children are allowed to continue using related NetEase services."}
{"task": "rw_99.jsonl", "id": 70600, "text": "2. When we identify the user as a child, we may collect the contact information of the guardian (such as mobile phone numbers, e -mail), and contact the guardian to verify that it has a guardian relationship with children.", "label": ["Specific Audiences", "Important"], "rewrite": "When we identify the user as a child, we will collect the contact information of the guardian (such as mobile phone numbers, email)."}
{"task": "rw_99.jsonl", "id": 70601, "text": "In order to better protect the rights and interests of children, we may also collect more information from the guardian (such as names, ID cards, household registrations, or other custody relationships) in order to further verify the guardians of guardians and children.", "label": ["Specific Audiences", "Important"], "rewrite": "Collect more information to the guardian (such as name, ID card, household registration, or other custody relationships) in order to further verify the guardians of the guardian and children."}
{"task": "rw_99.jsonl", "id": 70602, "text": "3. In the process of children's use of NetEase services, we may also collect and use personal information of other children. For details, please check the chapters of \"NetEase Privacy Policy\" \"How can we collect and use personal information\" to learn more about it.", "label": ["First Party Collection Information", "Specific Audiences"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70603, "text": "If we need to collect and use the personal information of the children, we will once again obtain the consent of the guardian.", "label": ["Specific Audiences", "Important", "First Party Collection Information"], "rewrite": "If we need to collect and use the personal information of the children, we will once again obtain the consent of the guardian."}
{"task": "rw_99.jsonl", "id": 70604, "text": "(2) Exception of obtaining authorization consent", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70605, "text": "According to relevant laws and regulations, the information of children's information collection in the following situations does not need to obtain the authorization consent of children and/or guardians:", "label": ["Risk", "Specific Audiences", "First Party Collection Information", "Important"], "rewrite": "In the following circumstances, the information of children's information is not required to obtain the authorization consent of children and/or guardians:"}
{"task": "rw_99.jsonl", "id": 70606, "text": "(1) Directly related to national security, national defense security, public safety, public health, and major public interests;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collect personal information directly related to national security, national defense security, public safety, public health, and major public interests."}
{"task": "rw_99.jsonl", "id": 70607, "text": "(2) Directly related to criminal investigation, prosecution, trial, and judgment execution;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collect direct personal information related to criminal investigation, prosecution, trial, and execution of judgment without agreeing."}
{"task": "rw_99.jsonl", "id": 70608, "text": "(3) For major legitimate rights and interests such as the life and property of the main body or other individuals, it is difficult to obtain the consent of the guardian;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting and maintaining major legitimate rights and interests, but it is difficult to obtain personal information that the guardian himself agrees, no consent is required."}
{"task": "rw_99.jsonl", "id": 70609, "text": "(4) The collected information is made by children or guardians to the public by themselves;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "The collected information is publicly disclosed by the children or guardians to the public and does not need to agree."}
{"task": "rw_99.jsonl", "id": 70610, "text": "(5) Collecting information from the legal public disclosure information, such as legal news reports, government information disclosure and other channels;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting information from legal publicly disclosed information does not need to agree."}
{"task": "rw_99.jsonl", "id": 70611, "text": "(6) Signing the contract according to the requirements of the guardian;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collecting the personal information necessary for the signing of the contract, there is no need to agree."}
{"task": "rw_99.jsonl", "id": 70612, "text": "(7) It is necessary to maintain the safe and stable operation of NetEase services, such as the failure of discovering and disposing of NetEase services;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collection of personal information necessary for safe and stable operations for NetEase services does not need to agree."}
{"task": "rw_99.jsonl", "id": 70613, "text": "(8) The information that automatically retains information through the computer information system and cannot identify the information retained is a child's personal information;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Those who automatically retain information through the computer information system and cannot identify the personal information of children, no need to agree."}
{"task": "rw_99.jsonl", "id": 70614, "text": "(9) When it is necessary to carry out statistics or academic research in public interests, and to provide academic research or description results, the information contained in the results is identified;", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "It is not necessary to agree to the personal information of statistics or academic research in the institute of statistics or academic research."}
{"task": "rw_99.jsonl", "id": 70615, "text": "(10) Other circumstances stipulated in laws and regulations.", "label": ["Specific Audiences", "First Party Collection Information", "Risk", "Important"], "rewrite": "Collect personal information under other circumstances stipulated in laws and regulations, no need to agree."}
{"task": "rw_99.jsonl", "id": 70616, "text": "(3) Tips on sensitive personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70617, "text": "Children's personal information is sensitive personal information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70618, "text": "The guardian and children are requested to be cautious and pay attention to the sensitive personal information of children. The guardian agrees that the sensitive personal information of children can handle the purpose and method described in this policy.", "label": ["Specific Audiences", "Important"], "rewrite": "The guardian agrees that children's related sensitive personal information can be handled according to the purpose and method described in this policy."}
{"task": "rw_99.jsonl", "id": 70619, "text": "2. We may share, transfer or disclose personal information of children", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70620, "text": "(1) Sharing", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70621, "text": "In addition to the following circumstances, without the consent of the guardian, we will not share the personal information of children with any third parties other than Netease:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "In addition to the following circumstances, without the consent of the guardian, you will not share your personal information with any third party other than a third party other than Netease:"}
{"task": "rw_99.jsonl", "id": 70622, "text": "1. Provide our services to children.", "label": ["Third Party Sharing/ Disclosure", "Risk", "Specific Audiences"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70623, "text": "We may share the information of children from partners and other third -party children to achieve the function of NetEase services and allow children to use the services required for normal use, such as payment institutions that provide payment services, merchants who settle in the NetEase platform, and provide data services (including networks, including networks (including networksPartners, third -party logistics companies and other service providers of advertising monitoring, data statistics, data analysis);", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "May share the information of children from partners and other third parties to achieve the function of NetEase services."}
{"task": "rw_99.jsonl", "id": 70624, "text": "2. Need to share with related parties.", "label": ["Third Party Sharing/ Disclosure", "Risk", "Specific Audiences"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70625, "text": "In order to facilitate our unified account system to provide children with consistent services and facilitate its unified management, personalized recommendation, guarantee system and account security, children’s personal information may be necessary to share between us and our affiliated parties.Items", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Children's personal information may be necessary to share between us and our affiliates."}
{"task": "rw_99.jsonl", "id": 70626, "text": "3. Realize the purpose of the first part of this policy \"how do we collect and use the personal information of children\";", "label": ["Third Party Sharing/ Disclosure", "Risk", "Specific Audiences"], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70627, "text": "4. Perform our obligations and the right to exercise our rights in this policy or our other agreements with our children and guardians;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "In order to fulfill our obligations in this policy or other agreements and exercise our rights, we share personal information."}
{"task": "rw_99.jsonl", "id": 70628, "text": "5. Share third -party sharing to third parties such as commissioned partners to promote us, the purpose is to make these clients understand the coverage and effectiveness of the promotion.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Shared third parties such as commissioned partners who commissioned us to promote."}
{"task": "rw_99.jsonl", "id": 70629, "text": "For example, we can inform how many people of the client read their promotional information or buy the commodity of the client after seeing the information, or provide them with statistical information that cannot recognize the individual identity of the child to help them understand their audience or customersItems", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Inform the commissioner's promotion information to watch the number of information or product purchase information, and provide them with statistical information that cannot recognize the personal identity of the child."}
{"task": "rw_99.jsonl", "id": 70630, "text": "6. In the scope allowed by laws and regulations, in order to abide by the law and maintain the interests of our affiliated parties or partners, children, guardians or other NetEase users or other NetEase users or public interests, property, or security, they are exempted from damage.We may exchange information with other companies and organizations.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "May exchange information with other companies and organizations."}
{"task": "rw_99.jsonl", "id": 70631, "text": "However, this does not include information that violates the commitments made in this policy and is sold, rented, shared or disclosed in other ways;", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70632, "text": "7. The consent of the legal needs of children or the authorization of the guardian;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Personal information should be shared at the legal needs of children or the authorization of the guardian."}
{"task": "rw_99.jsonl", "id": 70633, "text": "8. The legitimate requirements of the guardian;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "The guardian should be legally requested to share personal information."}
{"task": "rw_99.jsonl", "id": 70634, "text": "9. According to the single service protocol (including the electronic agreement signed online and the corresponding platform rules) or other legal documents, it provided;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Share personal information according to the single service agreement or other legal documents."}
{"task": "rw_99.jsonl", "id": 70635, "text": "10. Provided based on the public interests of laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Personal information is shared based on the public interests of laws and regulations."}
{"task": "rw_99.jsonl", "id": 70636, "text": "We will only share their personal information for children for the purpose of legal, correct, necessary, specific, and clear purposes.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Data Security", "Important"], "rewrite": "It will only share children's personal information for the purpose of legal, correct, necessary, specific, and clear purposes."}
{"task": "rw_99.jsonl", "id": 70637, "text": "We will conduct security assessments for companies, organizations and individuals who share personal information with us, and sign a strict confidentiality agreement with them, asking them to handle information in accordance with our instructions, this policy, and any other related confidentiality and security measures.", "label": ["Third Party Sharing/ Disclosure", "Important", "Data Security"], "rewrite": "For the subject of sharing personal information, a security assessment will be conducted and a strict confidentiality agreement is signed with it."}
{"task": "rw_99.jsonl", "id": 70638, "text": "(2) Transfer", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70639, "text": "1. With the continuous development of our business, we may conduct merger, acquisition, asset transfer or similar transactions, and children's information may be transferred as part of such transactions.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Children's information may be transferred as part of mergers, acquisitions, asset transfer or similar transactions."}
{"task": "rw_99.jsonl", "id": 70640, "text": "We will conduct a security assessment and require new companies and organizations that hold personal information of children to continue to be bound by this policy. Otherwise, we will ask the company and the organization to re -solicit the consent of the guardian.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "The security assessment will be conducted and the company that requires new children's personal information will continue to be subject to this policy. Otherwise, the company will ask the company to reconcile the consent of authorization from the guardian."}
{"task": "rw_99.jsonl", "id": 70641, "text": "2. After obtaining the consent of the guardian, we will transfer personal information of children to other parties.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "After obtaining the consent of the guardian, he will transfer his personal information to other parties."}
{"task": "rw_99.jsonl", "id": 70642, "text": "(3) Disclosure", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70643, "text": "We will only disclose the child's personal information only in the following circumstances and adopt the premise of the industry standards:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Important"], "rewrite": "Only under the following circumstances and adopting security measures that meet the industry standards, they will disclose their personal information:"}
{"task": "rw_99.jsonl", "id": 70644, "text": "1. According to the needs of children or guardians, disclose the information it specified under the disclosure of the guardian;", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "According to the needs of children or guardians, they disclose the information it specified under the disclosure of the guardian's consent."}
{"task": "rw_99.jsonl", "id": 70645, "text": "2. When the requirements of laws and regulations, mandatory administrative law enforcement or judicial requirements must provide children's information, we may disclose children's information based on the type of information and disclosure.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When children's information must be provided, children's information will be disclosed according to the type and disclosure of the required information."}
{"task": "rw_99.jsonl", "id": 70646, "text": "Under the premise of compliance with laws and regulations, when we receive a request for the above disclosure information, we ask the receiver to issue corresponding legal documents such as tickets or investigation letters.", "label": ["Third Party Sharing/ Disclosure", "Important"], "rewrite": "When receiving the request of the above disclosure information, the receiver will be required to issue corresponding legal documents such as subpoena or investigation letter."}
{"task": "rw_99.jsonl", "id": 70647, "text": "We firmly believe that for the information requested by us, it should be as transparent as much as possible within the scope of law.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70648, "text": "We have carefully reviewed all the requests to ensure that it has a legal basis and is limited to data obtained by law enforcement agencies because of specific investigations and legitimate rights.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70649, "text": "(4) Sharing, transfer, and disclosure of information.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70650, "text": "In the following circumstances, sharing, transfer, and disclose children's information without obtaining the consent of the guardian in advance:", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "In the following circumstances, sharing, transfer, and disclose children's information without obtaining the consent of the guardian in advance:"}
{"task": "rw_99.jsonl", "id": 70651, "text": "1. Directly related to national security and national defense security;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Personal information that shared, transferred, and disclosed directly related to national security and national defense security does not need to agree."}
{"task": "rw_99.jsonl", "id": 70652, "text": "2. Directly related to public safety, public health, and major public interests;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Personal information of sharing, transfer, disclosure directly related to public safety, public health, and major public interests does not need to agree."}
{"task": "rw_99.jsonl", "id": 70653, "text": "3. It is directly related to judicial or administrative law enforcement such as criminal investigation, prosecution, trial and judgment.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Sharing, transfer, disclosure, and personal information directly related to judicial or administrative law enforcement related to criminal investigation, prosecution, trial, and judgment implementation without agreeing."}
{"task": "rw_99.jsonl", "id": 70654, "text": "4. For major legitimate rights and interests such as the life and property of children or other individuals, it is difficult to obtain the consent of the guardian;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Personal information that is shared to maintain major legitimate rights and interests but is difficult to obtain the consent of the guardian, no need to agree."}
{"task": "rw_99.jsonl", "id": 70655, "text": "5. Information by children or guardians to the public by themselves;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Share, transfer, and disclose information that children or guardians disclose to the public by themselves without agreeing."}
{"task": "rw_99.jsonl", "id": 70656, "text": "6. Collect information from the legal publicly disclosed information, such as legal news reports, government information disclosure and other channels;", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Collecting information from legal publicly disclosed information does not need to agree."}
{"task": "rw_99.jsonl", "id": 70657, "text": "7. It is related to the obligations stipulated in the performance of our laws and regulations.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "Sharing, transfer, and disclosure of personal information related to our obligations stipulated in our laws and regulations do not need to agree."}
{"task": "rw_99.jsonl", "id": 70658, "text": "According to the law, sharing, transfer, and disclose personal information that has been identified by de -identified processing, and ensure that the data receiver cannot restore and re -identify the main information of the information, which is not an external sharing, transfer and public disclosure of personal information.The preservation and treatment will not be notified to the guardian and obtain the consent of the guardian.", "label": ["Third Party Sharing/ Disclosure", "Specific Audiences", "Risk", "Important"], "rewrite": "The preservation and processing of personal information that is identified will not be notified to the guardian and obtained consent."}
{"task": "rw_99.jsonl", "id": 70659, "text": "3. How do we store and protect personal information of children", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70660, "text": "(1) In addition to the laws and regulations or regulatory authorities, we only store personal information of children in the purpose of this policy and the shortest time limit.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "Store personal information of children only for the purpose of the purpose of this policy and within the shortest time limit."}
{"task": "rw_99.jsonl", "id": 70661, "text": "If we terminate our services or operations, we will stop the activities of children's personal information in a timely manner. At the same time, we will comply with relevant laws and regulations to notify the guardian in advance, and delete or processes children's personal information after termination of the service or operation.However, except for laws and regulations or regulatory departments.", "label": ["Data Retention", "Specific Audiences", "Important"], "rewrite": "If the service is terminated, it will stop collecting the personal information of children in time, notify the guardian in advance, and delete or anonymous processing of the child's personal information."}
{"task": "rw_99.jsonl", "id": 70662, "text": "(2) We attach great importance to children's privacy and safety, set up a special security team, and take all reasonable and feasible measures to protect personal information:", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Established a special security team and took all reasonable and feasible measures to protect personal information of children."}
{"task": "rw_99.jsonl", "id": 70663, "text": "We will take technical measures such as encryption to store personal information of children to ensure information security.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "Technical measures such as encryption will be adopted to store personal information of children to ensure information security."}
{"task": "rw_99.jsonl", "id": 70664, "text": "At the same time, we strictly set information access permissions to the staff with the principle of minimum authorization, and control the scope of the personal information of children;", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "We have strictly set information access permissions to the principle of minimal authorization, and control the scope of children's personal information."}
{"task": "rw_99.jsonl", "id": 70665, "text": "If a staff member visits the personal information of children, the person in charge of the child's personal information protection or the authorized managers must be approved to record the visits, and take technical measures to avoid illegal copying and downloading personal information of children.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If a staff member visits the personal information of the child, it must be approved by the person in charge of the child's personal information protection or management personnel to record the visits, and take technical measures to avoid illegal replication and download the child's personal information."}
{"task": "rw_99.jsonl", "id": 70666, "text": "If we find that children's personal information may occur or may occur, damage, or lost, the emergency plan will be initiated immediately, remedy measures, and the relevant situation of the incident shall be informed by the email, letter, telephone, push notification, announcement, etc.And children.", "label": ["Specific Audiences", "Data Security", "Important"], "rewrite": "If the child's personal information is found, it will be leaked, damaged, and lost, and an emergency plan will be initiated immediately, remedial measures are taken, and the affected guardians and children will be informed of the incident."}
{"task": "rw_99.jsonl", "id": 70667, "text": "If you want to learn more, please refer to the chapter of \"How can we store and protect personal information\" in \"NetEase Privacy Policy\" and learn more about how we store and protect personal information of children.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70668, "text": "Due to the technical restrictions and the limitations of risk prevention, even if we have tried to strengthen security measures, we cannot always ensure that information is 100 % security.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70669, "text": "The guardian needs to understand that the system and communication network used by children's access to NetEase services may have problems due to the situation outside the control scope.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70670, "text": "The guardians and children are requested to properly keep the NetEase service account, password and other identity elements.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70671, "text": "When children use NetEase services, we will identify their identities through account numbers, passwords and other identity elements.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70672, "text": "Once the guardian and children leak the aforementioned information, they may suffer losses and may adversely affect themselves.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70673, "text": "If the guardian and children find accounts, passwords and/or other identity elements may be leaked, please contact us immediately so that we can take corresponding measures in time to avoid or reduce related losses.", "label": ["Specific Audiences", "Important", "Data Security"], "rewrite": "If the guardian and children find that the identity is possible or has been leaked, please contact us immediately so that you can take corresponding measures in time to avoid or reduce related losses."}
{"task": "rw_99.jsonl", "id": 70674, "text": "4. How to manage children's personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70675, "text": "During the use of NetEase services for children, we will adopt the connection channels listed in the chapter listed in the chapter of the \"How to contact us\" in our single service to ensure that the guardian and children can access, correct, delete, delete it as much as possible as much as possible.Personal information of children, and canceling children's registration accounts.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "It will adopt appropriate operation settings, guidelines or connect channels in a single service to ensure that the guardian and children can access, correct, delete their personal information, and cancel the account."}
{"task": "rw_99.jsonl", "id": 70676, "text": "When visiting, correcting, deleting the aforementioned information or applying for canceling accounts, we may ask the guardian and/or children to verify identity to ensure information security.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70677, "text": "Except for other provisions of laws and regulations, when the guardian and children correct, delete their personal information, or apply for a cancellation account, we may not immediately correct or delete the corresponding information from the backup system, but will be correct or deleted these information when the backup is updated.Essence", "label": ["Important", "Risk", "Edit/Control"], "rewrite": "When the guardian and children are corrected, delete their personal information, or apply for a cancellation account, they may not immediately be more correct or deleted from the backup system, but they will be more correct or deleted when the backup is updated."}
{"task": "rw_99.jsonl", "id": 70678, "text": "(1) Visit children's personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70679, "text": "The guardian and children can view personal information provided or generated in the use of NetEase services, such as personal information, partial records, and publishing content.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "The guardian and children can view their personal information in the process of using the service, such as personal information, partial records, and publishing content."}
{"task": "rw_99.jsonl", "id": 70680, "text": "(2) Correct children's personal information", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70681, "text": "We encourage guardians and children to update and modify their personal information for children to make them more accurate and effective.", "label": [], "rewrite": []}
{"task": "rw_99.jsonl", "id": 70682, "text": "If the guardian and children find that the personal information of the children collected, used and handled is wrong, they can contact us to correct it.", "label": ["Edit/Control", "Specific Audiences", "Important"], "rewrite": "If the personal information of the children collected, used, and processed is wrong, we can contact us to correct it."}
{"task": "rw_99.jsonl", "id": 70683, "text": "We will take timely measures after completing the problems of identity verification and verification.", "label": ["Specific Audiences", "Edit/Control", "Important"], "rewrite": "We will take timely measures after completing the problems of identity verification and verification."}
